waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epwm.h
/**
  *******************************************************************************************************
  * @file    fm33Fk5xx_fl_epwm.h
  * @author  FMSH Application Team
  * @brief   Head file of EPWM FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */

/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FK5XX_FL_EPWM_H
#define __FM33FK5XX_FL_EPWM_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fk5xx_fl_def.h"
/** @addtogroup FM33FK5XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup EPWM_FL_ES_INIT EPWM Exported Init structures
  * @{
  */

/**
  * @brief FL EPWM Init Sturcture definition
  */
typedef struct
{
    /*! 时钟源 */
    uint32_t clockSrc;
    /*! 预分频系数 */
    uint32_t prescaler;
    /*! 计数模式 */
    uint32_t counterMode;
    /*! 自动重装载值 */
    uint32_t period;
    /*! 相位值 */
    uint32_t phase;
    /*! PRD预装载使能 */
    uint32_t periodAutoReload;
    /*! 相位装载使能 */
    uint32_t phaseLoad;
    /*! DBG模式 */
    uint32_t DBGMode;
    /*! 初始计数方向 */
    uint32_t startCounterDir;
} FL_EPWM_InitTypeDef;

/**
  * @brief  TIM Output Compare configuration structure definition.
  */
typedef struct
{
    /*! 通道预装载使能 */
    uint32_t OCautoReload;
    /*! 通道A影子寄存器生效时刻 */
    uint32_t OCLoadtrigger;
    /*! 向下计数CNT=CMPB时的输出动作 */
    uint32_t OCMode_CNTEqualCMPB_DirDown;
    /*! 向上计数CNT=CMPB时的输出动作 */
    uint32_t OCMode_CNTEqualCMPB_DirUp;
    /*! 向下计数CNT=CMPA时的输出动作 */
    uint32_t OCMode_CNTEqualCMPA_DirDown;
    /*! 向上计数CNT=CMPA时的输出动作 */
    uint32_t OCMode_CNTEqualCMPA_DirUp;
    /*! CNT=PRD时的输出动作 */
    uint32_t OCMode_CNTEqualPRD;
    /*! CNT=ZRO时的输出动作 */
    uint32_t OCMode_CNTEqualZRO;

} FL_EPWM_OC_InitTypeDef;
/**
  * @brief  TIM Compare configuration structure definition.
  */
typedef struct
{
    /*! CMPA预装载使能 */
    uint32_t CMPAutoReload;
    /*! CMPA影子寄存器生效时刻 */
    uint32_t CMPLoadTrigger;

} FL_EPWM_CMP_InitTypeDef;

/**
  * @brief  DT (Dead Time) structure definition
  */
typedef struct
{
    /*! 下降沿延迟信号输入源 */
    uint32_t FEDSrc;
    /*! 上升沿延迟信号输入源 */
    uint32_t REDSrc;
    /*! EPWM输出极性选择 */
    uint32_t ChannelOutputPolar;
    /*! EPWMB bypass使能 */
    uint32_t ChannelBypass;
    /*! 上升沿延迟时间 */
    uint32_t REDDelayTime;
    /*! 下降沿延迟时间 */
    uint32_t FEDDelayTime;
} FL_EPWM_DT_InitTypeDef;

/**
  * @brief  CHP (Chopper) structure definition
  */
typedef struct
{
    /*! Chopper高电平宽度 */
    uint32_t chopperHighWidth;
    /*! Chopper低电平宽度 */
    uint32_t chopperLowWidth;
    /*! One-Shot 脉冲宽度 */
    uint32_t oneShotPulseWidth;
    /*! One-Shot 脉冲使能 */
    uint32_t oneShotMode;
    /*! channelChopper使能 */
    uint32_t channelChopper;
} FL_EPWM_CHP_InitTypeDef;

/**
  * @brief  BRK (Break) structure definition
  */
typedef struct
{
    /*! DCBEVT事件有效配置 */
    uint32_t DCBEVTActive;
    /*! DCAEVT事件有效配置 */
    uint32_t DCAEVTActive;
    /*! DCBL输入源 */
    uint32_t DCBLInputSrc;
    /*! DCBH输入源 */
    uint32_t DCBHInputSrc;
    /*! DCAL输入源 */
    uint32_t DCALInputSrc;
    /*! DCAH输入源 */
    uint32_t DCAHInputSrc;
} FL_EPWM_DCEvent_InitTypeDef;

/**
  * @brief  SOC (Break) structure definition
  */
typedef struct
{
    /*! Pulse CNT中断信号源选择 */
    uint32_t pulseCNTInterruptSrc;
    /*! SOCB信号源选择 */
    uint32_t SOCBInputSrc;
    /*! SOCA信号源选择 */
    uint32_t SOCAInputSrc;
    /*! SOCB事件使能 */
    uint32_t SOCBEventState;
    /*! SOCA事件使能 */
    uint32_t SOCAEventState;
    /*! Pulse CNT事件预分频 */
    uint32_t pulseCNTEventPsc;
    /*! SOCB事件预分频 */
    uint32_t SOCBEventPsc;
    /*! SOCA事件预分频 */
    uint32_t SOCAEventPsc;
} FL_EPWM_SOC_InitTypeDef;

/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup EPWM_FL_Exported_Constants EPWM Exported Constants
  * @{
  */

#define    EPWM_PRD_PRD_Pos                                       (0U)
#define    EPWM_PRD_PRD_Msk                                       (0xffffU << EPWM_PRD_PRD_Pos)
#define    EPWM_PRD_PRD                                           EPWM_PRD_PRD_Msk

#define    EPWM_PHSR_PHS_Pos                                      (0U)
#define    EPWM_PHSR_PHS_Msk                                      (0xffffU << EPWM_PHSR_PHS_Pos)
#define    EPWM_PHSR_PHS                                          EPWM_PHSR_PHS_Msk

#define    EPWM_PSC_PSC_Pos                                       (0U)
#define    EPWM_PSC_PSC_Msk                                       (0xffffU << EPWM_PSC_PSC_Pos)
#define    EPWM_PSC_PSC                                           EPWM_PSC_PSC_Msk

#define    EPWM_CNTR_CNT_Pos                                      (0U)
#define    EPWM_CNTR_CNT_Msk                                      (0xffffU << EPWM_CNTR_CNT_Pos)
#define    EPWM_CNTR_CNT                                          EPWM_CNTR_CNT_Msk

#define    EPWM_TBCR_DBGMODE_Pos                                  (8U)
#define    EPWM_TBCR_DBGMODE_Msk                                  (0x3U << EPWM_TBCR_DBGMODE_Pos)
#define    EPWM_TBCR_DBGMODE                                      EPWM_TBCR_DBGMODE_Msk

#define    EPWM_TBCR_PHSDIR_Pos                                   (7U)
#define    EPWM_TBCR_PHSDIR_Msk                                   (0x1U << EPWM_TBCR_PHSDIR_Pos)
#define    EPWM_TBCR_PHSDIR                                       EPWM_TBCR_PHSDIR_Msk

