waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epwm.h
#define    EPWM_TBCR_OSTSYNCO_Pos                                 (5U)
#define    EPWM_TBCR_OSTSYNCO_Msk                                 (0x1U << EPWM_TBCR_OSTSYNCO_Pos)
#define    EPWM_TBCR_OSTSYNCO                                     EPWM_TBCR_OSTSYNCO_Msk

#define    EPWM_TBCR_OSTSYNCOEN_Pos                               (4U)
#define    EPWM_TBCR_OSTSYNCOEN_Msk                               (0x1U << EPWM_TBCR_OSTSYNCOEN_Pos)
#define    EPWM_TBCR_OSTSYNCOEN                                   EPWM_TBCR_OSTSYNCOEN_Msk

#define    EPWM_TBCR_PRDSHEN_Pos                                  (3U)
#define    EPWM_TBCR_PRDSHEN_Msk                                  (0x1U << EPWM_TBCR_PRDSHEN_Pos)
#define    EPWM_TBCR_PRDSHEN                                      EPWM_TBCR_PRDSHEN_Msk

#define    EPWM_TBCR_PHSEN_Pos                                    (2U)
#define    EPWM_TBCR_PHSEN_Msk                                    (0x1U << EPWM_TBCR_PHSEN_Pos)
#define    EPWM_TBCR_PHSEN                                        EPWM_TBCR_PHSEN_Msk

#define    EPWM_TBCR_CNTMODE_Pos                                  (0U)
#define    EPWM_TBCR_CNTMODE_Msk                                  (0x3U << EPWM_TBCR_CNTMODE_Pos)
#define    EPWM_TBCR_CNTMODE                                      EPWM_TBCR_CNTMODE_Msk

#define    EPWM_TBSR_CNTMAX_Pos                                   (2U)
#define    EPWM_TBSR_CNTMAX_Msk                                   (0x1U << EPWM_TBSR_CNTMAX_Pos)
#define    EPWM_TBSR_CNTMAX                                       EPWM_TBSR_CNTMAX_Msk

#define    EPWM_TBSR_SYNCIF_Pos                                   (1U)
#define    EPWM_TBSR_SYNCIF_Msk                                   (0x1U << EPWM_TBSR_SYNCIF_Pos)
#define    EPWM_TBSR_SYNCIF                                       EPWM_TBSR_SYNCIF_Msk

#define    EPWM_TBSR_CNTDIR_Pos                                   (0U)
#define    EPWM_TBSR_CNTDIR_Msk                                   (0x1U << EPWM_TBSR_CNTDIR_Pos)
#define    EPWM_TBSR_CNTDIR                                       EPWM_TBSR_CNTDIR_Msk

#define    EPWM_SYNC_SWSYNCOEN_Pos                                (7U)
#define    EPWM_SYNC_SWSYNCOEN_Msk                                (0x1ffU << EPWM_SYNC_SWSYNCOEN_Pos)
#define    EPWM_SYNC_SWSYNCOEN                                    EPWM_SYNC_SWSYNCOEN_Msk

#define    EPWM_SYNC_SYNCINSEL_Pos                                (0U)
#define    EPWM_SYNC_SYNCINSEL_Msk                                (0xfU << EPWM_SYNC_SYNCINSEL_Pos)
#define    EPWM_SYNC_SYNCINSEL                                    EPWM_SYNC_SYNCINSEL_Msk

#define    EPWM_SWACT_SWSYNC_Pos                                  (0U)
#define    EPWM_SWACT_SWSYNC_Msk                                  (0x1U << EPWM_SWACT_SWSYNC_Pos)
#define    EPWM_SWACT_SWSYNC                                      EPWM_SWACT_SWSYNC_Msk

#define    EPWM_CMPA_CMPA_Pos                                     (0U)
#define    EPWM_CMPA_CMPA_Msk                                     (0xffffU << EPWM_CMPA_CMPA_Pos)
#define    EPWM_CMPA_CMPA                                         EPWM_CMPA_CMPA_Msk

#define    EPWM_CMPB_CMPB_Pos                                     (0U)
#define    EPWM_CMPB_CMPB_Msk                                     (0xffffU << EPWM_CMPB_CMPB_Pos)
#define    EPWM_CMPB_CMPB                                         EPWM_CMPB_CMPB_Msk

#define    EPWM_CMPC_CMPC_Pos                                     (0U)
#define    EPWM_CMPC_CMPC_Msk                                     (0xffffU << EPWM_CMPC_CMPC_Pos)
#define    EPWM_CMPC_CMPC                                         EPWM_CMPC_CMPC_Msk

#define    EPWM_CMPD_CMPD_Pos                                     (0U)
#define    EPWM_CMPD_CMPD_Msk                                     (0xffffU << EPWM_CMPD_CMPD_Pos)
#define    EPWM_CMPD_CMPD                                         EPWM_CMPD_CMPD_Msk

#define    EPWM_CCR_CMPDSHEN_Pos                                  (26U)
#define    EPWM_CCR_CMPDSHEN_Msk                                  (0x1U << EPWM_CCR_CMPDSHEN_Pos)
#define    EPWM_CCR_CMPDSHEN                                      EPWM_CCR_CMPDSHEN_Msk

#define    EPWM_CCR_CMPCSHEN_Pos                                  (24U)
#define    EPWM_CCR_CMPCSHEN_Msk                                  (0x1U << EPWM_CCR_CMPCSHEN_Pos)
#define    EPWM_CCR_CMPCSHEN                                      EPWM_CCR_CMPCSHEN_Msk

#define    EPWM_CCR_LDCMPD_Pos                                    (20U)
#define    EPWM_CCR_LDCMPD_Msk                                    (0x7U << EPWM_CCR_LDCMPD_Pos)
#define    EPWM_CCR_LDCMPD                                        EPWM_CCR_LDCMPD_Msk

#define    EPWM_CCR_LDCMPC_Pos                                    (16U)
#define    EPWM_CCR_LDCMPC_Msk                                    (0x7U << EPWM_CCR_LDCMPC_Pos)
#define    EPWM_CCR_LDCMPC                                        EPWM_CCR_LDCMPC_Msk

#define    EPWM_CCR_CMPBSHEN_Pos                                  (10U)
#define    EPWM_CCR_CMPBSHEN_Msk                                  (0x1U << EPWM_CCR_CMPBSHEN_Pos)
#define    EPWM_CCR_CMPBSHEN                                      EPWM_CCR_CMPBSHEN_Msk

#define    EPWM_CCR_CMPASHEN_Pos                                  (8U)
#define    EPWM_CCR_CMPASHEN_Msk                                  (0x1U << EPWM_CCR_CMPASHEN_Pos)
#define    EPWM_CCR_CMPASHEN                                      EPWM_CCR_CMPASHEN_Msk

#define    EPWM_CCR_LDCMPB_Pos                                    (4U)
#define    EPWM_CCR_LDCMPB_Msk                                    (0x7U << EPWM_CCR_LDCMPB_Pos)
#define    EPWM_CCR_LDCMPB                                        EPWM_CCR_LDCMPB_Msk

#define    EPWM_CCR_LDCMPA_Pos                                    (0U)
#define    EPWM_CCR_LDCMPA_Msk                                    (0x7U << EPWM_CCR_LDCMPA_Pos)
#define    EPWM_CCR_LDCMPA                                        EPWM_CCR_LDCMPA_Msk

#define    EPWM_OACR_OACRSHEN_Pos                                 (15U)
#define    EPWM_OACR_OACRSHEN_Msk                                 (0x1U << EPWM_OACR_OACRSHEN_Pos)
#define    EPWM_OACR_OACRSHEN                                     EPWM_OACR_OACRSHEN_Msk

#define    EPWM_OACR_LDOA_Pos                                     (12U)
#define    EPWM_OACR_LDOA_Msk                                     (0x7U << EPWM_OACR_LDOA_Pos)
#define    EPWM_OACR_LDOA                                         EPWM_OACR_LDOA_Msk

#define    EPWM_OACR_CBD_Pos                                      (10U)
#define    EPWM_OACR_CBD_Msk                                      (0x3U << EPWM_OACR_CBD_Pos)
#define    EPWM_OACR_CBD                                          EPWM_OACR_CBD_Msk

#define    EPWM_OACR_CBU_Pos                                      (8U)
#define    EPWM_OACR_CBU_Msk                                      (0x3U << EPWM_OACR_CBU_Pos)
#define    EPWM_OACR_CBU                                          EPWM_OACR_CBU_Msk

#define    EPWM_OACR_CAD_Pos                                      (6U)
#define    EPWM_OACR_CAD_Msk                                      (0x3U << EPWM_OACR_CAD_Pos)
#define    EPWM_OACR_CAD                                          EPWM_OACR_CAD_Msk

#define    EPWM_OACR_CAU_Pos                                      (4U)
#define    EPWM_OACR_CAU_Msk                                      (0x3U << EPWM_OACR_CAU_Pos)
#define    EPWM_OACR_CAU                                          EPWM_OACR_CAU_Msk

