waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epwm.h
#define    EPWM_OACR_PRD_Pos                                      (2U)
#define    EPWM_OACR_PRD_Msk                                      (0x3U << EPWM_OACR_PRD_Pos)
#define    EPWM_OACR_PRD                                          EPWM_OACR_PRD_Msk

#define    EPWM_OACR_ZRO_Pos                                      (0U)
#define    EPWM_OACR_ZRO_Msk                                      (0x3U << EPWM_OACR_ZRO_Pos)
#define    EPWM_OACR_ZRO                                          EPWM_OACR_ZRO_Msk

#define    EPWM_SFCR_LDSFR_Pos                                    (8U)
#define    EPWM_SFCR_LDSFR_Msk                                    (0x3U << EPWM_SFCR_LDSFR_Pos)
#define    EPWM_SFCR_LDSFR                                        EPWM_SFCR_LDSFR_Msk

#define    EPWM_SFCR_ACTOTSFB_Pos                                 (4U)
#define    EPWM_SFCR_ACTOTSFB_Msk                                 (0x3U << EPWM_SFCR_ACTOTSFB_Pos)
#define    EPWM_SFCR_ACTOTSFB                                     EPWM_SFCR_ACTOTSFB_Msk

#define    EPWM_SFCR_ACTOTSFA_Pos                                 (0U)
#define    EPWM_SFCR_ACTOTSFA_Msk                                 (0x3U << EPWM_SFCR_ACTOTSFA_Pos)
#define    EPWM_SFCR_ACTOTSFA                                     EPWM_SFCR_ACTOTSFA_Msk

#define    EPWM_SFR_OTSFB_Pos                                     (6U)
#define    EPWM_SFR_OTSFB_Msk                                     (0x1U << EPWM_SFR_OTSFB_Pos)
#define    EPWM_SFR_OTSFB                                         EPWM_SFR_OTSFB_Msk

#define    EPWM_SFR_OTSFA_Pos                                     (4U)
#define    EPWM_SFR_OTSFA_Msk                                     (0x1U << EPWM_SFR_OTSFA_Pos)
#define    EPWM_SFR_OTSFA                                         EPWM_SFR_OTSFA_Msk

#define    EPWM_SFR_CSFA_Pos                                      (0U)
#define    EPWM_SFR_CSFA_Msk                                      (0x3U << EPWM_SFR_CSFA_Pos)
#define    EPWM_SFR_CSFA                                          EPWM_SFR_CSFA_Msk

#define    EPWM_DTCR_FEDSEL_Pos                                   (5U)
#define    EPWM_DTCR_FEDSEL_Msk                                   (0x1U << EPWM_DTCR_FEDSEL_Pos)
#define    EPWM_DTCR_FEDSEL                                       EPWM_DTCR_FEDSEL_Msk

#define    EPWM_DTCR_REDSEL_Pos                                   (4U)
#define    EPWM_DTCR_REDSEL_Msk                                   (0x1U << EPWM_DTCR_REDSEL_Pos)
#define    EPWM_DTCR_REDSEL                                       EPWM_DTCR_REDSEL_Msk

#define    EPWM_DTCR_POLSELA_Pos                                  (2U)
#define    EPWM_DTCR_POLSELA_Msk                                  (0x1U << EPWM_DTCR_POLSELA_Pos)
#define    EPWM_DTCR_POLSELA                                      EPWM_DTCR_POLSELA_Msk

#define    EPWM_DTCR_BYPASSA_Pos                                  (0U)
#define    EPWM_DTCR_BYPASSA_Msk                                  (0x1U << EPWM_DTCR_BYPASSA_Pos)
#define    EPWM_DTCR_BYPASSA                                      EPWM_DTCR_BYPASSA_Msk

#define    EPWM_DTDLY_RED_Pos                                     (16U)
#define    EPWM_DTDLY_RED_Msk                                     (0x3ffU << EPWM_DTDLY_RED_Pos)
#define    EPWM_DTDLY_RED                                         EPWM_DTDLY_RED_Msk

#define    EPWM_DTDLY_FED_Pos                                     (0U)
#define    EPWM_DTDLY_FED_Msk                                     (0x3ffU << EPWM_DTDLY_FED_Pos)
#define    EPWM_DTDLY_FED                                         EPWM_DTDLY_FED_Msk

#define    EPWM_CPCR_CHPHW_Pos                                    (16U)
#define    EPWM_CPCR_CHPHW_Msk                                    (0x3fU << EPWM_CPCR_CHPHW_Pos)
#define    EPWM_CPCR_CHPHW                                        EPWM_CPCR_CHPHW_Msk

#define    EPWM_CPCR_CHPLW_Pos                                    (8U)
#define    EPWM_CPCR_CHPLW_Msk                                    (0x3fU << EPWM_CPCR_CHPLW_Pos)
#define    EPWM_CPCR_CHPLW                                        EPWM_CPCR_CHPLW_Msk

#define    EPWM_CPCR_OSPW_Pos                                     (4U)
#define    EPWM_CPCR_OSPW_Msk                                     (0xfU << EPWM_CPCR_OSPW_Pos)
#define    EPWM_CPCR_OSPW                                         EPWM_CPCR_OSPW_Msk

#define    EPWM_CPCR_OSPEN_Pos                                    (2U)
#define    EPWM_CPCR_OSPEN_Msk                                    (0x1U << EPWM_CPCR_OSPEN_Pos)
#define    EPWM_CPCR_OSPEN                                        EPWM_CPCR_OSPEN_Msk

#define    EPWM_CPCR_CHPENA_Pos                                   (0U)
#define    EPWM_CPCR_CHPENA_Msk                                   (0x1U << EPWM_CPCR_CHPENA_Pos)
#define    EPWM_CPCR_CHPENA                                       EPWM_CPCR_CHPENA_Msk

#define    EPWM_BKCFR_DCBEVT2_TZEN_Pos                            (19U)
#define    EPWM_BKCFR_DCBEVT2_TZEN_Msk                            (0x1U << EPWM_BKCFR_DCBEVT2_TZEN_Pos)
#define    EPWM_BKCFR_DCBEVT2_TZEN                                EPWM_BKCFR_DCBEVT2_TZEN_Msk

#define    EPWM_BKCFR_DCBEVT1_TZEN_Pos                            (18U)
#define    EPWM_BKCFR_DCBEVT1_TZEN_Msk                            (0x1U << EPWM_BKCFR_DCBEVT1_TZEN_Pos)
#define    EPWM_BKCFR_DCBEVT1_TZEN                                EPWM_BKCFR_DCBEVT1_TZEN_Msk

#define    EPWM_BKCFR_DCAEVT2_TZEN_Pos                            (17U)
#define    EPWM_BKCFR_DCAEVT2_TZEN_Msk                            (0x1U << EPWM_BKCFR_DCAEVT2_TZEN_Pos)
#define    EPWM_BKCFR_DCAEVT2_TZEN                                EPWM_BKCFR_DCAEVT2_TZEN_Msk

#define    EPWM_BKCFR_DCAEVT1_TZEN_Pos                            (16U)
#define    EPWM_BKCFR_DCAEVT1_TZEN_Msk                            (0x1U << EPWM_BKCFR_DCAEVT1_TZEN_Pos)
#define    EPWM_BKCFR_DCAEVT1_TZEN                                EPWM_BKCFR_DCAEVT1_TZEN_Msk

#define    EPWM_BKCFR_DCBEVT1_OSTEN_Pos                           (15U)
#define    EPWM_BKCFR_DCBEVT1_OSTEN_Msk                           (0x1U << EPWM_BKCFR_DCBEVT1_OSTEN_Pos)
#define    EPWM_BKCFR_DCBEVT1_OSTEN                               EPWM_BKCFR_DCBEVT1_OSTEN_Msk

#define    EPWM_BKCFR_DCAEVT1_OSTEN_Pos                           (14U)
#define    EPWM_BKCFR_DCAEVT1_OSTEN_Msk                           (0x1U << EPWM_BKCFR_DCAEVT1_OSTEN_Pos)
#define    EPWM_BKCFR_DCAEVT1_OSTEN                               EPWM_BKCFR_DCAEVT1_OSTEN_Msk

#define    EPWM_BKCFR_OSTEN_Pos                                   (8U)
#define    EPWM_BKCFR_OSTEN_Msk                                   (0x1U << EPWM_BKCFR_OSTEN_Pos)
#define    EPWM_BKCFR_OSTEN                                       EPWM_BKCFR_OSTEN_Msk

#define    EPWM_BKCFR_DCBEVT2_CBCEN_Pos                           (7U)
#define    EPWM_BKCFR_DCBEVT2_CBCEN_Msk                           (0x1U << EPWM_BKCFR_DCBEVT2_CBCEN_Pos)
#define    EPWM_BKCFR_DCBEVT2_CBCEN                               EPWM_BKCFR_DCBEVT2_CBCEN_Msk

#define    EPWM_BKCFR_DCAEVT2_CBCEN_Pos                           (6U)
#define    EPWM_BKCFR_DCAEVT2_CBCEN_Msk                           (0x1U << EPWM_BKCFR_DCAEVT2_CBCEN_Pos)
#define    EPWM_BKCFR_DCAEVT2_CBCEN                               EPWM_BKCFR_DCAEVT2_CBCEN_Msk

#define    EPWM_BKCFR_CBCEN_Pos                                   (0U)
#define    EPWM_BKCFR_CBCEN_Msk                                   (0x1U << EPWM_BKCFR_CBCEN_Pos)
#define    EPWM_BKCFR_CBCEN                                       EPWM_BKCFR_CBCEN_Msk

