waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epwm.h
#define    EPWM_BKCR_DCBEVT2_Pos                                  (10U)
#define    EPWM_BKCR_DCBEVT2_Msk                                  (0x3U << EPWM_BKCR_DCBEVT2_Pos)
#define    EPWM_BKCR_DCBEVT2                                      EPWM_BKCR_DCBEVT2_Msk

#define    EPWM_BKCR_DCBEVT1_Pos                                  (8U)
#define    EPWM_BKCR_DCBEVT1_Msk                                  (0x3U << EPWM_BKCR_DCBEVT1_Pos)
#define    EPWM_BKCR_DCBEVT1                                      EPWM_BKCR_DCBEVT1_Msk

#define    EPWM_BKCR_DCAEVT2_Pos                                  (6U)
#define    EPWM_BKCR_DCAEVT2_Msk                                  (0x3U << EPWM_BKCR_DCAEVT2_Pos)
#define    EPWM_BKCR_DCAEVT2                                      EPWM_BKCR_DCAEVT2_Msk

#define    EPWM_BKCR_DCAEVT1_Pos                                  (4U)
#define    EPWM_BKCR_DCAEVT1_Msk                                  (0x3U << EPWM_BKCR_DCAEVT1_Pos)
#define    EPWM_BKCR_DCAEVT1                                      EPWM_BKCR_DCAEVT1_Msk

#define    EPWM_BKCR_TZA_Pos                                      (0U)
#define    EPWM_BKCR_TZA_Msk                                      (0x3U << EPWM_BKCR_TZA_Pos)
#define    EPWM_BKCR_TZA                                          EPWM_BKCR_TZA_Msk

#define    EPWM_BKIER_DCBEVT2IE_Pos                               (6U)
#define    EPWM_BKIER_DCBEVT2IE_Msk                               (0x1U << EPWM_BKIER_DCBEVT2IE_Pos)
#define    EPWM_BKIER_DCBEVT2IE                                   EPWM_BKIER_DCBEVT2IE_Msk

#define    EPWM_BKIER_DCBEVT1IE_Pos                               (5U)
#define    EPWM_BKIER_DCBEVT1IE_Msk                               (0x1U << EPWM_BKIER_DCBEVT1IE_Pos)
#define    EPWM_BKIER_DCBEVT1IE                                   EPWM_BKIER_DCBEVT1IE_Msk

#define    EPWM_BKIER_DCAEVT2IE_Pos                               (4U)
#define    EPWM_BKIER_DCAEVT2IE_Msk                               (0x1U << EPWM_BKIER_DCAEVT2IE_Pos)
#define    EPWM_BKIER_DCAEVT2IE                                   EPWM_BKIER_DCAEVT2IE_Msk

#define    EPWM_BKIER_DCAEVT1IE_Pos                               (3U)
#define    EPWM_BKIER_DCAEVT1IE_Msk                               (0x1U << EPWM_BKIER_DCAEVT1IE_Pos)
#define    EPWM_BKIER_DCAEVT1IE                                   EPWM_BKIER_DCAEVT1IE_Msk

#define    EPWM_BKIER_OSTIE_Pos                                   (2U)
#define    EPWM_BKIER_OSTIE_Msk                                   (0x1U << EPWM_BKIER_OSTIE_Pos)
#define    EPWM_BKIER_OSTIE                                       EPWM_BKIER_OSTIE_Msk

#define    EPWM_BKIER_CBCIE_Pos                                   (1U)
#define    EPWM_BKIER_CBCIE_Msk                                   (0x1U << EPWM_BKIER_CBCIE_Pos)
#define    EPWM_BKIER_CBCIE                                       EPWM_BKIER_CBCIE_Msk

#define    EPWM_BKISR_OST_DCBEVT1_Pos                             (31U)
#define    EPWM_BKISR_OST_DCBEVT1_Msk                             (0x1U << EPWM_BKISR_OST_DCBEVT1_Pos)
#define    EPWM_BKISR_OST_DCBEVT1                                 EPWM_BKISR_OST_DCBEVT1_Msk

#define    EPWM_BKISR_OST_DCAEVT1_Pos                             (30U)
#define    EPWM_BKISR_OST_DCAEVT1_Msk                             (0x1U << EPWM_BKISR_OST_DCAEVT1_Pos)
#define    EPWM_BKISR_OST_DCAEVT1                                 EPWM_BKISR_OST_DCAEVT1_Msk

#define    EPWM_BKISR_OST6_Pos                                    (29U)
#define    EPWM_BKISR_OST6_Msk                                    (0x1U << EPWM_BKISR_OST6_Pos)
#define    EPWM_BKISR_OST6                                        EPWM_BKISR_OST6_Msk

#define    EPWM_BKISR_OST5_Pos                                    (28U)
#define    EPWM_BKISR_OST5_Msk                                    (0x1U << EPWM_BKISR_OST5_Pos)
#define    EPWM_BKISR_OST5                                        EPWM_BKISR_OST5_Msk

#define    EPWM_BKISR_OST4_Pos                                    (27U)
#define    EPWM_BKISR_OST4_Msk                                    (0x1U << EPWM_BKISR_OST4_Pos)
#define    EPWM_BKISR_OST4                                        EPWM_BKISR_OST4_Msk

#define    EPWM_BKISR_OST3_Pos                                    (26U)
#define    EPWM_BKISR_OST3_Msk                                    (0x1U << EPWM_BKISR_OST3_Pos)
#define    EPWM_BKISR_OST3                                        EPWM_BKISR_OST3_Msk

#define    EPWM_BKISR_OST2_Pos                                    (25U)
#define    EPWM_BKISR_OST2_Msk                                    (0x1U << EPWM_BKISR_OST2_Pos)
#define    EPWM_BKISR_OST2                                        EPWM_BKISR_OST2_Msk

#define    EPWM_BKISR_OST1_Pos                                    (24U)
#define    EPWM_BKISR_OST1_Msk                                    (0x1U << EPWM_BKISR_OST1_Pos)
#define    EPWM_BKISR_OST1                                        EPWM_BKISR_OST1_Msk

#define    EPWM_BKISR_CBC_DCBEVT2_Pos                             (23U)
#define    EPWM_BKISR_CBC_DCBEVT2_Msk                             (0x1U << EPWM_BKISR_CBC_DCBEVT2_Pos)
#define    EPWM_BKISR_CBC_DCBEVT2                                 EPWM_BKISR_CBC_DCBEVT2_Msk

#define    EPWM_BKISR_CBC_DCAEVT2_Pos                             (22U)
#define    EPWM_BKISR_CBC_DCAEVT2_Msk                             (0x1U << EPWM_BKISR_CBC_DCAEVT2_Pos)
#define    EPWM_BKISR_CBC_DCAEVT2                                 EPWM_BKISR_CBC_DCAEVT2_Msk

#define    EPWM_BKISR_CBC6_Pos                                    (21U)
#define    EPWM_BKISR_CBC6_Msk                                    (0x1U << EPWM_BKISR_CBC6_Pos)
#define    EPWM_BKISR_CBC6                                        EPWM_BKISR_CBC6_Msk

#define    EPWM_BKISR_CBC5_Pos                                    (20U)
#define    EPWM_BKISR_CBC5_Msk                                    (0x1U << EPWM_BKISR_CBC5_Pos)
#define    EPWM_BKISR_CBC5                                        EPWM_BKISR_CBC5_Msk

#define    EPWM_BKISR_CBC4_Pos                                    (19U)
#define    EPWM_BKISR_CBC4_Msk                                    (0x1U << EPWM_BKISR_CBC4_Pos)
#define    EPWM_BKISR_CBC4                                        EPWM_BKISR_CBC4_Msk

#define    EPWM_BKISR_CBC3_Pos                                    (18U)
#define    EPWM_BKISR_CBC3_Msk                                    (0x1U << EPWM_BKISR_CBC3_Pos)
#define    EPWM_BKISR_CBC3                                        EPWM_BKISR_CBC3_Msk

#define    EPWM_BKISR_CBC2_Pos                                    (17U)
#define    EPWM_BKISR_CBC2_Msk                                    (0x1U << EPWM_BKISR_CBC2_Pos)
#define    EPWM_BKISR_CBC2                                        EPWM_BKISR_CBC2_Msk

#define    EPWM_BKISR_CBC1_Pos                                    (16U)
#define    EPWM_BKISR_CBC1_Msk                                    (0x1U << EPWM_BKISR_CBC1_Pos)
#define    EPWM_BKISR_CBC1                                        EPWM_BKISR_CBC1_Msk

#define    EPWM_BKISR_DCBEVT2IF_Pos                               (6U)
#define    EPWM_BKISR_DCBEVT2IF_Msk                               (0x1U << EPWM_BKISR_DCBEVT2IF_Pos)
#define    EPWM_BKISR_DCBEVT2IF                                   EPWM_BKISR_DCBEVT2IF_Msk

#define    EPWM_BKISR_DCBEVT1IF_Pos                               (5U)
#define    EPWM_BKISR_DCBEVT1IF_Msk                               (0x1U << EPWM_BKISR_DCBEVT1IF_Pos)
#define    EPWM_BKISR_DCBEVT1IF                                   EPWM_BKISR_DCBEVT1IF_Msk

#define    EPWM_BKISR_DCAEVT2IF_Pos                               (4U)
#define    EPWM_BKISR_DCAEVT2IF_Msk                               (0x1U << EPWM_BKISR_DCAEVT2IF_Pos)
#define    EPWM_BKISR_DCAEVT2IF                                   EPWM_BKISR_DCAEVT2IF_Msk

