waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epwm.h
#define    EPWM_BKISR_DCAEVT1IF_Pos                               (3U)
#define    EPWM_BKISR_DCAEVT1IF_Msk                               (0x1U << EPWM_BKISR_DCAEVT1IF_Pos)
#define    EPWM_BKISR_DCAEVT1IF                                   EPWM_BKISR_DCAEVT1IF_Msk

#define    EPWM_BKISR_OSTIF_Pos                                   (2U)
#define    EPWM_BKISR_OSTIF_Msk                                   (0x1U << EPWM_BKISR_OSTIF_Pos)
#define    EPWM_BKISR_OSTIF                                       EPWM_BKISR_OSTIF_Msk

#define    EPWM_BKISR_CBCIF_Pos                                   (1U)
#define    EPWM_BKISR_CBCIF_Msk                                   (0x1U << EPWM_BKISR_CBCIF_Pos)
#define    EPWM_BKISR_CBCIF                                       EPWM_BKISR_CBCIF_Msk

#define    EPWM_BKCLR_DCBEVT2C_Pos                                (6U)
#define    EPWM_BKCLR_DCBEVT2C_Msk                                (0x1U << EPWM_BKCLR_DCBEVT2C_Pos)
#define    EPWM_BKCLR_DCBEVT2C                                    EPWM_BKCLR_DCBEVT2C_Msk

#define    EPWM_BKCLR_DCBEVT1C_Pos                                (5U)
#define    EPWM_BKCLR_DCBEVT1C_Msk                                (0x1U << EPWM_BKCLR_DCBEVT1C_Pos)
#define    EPWM_BKCLR_DCBEVT1C                                    EPWM_BKCLR_DCBEVT1C_Msk

#define    EPWM_BKCLR_DCAEVT2C_Pos                                (4U)
#define    EPWM_BKCLR_DCAEVT2C_Msk                                (0x1U << EPWM_BKCLR_DCAEVT2C_Pos)
#define    EPWM_BKCLR_DCAEVT2C                                    EPWM_BKCLR_DCAEVT2C_Msk

#define    EPWM_BKCLR_DCAEVT1C_Pos                                (3U)
#define    EPWM_BKCLR_DCAEVT1C_Msk                                (0x1U << EPWM_BKCLR_DCAEVT1C_Pos)
#define    EPWM_BKCLR_DCAEVT1C                                    EPWM_BKCLR_DCAEVT1C_Msk

#define    EPWM_BKCLR_OSTC_Pos                                    (2U)
#define    EPWM_BKCLR_OSTC_Msk                                    (0x1U << EPWM_BKCLR_OSTC_Pos)
#define    EPWM_BKCLR_OSTC                                        EPWM_BKCLR_OSTC_Msk

#define    EPWM_BKCLR_CBCC_Pos                                    (1U)
#define    EPWM_BKCLR_CBCC_Msk                                    (0x1U << EPWM_BKCLR_CBCC_Pos)
#define    EPWM_BKCLR_CBCC                                        EPWM_BKCLR_CBCC_Msk

#define    EPWM_BKSFR_DCBEVT2SF_Pos                               (6U)
#define    EPWM_BKSFR_DCBEVT2SF_Msk                               (0x1U << EPWM_BKSFR_DCBEVT2SF_Pos)
#define    EPWM_BKSFR_DCBEVT2SF                                   EPWM_BKSFR_DCBEVT2SF_Msk

#define    EPWM_BKSFR_DCBEVT1SF_Pos                               (5U)
#define    EPWM_BKSFR_DCBEVT1SF_Msk                               (0x1U << EPWM_BKSFR_DCBEVT1SF_Pos)
#define    EPWM_BKSFR_DCBEVT1SF                                   EPWM_BKSFR_DCBEVT1SF_Msk

#define    EPWM_BKSFR_DCAEVT2SF_Pos                               (4U)
#define    EPWM_BKSFR_DCAEVT2SF_Msk                               (0x1U << EPWM_BKSFR_DCAEVT2SF_Pos)
#define    EPWM_BKSFR_DCAEVT2SF                                   EPWM_BKSFR_DCAEVT2SF_Msk

#define    EPWM_BKSFR_DCAEVT1SF_Pos                               (3U)
#define    EPWM_BKSFR_DCAEVT1SF_Msk                               (0x1U << EPWM_BKSFR_DCAEVT1SF_Pos)
#define    EPWM_BKSFR_DCAEVT1SF                                   EPWM_BKSFR_DCAEVT1SF_Msk

#define    EPWM_BKSFR_OSTSF_Pos                                   (2U)
#define    EPWM_BKSFR_OSTSF_Msk                                   (0x1U << EPWM_BKSFR_OSTSF_Pos)
#define    EPWM_BKSFR_OSTSF                                       EPWM_BKSFR_OSTSF_Msk

#define    EPWM_BKSFR_CBCSF_Pos                                   (1U)
#define    EPWM_BKSFR_CBCSF_Msk                                   (0x1U << EPWM_BKSFR_CBCSF_Pos)
#define    EPWM_BKSFR_CBCSF                                       EPWM_BKSFR_CBCSF_Msk

#define    EPWM_DCINSR_DCBEVT1CFG_Pos                             (22U)
#define    EPWM_DCINSR_DCBEVT1CFG_Msk                             (0x7U << EPWM_DCINSR_DCBEVT1CFG_Pos)
#define    EPWM_DCINSR_DCBEVT1CFG                                 EPWM_DCINSR_DCBEVT1CFG_Msk

#define    EPWM_DCINSR_DCAEVT1CFG_Pos                             (16U)
#define    EPWM_DCINSR_DCAEVT1CFG_Msk                             (0x7U << EPWM_DCINSR_DCAEVT1CFG_Pos)
#define    EPWM_DCINSR_DCAEVT1CFG                                 EPWM_DCINSR_DCAEVT1CFG_Msk

#define    EPWM_DCINSR_DCBLSEL_Pos                                (12U)
#define    EPWM_DCINSR_DCBLSEL_Msk                                (0xfU << EPWM_DCINSR_DCBLSEL_Pos)
#define    EPWM_DCINSR_DCBLSEL                                    EPWM_DCINSR_DCBLSEL_Msk

#define    EPWM_DCINSR_DCBHSEL_Pos                                (8U)
#define    EPWM_DCINSR_DCBHSEL_Msk                                (0xfU << EPWM_DCINSR_DCBHSEL_Pos)
#define    EPWM_DCINSR_DCBHSEL                                    EPWM_DCINSR_DCBHSEL_Msk

#define    EPWM_DCINSR_DCALSEL_Pos                                (4U)
#define    EPWM_DCINSR_DCALSEL_Msk                                (0xfU << EPWM_DCINSR_DCALSEL_Pos)
#define    EPWM_DCINSR_DCALSEL                                    EPWM_DCINSR_DCALSEL_Msk

#define    EPWM_DCINSR_DCAHSEL_Pos                                (0U)
#define    EPWM_DCINSR_DCAHSEL_Msk                                (0xfU << EPWM_DCINSR_DCAHSEL_Pos)
#define    EPWM_DCINSR_DCAHSEL                                    EPWM_DCINSR_DCAHSEL_Msk

#define    EPWM_DCCR_DCAEVT2FRCS_Pos                              (9U)
#define    EPWM_DCCR_DCAEVT2FRCS_Msk                              (0x1U << EPWM_DCCR_DCAEVT2FRCS_Pos)
#define    EPWM_DCCR_DCAEVT2FRCS                                  EPWM_DCCR_DCAEVT2FRCS_Msk

#define    EPWM_DCCR_DCAEVT2SRC_Pos                               (8U)
#define    EPWM_DCCR_DCAEVT2SRC_Msk                               (0x1U << EPWM_DCCR_DCAEVT2SRC_Pos)
#define    EPWM_DCCR_DCAEVT2SRC                                   EPWM_DCCR_DCAEVT2SRC_Msk

#define    EPWM_DCCR_DCAEVT1SYNC_Pos                              (3U)
#define    EPWM_DCCR_DCAEVT1SYNC_Msk                              (0x1U << EPWM_DCCR_DCAEVT1SYNC_Pos)
#define    EPWM_DCCR_DCAEVT1SYNC                                  EPWM_DCCR_DCAEVT1SYNC_Msk

#define    EPWM_DCCR_DCAEVT1SOC_Pos                               (2U)
#define    EPWM_DCCR_DCAEVT1SOC_Msk                               (0x1U << EPWM_DCCR_DCAEVT1SOC_Pos)
#define    EPWM_DCCR_DCAEVT1SOC                                   EPWM_DCCR_DCAEVT1SOC_Msk

