waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epwm.h
#define    EPWM_DCCR_DCAEVT1FRCS_Pos                              (1U)
#define    EPWM_DCCR_DCAEVT1FRCS_Msk                              (0x1U << EPWM_DCCR_DCAEVT1FRCS_Pos)
#define    EPWM_DCCR_DCAEVT1FRCS                                  EPWM_DCCR_DCAEVT1FRCS_Msk

#define    EPWM_DCCR_DCAEVT1SRC_Pos                               (0U)
#define    EPWM_DCCR_DCAEVT1SRC_Msk                               (0x1U << EPWM_DCCR_DCAEVT1SRC_Pos)
#define    EPWM_DCCR_DCAEVT1SRC                                   EPWM_DCCR_DCAEVT1SRC_Msk

#define    EPWM_DCFCR_ALIGN_Pos                                   (4U)
#define    EPWM_DCFCR_ALIGN_Msk                                   (0x3U << EPWM_DCFCR_ALIGN_Pos)
#define    EPWM_DCFCR_ALIGN                                       EPWM_DCFCR_ALIGN_Msk

#define    EPWM_DCFCR_BLKINV_Pos                                  (3U)
#define    EPWM_DCFCR_BLKINV_Msk                                  (0x1U << EPWM_DCFCR_BLKINV_Pos)
#define    EPWM_DCFCR_BLKINV                                      EPWM_DCFCR_BLKINV_Msk

#define    EPWM_DCFCR_BLKE_Pos                                    (2U)
#define    EPWM_DCFCR_BLKE_Msk                                    (0x1U << EPWM_DCFCR_BLKE_Pos)
#define    EPWM_DCFCR_BLKE                                        EPWM_DCFCR_BLKE_Msk

#define    EPWM_DCFCR_SRCSEL_Pos                                    (0U)
#define    EPWM_DCFCR_SRCSEL_Msk                                    (0x3U << EPWM_DCFCR_SRCSEL_Pos)
#define    EPWM_DCFCR_SRCSEL                                        EPWM_DCFCR_SRCSEL_Msk

#define    EPWM_DCFWR_WINDOW_Pos                                  (16U)
#define    EPWM_DCFWR_WINDOW_Msk                                  (0xffU << EPWM_DCFWR_WINDOW_Pos)
#define    EPWM_DCFWR_WINDOW                                      EPWM_DCFWR_WINDOW_Msk

#define    EPWM_DCFWR_WINOFFSET_Pos                               (0U)
#define    EPWM_DCFWR_WINOFFSET_Msk                               (0xffffU << EPWM_DCFWR_WINOFFSET_Pos)
#define    EPWM_DCFWR_WINOFFSET                                   EPWM_DCFWR_WINOFFSET_Msk

#define    EPWM_DCFDR_WINDOW_CNT_Pos                              (16U)
#define    EPWM_DCFDR_WINDOW_CNT_Msk                              (0xffU << EPWM_DCFDR_WINDOW_CNT_Pos)
#define    EPWM_DCFDR_WINDOW_CNT                                  EPWM_DCFDR_WINDOW_CNT_Msk

#define    EPWM_DCFDR_WINOFFSET_CNT_Pos                           (0U)
#define    EPWM_DCFDR_WINOFFSET_CNT_Msk                           (0xffffU << EPWM_DCFDR_WINOFFSET_CNT_Pos)
#define    EPWM_DCFDR_WINOFFSET_CNT                               EPWM_DCFDR_WINOFFSET_CNT_Msk

#define    EPWM_EIER_PCNTSEL_Pos                                  (24U)
#define    EPWM_EIER_PCNTSEL_Msk                                  (0xfU << EPWM_EIER_PCNTSEL_Pos)
#define    EPWM_EIER_PCNTSEL                                      EPWM_EIER_PCNTSEL_Msk

#define    EPWM_EIER_SOCBSEL_Pos                                  (20U)
#define    EPWM_EIER_SOCBSEL_Msk                                  (0xfU << EPWM_EIER_SOCBSEL_Pos)
#define    EPWM_EIER_SOCBSEL                                      EPWM_EIER_SOCBSEL_Msk

#define    EPWM_EIER_SOCASEL_Pos                                  (16U)
#define    EPWM_EIER_SOCASEL_Msk                                  (0xfU << EPWM_EIER_SOCASEL_Pos)
#define    EPWM_EIER_SOCASEL                                      EPWM_EIER_SOCASEL_Msk

#define    EPWM_EIER_SOCBEN_Pos                                   (14U)
#define    EPWM_EIER_SOCBEN_Msk                                   (0x1U << EPWM_EIER_SOCBEN_Pos)
#define    EPWM_EIER_SOCBEN                                       EPWM_EIER_SOCBEN_Msk

#define    EPWM_EIER_SOCAEN_Pos                                   (13U)
#define    EPWM_EIER_SOCAEN_Msk                                   (0x1U << EPWM_EIER_SOCAEN_Pos)
#define    EPWM_EIER_SOCAEN                                       EPWM_EIER_SOCAEN_Msk

#define    EPWM_EIER_PCNTIE_Pos                                   (12U)
#define    EPWM_EIER_PCNTIE_Msk                                   (0x1U << EPWM_EIER_PCNTIE_Pos)
#define    EPWM_EIER_PCNTIE                                       EPWM_EIER_PCNTIE_Msk

#define    EPWM_EIER_SOCBIE_Pos                                   (11U)
#define    EPWM_EIER_SOCBIE_Msk                                   (0x1U << EPWM_EIER_SOCBIE_Pos)
#define    EPWM_EIER_SOCBIE                                       EPWM_EIER_SOCBIE_Msk

#define    EPWM_EIER_SOCAIE_Pos                                   (10U)
#define    EPWM_EIER_SOCAIE_Msk                                   (0x1U << EPWM_EIER_SOCAIE_Pos)
#define    EPWM_EIER_SOCAIE                                       EPWM_EIER_SOCAIE_Msk

#define    EPWM_EIER_CAUIE_Pos                                    (2U)
#define    EPWM_EIER_CAUIE_Msk                                    (0x1U << EPWM_EIER_CAUIE_Pos)
#define    EPWM_EIER_CAUIE                                        EPWM_EIER_CAUIE_Msk

#define    EPWM_EIER_CPIE_Pos                                     (1U)
#define    EPWM_EIER_CPIE_Msk                                     (0x1U << EPWM_EIER_CPIE_Pos)
#define    EPWM_EIER_CPIE                                         EPWM_EIER_CPIE_Msk

#define    EPWM_EIER_CZIE_Pos                                     (0U)
#define    EPWM_EIER_CZIE_Msk                                     (0x1U << EPWM_EIER_CZIE_Pos)
#define    EPWM_EIER_CZIE                                         EPWM_EIER_CZIE_Msk

#define    EPWM_EISR_PCNTIF_Pos                                   (12U)
#define    EPWM_EISR_PCNTIF_Msk                                   (0x1U << EPWM_EISR_PCNTIF_Pos)
#define    EPWM_EISR_PCNTIF                                       EPWM_EISR_PCNTIF_Msk

#define    EPWM_EISR_SOCBIF_Pos                                   (11U)
#define    EPWM_EISR_SOCBIF_Msk                                   (0x1U << EPWM_EISR_SOCBIF_Pos)
#define    EPWM_EISR_SOCBIF                                       EPWM_EISR_SOCBIF_Msk

#define    EPWM_EISR_SOCAIF_Pos                                   (10U)
#define    EPWM_EISR_SOCAIF_Msk                                   (0x1U << EPWM_EISR_SOCAIF_Pos)
#define    EPWM_EISR_SOCAIF                                       EPWM_EISR_SOCAIF_Msk

#define    EPWM_EISR_CAUIF_Pos                                    (2U)
#define    EPWM_EISR_CAUIF_Msk                                    (0x1U << EPWM_EISR_CAUIF_Pos)
#define    EPWM_EISR_CAUIF                                        EPWM_EISR_CAUIF_Msk

#define    EPWM_EISR_CPIF_Pos                                     (1U)
#define    EPWM_EISR_CPIF_Msk                                     (0x1U << EPWM_EISR_CPIF_Pos)
#define    EPWM_EISR_CPIF                                         EPWM_EISR_CPIF_Msk

#define    EPWM_EISR_CZIF_Pos                                     (0U)
#define    EPWM_EISR_CZIF_Msk                                     (0x1U << EPWM_EISR_CZIF_Pos)
#define    EPWM_EISR_CZIF                                         EPWM_EISR_CZIF_Msk

#define    EPWM_EPSR_PCINTCNT_Pos                                 (20U)
#define    EPWM_EPSR_PCINTCNT_Msk                                 (0xfU << EPWM_EPSR_PCINTCNT_Pos)
#define    EPWM_EPSR_PCINTCNT                                     EPWM_EPSR_PCINTCNT_Msk

#define    EPWM_EPSR_PCINTPRD_Pos                                 (16U)
#define    EPWM_EPSR_PCINTPRD_Msk                                 (0xfU << EPWM_EPSR_PCINTPRD_Pos)
#define    EPWM_EPSR_PCINTPRD                                     EPWM_EPSR_PCINTPRD_Msk

