waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epwm.h
#define    EPWM_EPSR_SOCBCNT_Pos                                  (12U)
#define    EPWM_EPSR_SOCBCNT_Msk                                  (0xfU << EPWM_EPSR_SOCBCNT_Pos)
#define    EPWM_EPSR_SOCBCNT                                      EPWM_EPSR_SOCBCNT_Msk

#define    EPWM_EPSR_SOCBPRD_Pos                                  (8U)
#define    EPWM_EPSR_SOCBPRD_Msk                                  (0xfU << EPWM_EPSR_SOCBPRD_Pos)
#define    EPWM_EPSR_SOCBPRD                                      EPWM_EPSR_SOCBPRD_Msk

#define    EPWM_EPSR_SOCACNT_Pos                                  (4U)
#define    EPWM_EPSR_SOCACNT_Msk                                  (0xfU << EPWM_EPSR_SOCACNT_Pos)
#define    EPWM_EPSR_SOCACNT                                      EPWM_EPSR_SOCACNT_Msk

#define    EPWM_EPSR_SOCAPRD_Pos                                  (0U)
#define    EPWM_EPSR_SOCAPRD_Msk                                  (0xfU << EPWM_EPSR_SOCAPRD_Pos)
#define    EPWM_EPSR_SOCAPRD                                      EPWM_EPSR_SOCAPRD_Msk

#define    EPWM_SWTR_SOCB_Pos                                     (1U)
#define    EPWM_SWTR_SOCB_Msk                                     (0x1U << EPWM_SWTR_SOCB_Pos)
#define    EPWM_SWTR_SOCB                                         EPWM_SWTR_SOCB_Msk

#define    EPWM_SWTR_SOCA_Pos                                     (0U)
#define    EPWM_SWTR_SOCA_Msk                                     (0x1U << EPWM_SWTR_SOCA_Pos)
#define    EPWM_SWTR_SOCA                                         EPWM_SWTR_SOCA_Msk

#define    EPWM_HRCR_HRLDPRD_Pos                                  (10U)
#define    EPWM_HRCR_HRLDPRD_Msk                                  (0x1U << EPWM_HRCR_HRLDPRD_Pos)
#define    EPWM_HRCR_HRLDPRD                                      EPWM_HRCR_HRLDPRD_Msk

#define    EPWM_HRCR_HRLDZRO_Pos                                  (9U)
#define    EPWM_HRCR_HRLDZRO_Msk                                  (0x1U << EPWM_HRCR_HRLDZRO_Pos)
#define    EPWM_HRCR_HRLDZRO                                      EPWM_HRCR_HRLDZRO_Msk

#define    EPWM_HRCR_HRSHEN_Pos                                   (8U)
#define    EPWM_HRCR_HRSHEN_Msk                                   (0x1U << EPWM_HRCR_HRSHEN_Pos)
#define    EPWM_HRCR_HRSHEN                                       EPWM_HRCR_HRSHEN_Msk

#define    EPWM_HRCR_HRPWMEN_Pos                                  (0U)
#define    EPWM_HRCR_HRPWMEN_Msk                                  (0x1U << EPWM_HRCR_HRPWMEN_Pos)
#define    EPWM_HRCR_HRPWMEN                                      EPWM_HRCR_HRPWMEN_Msk

#define    EPWM_HRPRD_HRPRD_Pos                                   (0U)
#define    EPWM_HRPRD_HRPRD_Msk                                   (0x1fU << EPWM_HRPRD_HRPRD_Pos)
#define    EPWM_HRPRD_HRPRD                                       EPWM_HRPRD_HRPRD_Msk

#define    EPWM_HRCMPA_HRCMPA_Pos                                 (0U)
#define    EPWM_HRCMPA_HRCMPA_Msk                                 (0x1fU << EPWM_HRCMPA_HRCMPA_Pos)
#define    EPWM_HRCMPA_HRCMPA                                     EPWM_HRCMPA_HRCMPA_Msk

#define    EPWM_HRCMPB_HRCMPB_Pos                                 (0U)
#define    EPWM_HRCMPB_HRCMPB_Msk                                 (0x1fU << EPWM_HRCMPB_HRCMPB_Pos)
#define    EPWM_HRCMPB_HRCMPB                                     EPWM_HRCMPB_HRCMPB_Msk

#define    EPWM_HRACR_LOCK_Pos                                    (16U)
#define    EPWM_HRACR_LOCK_Msk                                    (0x1U << EPWM_HRACR_LOCK_Pos)
#define    EPWM_HRACR_LOCK                                        EPWM_HRACR_LOCK_Msk

#define    EPWM_HRACR_PWRESHAPER_EN_Pos                           (8U)
#define    EPWM_HRACR_PWRESHAPER_EN_Msk                           (0x1U << EPWM_HRACR_PWRESHAPER_EN_Pos)
#define    EPWM_HRACR_PWRESHAPER_EN                               EPWM_HRACR_PWRESHAPER_EN_Msk

#define    EPWM_HRACR_ITRIM_Pos                                   (4U)
#define    EPWM_HRACR_ITRIM_Msk                                   (0x7U << EPWM_HRACR_ITRIM_Pos)
#define    EPWM_HRACR_ITRIM                                       EPWM_HRACR_ITRIM_Msk

#define    EPWM_HRACR_RTRIM_Pos                                   (0U)
#define    EPWM_HRACR_RTRIM_Msk                                   (0xfU << EPWM_HRACR_RTRIM_Pos)
#define    EPWM_HRACR_RTRIM                                       EPWM_HRACR_RTRIM_Msk

#define    EPWM_LINK_LINK_Pos                                     (0U)
#define    EPWM_LINK_LINK_Msk                                     (0x7U << EPWM_LINK_LINK_Pos)
#define    EPWM_LINK_LINK                                         EPWM_LINK_LINK_Msk

#define    EPWM_CR_CEN_Pos                                       (0U)
#define    EPWM_CR_CEN_Msk                                       (0x1U << EPWM_CR_CEN_Pos)
#define    EPWM_CR_CEN                                            EPWM_CR_CEN_Msk

#define    FL_EPWM_CHANNEL_A                                      0x0U
#define    FL_EPWM_CHANNEL_B                                      0x1U

#define    FL_EPWM_BKCHANNEL_1                                     0x0U
#define    FL_EPWM_BKCHANNEL_2                                     0x1U
#define    FL_EPWM_BKCHANNEL_3                                     0x2U
#define    FL_EPWM_BKCHANNEL_4                                     0x3U
#define    FL_EPWM_BKCHANNEL_5                                     0x4U
#define    FL_EPWM_BKCHANNEL_6                                     0x5U

#define    FL_EPWM_COMPAREA                                        0x1U
#define    FL_EPWM_COMPAREB                                        0x2U
#define    FL_EPWM_COMPAREC                                        0x3U
#define    FL_EPWM_COMPARED                                        0x4U

#define    FL_EPWM_DEBUG_STOP                                     (0x0U << EPWM_TBCR_DBGMODE_Pos)
#define    FL_EPWM_DEBUG_STOP_UPDATE                              (0x1U << EPWM_TBCR_DBGMODE_Pos)
#define    FL_EPWM_DEBUG_FREE_RUN                                 (0x2U << EPWM_TBCR_DBGMODE_Pos)

#define    FL_EPWM_COUNTER_SYNC_DIR_UP                            (0x1U << EPWM_TBCR_PHSDIR_Pos)
#define    FL_EPWM_COUNTER_SYNC_DIR_DOWN                          (0x0U << EPWM_TBCR_PHSDIR_Pos)

#define    FL_EPWM_SYNCOUT_ONCE                                   (0x0U << EPWM_TBCR_OSTSYNCOEN_Pos)
#define    FL_EPWM_SYNCOUT_CONTINUE                               (0x1U << EPWM_TBCR_OSTSYNCOEN_Pos)

#define    FL_EPWM_COUNTER_MODE_UP                                (0x0U << EPWM_TBCR_CNTMODE_Pos)
#define    FL_EPWM_COUNTER_MODE_DOWN                              (0x1U << EPWM_TBCR_CNTMODE_Pos)
#define    FL_EPWM_COUNTER_MODE_UP_DOWN                           (0x2U << EPWM_TBCR_CNTMODE_Pos)
#define    FL_EPWM_COUNTER_MODE_STOP                              (0x3U << EPWM_TBCR_CNTMODE_Pos)

#define    FL_EPWM_COUNTER_DIR_DOWN                               (0x0U << EPWM_TBSR_CNTDIR_Pos)
#define    FL_EPWM_COUNTER_DIR_UP                                 (0x1U << EPWM_TBSR_CNTDIR_Pos)

#define    FL_EPWM_SYNCOUT_SRC_SWSYNC                             (0x1U << EPWM_SYNC_SWSYNCOEN_Pos)
#define    FL_EPWM_SYNCOUT_SRC_CNT_0                              (0x2U << EPWM_SYNC_SWSYNCOEN_Pos)
#define    FL_EPWM_SYNCOUT_SRC_CNT_PRD                            (0x4U << EPWM_SYNC_SWSYNCOEN_Pos)
#define    FL_EPWM_SYNCOUT_SRC_CNT_CMPA                           (0x8U << EPWM_SYNC_SWSYNCOEN_Pos)
#define    FL_EPWM_SYNCOUT_SRC_CNT_CMPB                           (0x10U << EPWM_SYNC_SWSYNCOEN_Pos)
#define    FL_EPWM_SYNCOUT_SRC_CNT_CMPC                           (0x20U << EPWM_SYNC_SWSYNCOEN_Pos)
#define    FL_EPWM_SYNCOUT_SRC_CNT_CMPD                           (0x40U << EPWM_SYNC_SWSYNCOEN_Pos)
#define    FL_EPWM_SYNCOUT_SRC_DCAEVT1                            (0x80U << EPWM_SYNC_SWSYNCOEN_Pos)
#define    FL_EPWM_SYNCOUT_SRC_DCBEVT1                            (0x100U << EPWM_SYNC_SWSYNCOEN_Pos)

