waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epwm.h
#define    FL_EPWM_SYNC_IN_SEL_NONE                               (0x0U << EPWM_SYNC_SYNCINSEL_Pos)
#define    FL_EPWM_SYNC_IN_SEL_EPWM0_SYNCOUT                      (0x1U << EPWM_SYNC_SYNCINSEL_Pos)
#define    FL_EPWM_SYNC_IN_SEL_EPWM1_SYNCOUT                      (0x2U << EPWM_SYNC_SYNCINSEL_Pos)
#define    FL_EPWM_SYNC_IN_SEL_EPWM2_SYNCOUT                      (0x3U << EPWM_SYNC_SYNCINSEL_Pos)
#define    FL_EPWM_SYNC_IN_SEL_EPWM3_SYNCOUT                      (0x4U << EPWM_SYNC_SYNCINSEL_Pos)
#define    FL_EPWM_SYNC_IN_SEL_ATIM0                              (0x7U << EPWM_SYNC_SYNCINSEL_Pos)
#define    FL_EPWM_SYNC_IN_SEL_ATIM1                              (0x8U << EPWM_SYNC_SYNCINSEL_Pos)
#define    FL_EPWM_SYNC_IN_SEL_GPTIM0                             (0xbU << EPWM_SYNC_SYNCINSEL_Pos)
#define    FL_EPWM_SYNC_IN_SEL_GPTIM1                             (0xcU << EPWM_SYNC_SYNCINSEL_Pos)
#define    FL_EPWM_SYNC_IN_SEL_GPTIM2                             (0xdU << EPWM_SYNC_SYNCINSEL_Pos)

#define    FL_EPWM_COUNT_MODE_UP_CNT_CMPA                         (0x0U )
#define    FL_EPWM_COUNT_MODE_DOWN_CNT_CMPA                       (0x1U)
#define    FL_EPWM_COUNT_MODE_UP_CNT_CMPB                         (0x2U )
#define    FL_EPWM_COUNT_MODE_DOWN_CNT_CMPB                       (0x3U)
#define    FL_EPWM_COUNT_MODE_UP_CNT_CMPC                         (0x4U )
#define    FL_EPWM_COUNT_MODE_DOWN_CNT_CMPC                       (0x5U )
#define    FL_EPWM_COUNT_MODE_UP_CNT_CMPD                         (0x6U )
#define    FL_EPWM_COUNT_MODE_DOWN_CNT_CMPD                       (0x7U )

#define    FL_EPWM_CMPD_LOAD_CNT_0                                (0x1U << EPWM_CCR_LDCMPD_Pos)
#define    FL_EPWM_CMPD_LOAD_CNT_PRD                              (0x2U << EPWM_CCR_LDCMPD_Pos)
#define    FL_EPWM_CMPD_LOAD_SYNC_RISING                          (0x4U << EPWM_CCR_LDCMPD_Pos)

#define    FL_EPWM_CMPC_LOAD_CNT_0                                (0x1U << EPWM_CCR_LDCMPC_Pos)
#define    FL_EPWM_CMPC_LOAD_CNT_PRD                              (0x2U << EPWM_CCR_LDCMPC_Pos)
#define    FL_EPWM_CMPC_LOAD_SYNC_RISING                          (0x4U << EPWM_CCR_LDCMPC_Pos)

#define    FL_EPWM_CMPB_LOAD_CNT_0                                (0x1U << EPWM_CCR_LDCMPB_Pos)
#define    FL_EPWM_CMPB_LOAD_CNT_PRD                              (0x2U << EPWM_CCR_LDCMPB_Pos)
#define    FL_EPWM_CMPB_LOAD_SYNC_RISING                          (0x4U << EPWM_CCR_LDCMPB_Pos)

#define    FL_EPWM_CMPA_LOAD_CNT_0                                (0x1U << EPWM_CCR_LDCMPA_Pos)
#define    FL_EPWM_CMPA_LOAD_CNT_PRD                              (0x2U << EPWM_CCR_LDCMPA_Pos)
#define    FL_EPWM_CMPA_LOAD_SYNC_RISING                          (0x4U << EPWM_CCR_LDCMPA_Pos)

#define    FL_EPWM_OC_LOAD_CNT_0                                  (0x1U<<0)
#define    FL_EPWM_OC_LOAD_CNT_PRD                                (0x1U<<1)
#define    FL_EPWM_OC_LOAD_SYNC_RISING                            (0x1U<<2)

#define    FL_EPWM_OC_MODE_FROZEN                                 (0x0U)
#define    FL_EPWM_OC_MODE_LOW                                    (0x1U)
#define    FL_EPWM_OC_MODE_HIGH                                   (0x2U)
#define    FL_EPWM_OC_MODE_TOGGLE                                 (0x3U)

#define    FL_EPWM_CSF_LOAD_CNT_0                                 (0x0U << EPWM_SFCR_LDSFR_Pos)
#define    FL_EPWM_CSF_LOAD_CNT_ARR                               (0x1U << EPWM_SFCR_LDSFR_Pos)
#define    FL_EPWM_CSF_LOAD_CNT_0_ARR                             (0x2U << EPWM_SFCR_LDSFR_Pos)
#define    FL_EPWM_CSF_LOAD_SOFTWARE                              (0x3U << EPWM_SFCR_LDSFR_Pos)

#define    FL_EPWM_OTSFA_MODE_FROZEN                                 (0x0U << EPWM_SFCR_ACTOTSFA_Pos)
#define    FL_EPWM_OTSFA_MODE_LOW                                    (0x1U << EPWM_SFCR_ACTOTSFA_Pos)
#define    FL_EPWM_OTSFA_MODE_HIGH                                   (0x2U << EPWM_SFCR_ACTOTSFA_Pos)
#define    FL_EPWM_OTSFA_MODE_TOGGLE                                 (0x3U << EPWM_SFCR_ACTOTSFA_Pos)

#define    FL_EPWM_OTSFB_MODE_FROZEN                                 (0x0U << EPWM_SFCR_ACTOTSFB_Pos)
#define    FL_EPWM_OTSFB_MODE_LOW                                    (0x1U << EPWM_SFCR_ACTOTSFB_Pos)
#define    FL_EPWM_OTSFB_MODE_HIGH                                   (0x2U << EPWM_SFCR_ACTOTSFB_Pos)
#define    FL_EPWM_OTSFB_MODE_TOGGLE                                 (0x3U << EPWM_SFCR_ACTOTSFB_Pos)

#define    FL_EPWM_CSF_MODE_FROZEN                                (0x0U << EPWM_SFR_CSFA_Pos)
#define    FL_EPWM_CSF_MODE_CONTINUE_LOW                          (0x1U << EPWM_SFR_CSFA_Pos)
#define    FL_EPWM_CSF_MODE_CONTINUE_HIGH                         (0x2U << EPWM_SFR_CSFA_Pos)
//#define    FL_EPWM_CSF_MODE_FROZEN                                (0x3U << EPWM_SFR_CSFA_Pos)

#define    FL_EPWM_DEADBAND_FALLING_EPWMB                  (0x0U << EPWM_DTCR_FEDSEL_Pos)
#define    FL_EPWM_DEADBAND_FALLING_EPWMA                  (0x1U << EPWM_DTCR_FEDSEL_Pos)

#define    FL_EPWM_DEADBAND_RISING_EPWMB                   (0x0U << EPWM_DTCR_REDSEL_Pos)
#define    FL_EPWM_DEADBAND_RISING_EPWMA                   (0x1U << EPWM_DTCR_REDSEL_Pos)

#define    FL_EPWM_DEADBAND_PORLARITY_NORMAL                      (0x0U << EPWM_DTCR_POLSELA_Pos)
#define    FL_EPWM_DEADBAND_PORLARITY_REVERSE                     (0x1U << EPWM_DTCR_POLSELA_Pos)

#define    FL_EPWM_OUTPUT_HIGH_IMPEDANCE                          (0x0U)
#define    FL_EPWM_OUTPUT_HIGH                                    (0x1U)
#define    FL_EPWM_OUTPUT_LOW                                     (0x2U)
#define    FL_EPWM_OUTPUT_FROZEN                                  (0x3U)

#define    FL_EPWM_DIGITAL_COMPARE_DISABLE                        (0x0U )
#define    FL_EPWM_DIGITAL_COMPARE_DCH_LOW                        (0x1U )
#define    FL_EPWM_DIGITAL_COMPARE_DCH_HIGH                       (0x2U )
#define    FL_EPWM_DIGITAL_COMPARE_DCL_LOW                        (0x3U )
#define    FL_EPWM_DIGITAL_COMPARE_DCL_HIGH                       (0x4U )
#define    FL_EPWM_DIGITAL_COMPARE_DCH_LOWANDDCL_HIGH             (0x5U )
#define    FL_EPWM_DIGITAL_COMPARE_DCH_HIGHANDDCL_LOW             (0x6U )

