waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epwm.h
#define    FL_EPWM_DC_EVENT_1                                      (0x0U )
#define    FL_EPWM_DC_EVENT_2                                       (0x3U )

#define    FL_EPWM_INPUT_SOURCE_BK1                               (0x0U)
#define    FL_EPWM_INPUT_SOURCE_BK2                               (0x1U)
#define    FL_EPWM_INPUT_SOURCE_BK3                               (0x2U)
#define    FL_EPWM_INPUT_SOURCE_COMP1OUT                          (0x8U)
#define    FL_EPWM_INPUT_SOURCE_COMP2OUT                          (0x9U)
#define    FL_EPWM_INPUT_SOURCE_COMP3OUT                          (0xaU)

#define    FL_EPWM_DCEVT2_SOFTWARE_SOUECE_SYNC                    (0x0U << EPWM_DCCR_DCAEVT2FRCS_Pos)
#define    FL_EPWM_DCEVT2_SOFTWARE_SOUECE_ASYNC                   (0x1U << EPWM_DCCR_DCAEVT2FRCS_Pos)

#define    FL_EPWM_DCEVT2_SOUECE_DEEVT2                           (0x0U << EPWM_DCCR_DCAEVT2SRC_Pos)
#define    FL_EPWM_DCEVT2_SOUECE_DCEVTFLT                         (0x1U << EPWM_DCCR_DCAEVT2SRC_Pos)

#define    FL_EPWM_DCEVT1_SOFTWARE_SOUECE_SYNC                    (0x0U << EPWM_DCCR_DCAEVT1FRCS_Pos)
#define    FL_EPWM_DCEVT1_SOFTWARE_SOUECE_ASYNC                   (0x1U << EPWM_DCCR_DCAEVT1FRCS_Pos)

#define    FL_EPWM_DCEVT1_SOUECE_DEEVT1                           (0x0U << EPWM_DCCR_DCAEVT1SRC_Pos)
#define    FL_EPWM_DCEVT1_SOUECE_DCEVTFLT                         (0x1U << EPWM_DCCR_DCAEVT1SRC_Pos)

#define    FL_EPWM_ALIGNMENT_MODE_CNT_0                           (0x0U << EPWM_DCFCR_ALIGN_Pos)
#define    FL_EPWM_ALIGNMENT_MODE_CNT_PRD                         (0x1U << EPWM_DCFCR_ALIGN_Pos)
#define    FL_EPWM_ALIGNMENT_MODE_CNT_0ANDCNT_PRD                 (0x2U << EPWM_DCFCR_ALIGN_Pos)
//#define    FL_EPWM_ALIGNMENT_MODE_CNT_0ANDCNT_PRD                 (0x3U << EPWM_DCFCR_ALIGN_Pos)

#define    FL_EPWM_FILTER_INPUT_SOURCE_DCAEVT1                    (0x0U << EPWM_DCFCR_SRCSEL_Pos)
#define    FL_EPWM_FILTER_INPUT_SOURCE_DCAEVT2                    (0x1U << EPWM_DCFCR_SRCSEL_Pos)
#define    FL_EPWM_FILTER_INPUT_SOURCE_DCBEVT1                    (0x2U << EPWM_DCFCR_SRCSEL_Pos)
#define    FL_EPWM_FILTER_INPUT_SOURCE_DCBEVT2                    (0x3U << EPWM_DCFCR_SRCSEL_Pos)

#define    FL_EPWM_COUNT_IE_SOURCE_CNT_0                          (0x1U <<EPWM_EIER_PCNTSEL_Pos )
#define    FL_EPWM_COUNT_IE_SOURCE_CNT_PRD                        (0x2U<<EPWM_EIER_PCNTSEL_Pos)
#define    FL_EPWM_COUNT_IE_SOURCE_CNT_0ORCNT_PRD                 (0x3U<<EPWM_EIER_PCNTSEL_Pos )
#define    FL_EPWM_COUNT_IE_SOURCE_CNT_CMPA_UP                    (0x4U<<EPWM_EIER_PCNTSEL_Pos)
#define    FL_EPWM_COUNT_IE_SOURCE_CNT_CMPA_DOWN                  (0x5U<<EPWM_EIER_PCNTSEL_Pos )
#define    FL_EPWM_COUNT_IE_SOURCE_CNT_CMPB_UP                    (0x6U<<EPWM_EIER_PCNTSEL_Pos )
#define    FL_EPWM_COUNT_IE_SOURCE_CNT_CMPB_DOWN                  (0x7U<<EPWM_EIER_PCNTSEL_Pos )
#define    FL_EPWM_COUNT_IE_SOURCE_CNT_CMPC_UP                    (0xcU<<EPWM_EIER_PCNTSEL_Pos )
#define    FL_EPWM_COUNT_IE_SOURCE_CNT_CMPC_DOWN                  (0xdU<<EPWM_EIER_PCNTSEL_Pos )
#define    FL_EPWM_COUNT_IE_SOURCE_CNT_CMPD_UP                    (0xeU <<EPWM_EIER_PCNTSEL_Pos)
#define    FL_EPWM_COUNT_IE_SOURCE_CNT_CMPD_DOWN                  (0xfU <<EPWM_EIER_PCNTSEL_Pos)

#define    FL_EPWM_PULSE_EVENT_N0                                 (0x0U <<EPWM_EPSR_PCINTPRD_Pos)
#define    FL_EPWM_PULSE_EVENT_N1                                 (0x1U <<EPWM_EPSR_PCINTPRD_Pos)
#define    FL_EPWM_PULSE_EVENT_N2                                 (0x2U <<EPWM_EPSR_PCINTPRD_Pos)
#define    FL_EPWM_PULSE_EVENT_N3                                 (0x3U <<EPWM_EPSR_PCINTPRD_Pos)
#define    FL_EPWM_PULSE_EVENT_N4                                 (0x4U <<EPWM_EPSR_PCINTPRD_Pos)
#define    FL_EPWM_PULSE_EVENT_N5                                 (0x5U <<EPWM_EPSR_PCINTPRD_Pos)
#define    FL_EPWM_PULSE_EVENT_N6                                 (0x6U <<EPWM_EPSR_PCINTPRD_Pos)
#define    FL_EPWM_PULSE_EVENT_N7                                 (0x7U <<EPWM_EPSR_PCINTPRD_Pos)
#define    FL_EPWM_PULSE_EVENT_N8                                 (0x8U <<EPWM_EPSR_PCINTPRD_Pos)
#define    FL_EPWM_PULSE_EVENT_N9                                 (0x9U <<EPWM_EPSR_PCINTPRD_Pos)
#define    FL_EPWM_PULSE_EVENT_N10                                (0xaU <<EPWM_EPSR_PCINTPRD_Pos)
#define    FL_EPWM_PULSE_EVENT_N11                                (0xbU <<EPWM_EPSR_PCINTPRD_Pos)
#define    FL_EPWM_PULSE_EVENT_N12                                (0xcU<<EPWM_EPSR_PCINTPRD_Pos)
#define    FL_EPWM_PULSE_EVENT_N13                                (0xdU<<EPWM_EPSR_PCINTPRD_Pos )
#define    FL_EPWM_PULSE_EVENT_N14                                (0xeU <<EPWM_EPSR_PCINTPRD_Pos)
#define    FL_EPWM_PULSE_EVENT_N15                                (0xfU<<EPWM_EPSR_PCINTPRD_Pos)

#define    FL_EPWM_SOCB_EVENT_N0                                  (0x0U <<EPWM_EPSR_SOCBPRD_Pos)
#define    FL_EPWM_SOCB_EVENT_N1                                  (0x1U <<EPWM_EPSR_SOCBPRD_Pos)
#define    FL_EPWM_SOCB_EVENT_N2                                  (0x2U <<EPWM_EPSR_SOCBPRD_Pos)
#define    FL_EPWM_SOCB_EVENT_N3                                  (0x3U <<EPWM_EPSR_SOCBPRD_Pos)
#define    FL_EPWM_SOCB_EVENT_N4                                  (0x4U <<EPWM_EPSR_SOCBPRD_Pos)
#define    FL_EPWM_SOCB_EVENT_N5                                  (0x5U <<EPWM_EPSR_SOCBPRD_Pos)
#define    FL_EPWM_SOCB_EVENT_N6                                  (0x6U <<EPWM_EPSR_SOCBPRD_Pos)
#define    FL_EPWM_SOCB_EVENT_N7                                  (0x7U <<EPWM_EPSR_SOCBPRD_Pos)
#define    FL_EPWM_SOCB_EVENT_N8                                  (0x8U <<EPWM_EPSR_SOCBPRD_Pos)
#define    FL_EPWM_SOCB_EVENT_N9                                  (0x9U <<EPWM_EPSR_SOCBPRD_Pos)
#define    FL_EPWM_SOCB_EVENT_N10                                 (0xaU <<EPWM_EPSR_SOCBPRD_Pos)
#define    FL_EPWM_SOCB_EVENT_N11                                 (0xbU <<EPWM_EPSR_SOCBPRD_Pos)
#define    FL_EPWM_SOCB_EVENT_N12                                 (0xcU <<EPWM_EPSR_SOCBPRD_Pos)
#define    FL_EPWM_SOCB_EVENT_N13                                 (0xdU <<EPWM_EPSR_SOCBPRD_Pos)
#define    FL_EPWM_SOCB_EVENT_N14                                 (0xeU <<EPWM_EPSR_SOCBPRD_Pos)
#define    FL_EPWM_SOCB_EVENT_N15                                 (0xfU <<EPWM_EPSR_SOCBPRD_Pos)

