waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epwm.h
#define    FL_EPWM_SOCA_EVENT_N0                                  (0x0U <<EPWM_EPSR_SOCAPRD_Pos)
#define    FL_EPWM_SOCA_EVENT_N1                                  (0x1U <<EPWM_EPSR_SOCAPRD_Pos)
#define    FL_EPWM_SOCA_EVENT_N2                                  (0x2U <<EPWM_EPSR_SOCAPRD_Pos)
#define    FL_EPWM_SOCA_EVENT_N3                                  (0x3U <<EPWM_EPSR_SOCAPRD_Pos)
#define    FL_EPWM_SOCA_EVENT_N4                                  (0x4U <<EPWM_EPSR_SOCAPRD_Pos)
#define    FL_EPWM_SOCA_EVENT_N5                                  (0x5U <<EPWM_EPSR_SOCAPRD_Pos)
#define    FL_EPWM_SOCA_EVENT_N6                                  (0x6U <<EPWM_EPSR_SOCAPRD_Pos)
#define    FL_EPWM_SOCA_EVENT_N7                                  (0x7U <<EPWM_EPSR_SOCAPRD_Pos)
#define    FL_EPWM_SOCA_EVENT_N8                                  (0x8U <<EPWM_EPSR_SOCAPRD_Pos)
#define    FL_EPWM_SOCA_EVENT_N9                                  (0x9U <<EPWM_EPSR_SOCAPRD_Pos)
#define    FL_EPWM_SOCA_EVENT_N10                                 (0xaU <<EPWM_EPSR_SOCAPRD_Pos)
#define    FL_EPWM_SOCA_EVENT_N11                                 (0xbU <<EPWM_EPSR_SOCAPRD_Pos)
#define    FL_EPWM_SOCA_EVENT_N12                                 (0xcU <<EPWM_EPSR_SOCAPRD_Pos)
#define    FL_EPWM_SOCA_EVENT_N13                                 (0xdU <<EPWM_EPSR_SOCAPRD_Pos)
#define    FL_EPWM_SOCA_EVENT_N14                                 (0xeU <<EPWM_EPSR_SOCAPRD_Pos)
#define    FL_EPWM_SOCA_EVENT_N15                                 (0xfU <<EPWM_EPSR_SOCAPRD_Pos)

#define    FL_EPWM_ADC_SOCB_SOURCE_CNT_DCBEVT1                    (0x0U << EPWM_EIER_SOCBSEL_Pos)
#define    FL_EPWM_ADC_SOCB_SOURCE_CNT_0                          (0x1U << EPWM_EIER_SOCBSEL_Pos)
#define    FL_EPWM_ADC_SOCB_SOURCE_CNT_PRD                        (0x2U << EPWM_EIER_SOCBSEL_Pos)
#define    FL_EPWM_ADC_SOCB_SOURCE_CNT_0ORCNT_PRD                 (0x3U << EPWM_EIER_SOCBSEL_Pos)
#define    FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPA_UP                    (0x4U << EPWM_EIER_SOCBSEL_Pos)
#define    FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPA_DOWN                  (0x5U << EPWM_EIER_SOCBSEL_Pos)
#define    FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPB_UP                    (0x6U << EPWM_EIER_SOCBSEL_Pos)
#define    FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPB_DOWN                  (0x7U << EPWM_EIER_SOCBSEL_Pos)
#define    FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPC_UP                    (0xcU << EPWM_EIER_SOCBSEL_Pos)
#define    FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPC_DOWN                  (0xdU << EPWM_EIER_SOCBSEL_Pos)
#define    FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPD_UP                    (0xeU << EPWM_EIER_SOCBSEL_Pos)
#define    FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPD_DOWN                  (0xfU << EPWM_EIER_SOCBSEL_Pos)

#define    FL_EPWM_ADC_SOCA_SOURCE_CNT_DCAEVT1                    (0x0U << EPWM_EIER_SOCASEL_Pos)
#define    FL_EPWM_ADC_SOCA_SOURCE_CNT_0                          (0x1U << EPWM_EIER_SOCASEL_Pos)
#define    FL_EPWM_ADC_SOCA_SOURCE_CNT_PRD                        (0x2U << EPWM_EIER_SOCASEL_Pos)
#define    FL_EPWM_ADC_SOCA_SOURCE_CNT_0ORCNT_PRD                 (0x3U << EPWM_EIER_SOCASEL_Pos)
#define    FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPA_UP                    (0x4U << EPWM_EIER_SOCASEL_Pos)
#define    FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPA_DOWN                  (0x5U << EPWM_EIER_SOCASEL_Pos)
#define    FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPB_UP                    (0x6U << EPWM_EIER_SOCASEL_Pos)
#define    FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPB_DOWN                  (0x7U << EPWM_EIER_SOCASEL_Pos)
#define    FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPC_UP                    (0xcU << EPWM_EIER_SOCASEL_Pos)
#define    FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPC_DOWN                  (0xdU << EPWM_EIER_SOCASEL_Pos)
#define    FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPD_UP                    (0xeU << EPWM_EIER_SOCASEL_Pos)
#define    FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPD_DOWN                  (0xfU << EPWM_EIER_SOCASEL_Pos)

#define    FL_EPWM_LINK_NONE                                      (0x0U << EPWM_LINK_LINK_Pos)
#define    FL_EPWM_LINK_EPWM0                                     (0x1U << EPWM_LINK_LINK_Pos)
#define    FL_EPWM_LINK_EPWM1                                     (0x2U << EPWM_LINK_LINK_Pos)
#define    FL_EPWM_LINK_EPWM2                                     (0x3U << EPWM_LINK_LINK_Pos)
#define    FL_EPWM_LINK_EPWM3                                     (0x4U << EPWM_LINK_LINK_Pos)

/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup EPWM_FL_Exported_Functions EPWM Exported Functions
  * @{
  */

/**
  * @brief    设置PWM周期值
  * @rmtoll   PRD    PRD    FL_EPWM_WriteAutoReload
  * @param    EPWMx EPWM instance
  * @param    autoReload
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WriteAutoReload(EPWM_Type *EPWMx, uint32_t autoReload)
{
    MODIFY_REG(EPWMx->PRD, (0xffffU << 0U), (autoReload << 0U));
}

/**
  * @brief    获取PWM周期值
  * @rmtoll   PRD    PRD    FL_EPWM_ReadAutoReload
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadAutoReload(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->PRD, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    设置相位load值
  * @rmtoll   PHSR    PHS    FL_EPWM_WritePhaseLoad
  * @param    EPWMx EPWM instance
  * @param    phaseload
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WritePhaseLoad(EPWM_Type *EPWMx, uint32_t phaseload)
{
    MODIFY_REG(EPWMx->PHSR, (0xffffU << 0U), (phaseload << 0U));
}

/**
  * @brief    获取相位load值
  * @rmtoll   PHSR    PHS    FL_EPWM_ReadPhaseLoad
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadPhaseLoad(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->PHSR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    设置计数器时钟预分频值
  * @rmtoll   PSC    PSC    FL_EPWM_WritePrescaler
  * @param    EPWMx EPWM instance
  * @param    psc
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WritePrescaler(EPWM_Type *EPWMx, uint32_t psc)
{
    MODIFY_REG(EPWMx->PSC, (0xffffU << 0U), (psc << 0U));
}

/**
  * @brief    读取计数器时钟预分频值
  * @rmtoll   PSC    PSC    FL_EPWM_ReadPrescaler
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadPrescaler(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->PSC, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    设置计数器值
  * @rmtoll   CNTR    CNT    FL_EPWM_WriteCounter
  * @param    EPWMx EPWM instance
  * @param    counter
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WriteCounter(EPWM_Type *EPWMx, uint32_t counter)
{
    MODIFY_REG(EPWMx->CNTR, (0xffffU << 0U), (counter << 0U));
}

/**
  * @brief    读取计数器值
  * @rmtoll   CNTR    CNT    FL_EPWM_ReadCounter
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadCounter(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->CNTR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    设置debug模式
  * @rmtoll   TBCR    DBGMODE    FL_EPWM_SetDebugMode
  * @param    EPWMx EPWM instance
  * @param    debugmode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_DEBUG_STOP
  *           @arg @ref FL_EPWM_DEBUG_STOP_UPDATE
  *           @arg @ref FL_EPWM_DEBUG_FREE_RUN
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetDebugMode(EPWM_Type *EPWMx, uint32_t debugmode)
{
    MODIFY_REG(EPWMx->TBCR, EPWM_TBCR_DBGMODE_Msk, debugmode);
}

/**
  * @brief    获取debug模式
  * @rmtoll   TBCR    DBGMODE    FL_EPWM_GetDebugMode
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_DEBUG_STOP
  *           @arg @ref FL_EPWM_DEBUG_STOP_UPDATE
  *           @arg @ref FL_EPWM_DEBUG_FREE_RUN
  */
__STATIC_INLINE uint32_t FL_EPWM_GetDebugMode(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->TBCR, EPWM_TBCR_DBGMODE_Msk));
}

/**
  * @brief    设置初始相位方向
  * @rmtoll   TBCR    PHSDIR    FL_EPWM_SetCounterDirection
  * @param    EPWMx EPWM instance
  * @param    counterdir This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_COUNTER_SYNC_DIR_UP
  *           @arg @ref FL_EPWM_COUNTER_SYNC_DIR_DOWN
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetInitialPhaseDirection(EPWM_Type *EPWMx, uint32_t counterdir)
{
    MODIFY_REG(EPWMx->TBCR, EPWM_TBCR_PHSDIR_Msk, counterdir);
}

/**
  * @brief    获取计数方向
  * @rmtoll   TBCR    PHSDIR    FL_EPWM_GetCounterDirection
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_COUNTER_SYNC_DIR_UP
  *           @arg @ref FL_EPWM_COUNTER_SYNC_DIR_DOWN
  */
__STATIC_INLINE uint32_t FL_EPWM_GetInitialPhaseDirection(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->TBCR, EPWM_TBCR_PHSDIR_Msk));
}

/**
  * @brief    使能SYNCOUT
  * @rmtoll   TBCR    OSTSYNCO    FL_EPWM_EnableSYNCOUT
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableSYNCOUT(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->TBCR, EPWM_TBCR_OSTSYNCO_Msk);
}

/**
  * @brief    设置SYNCOUT模式
  * @rmtoll   TBCR    OSTSYNCOEN    FL_EPWM_SetSYNCOUTMode
  * @param    EPWMx EPWM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_SYNCOUT_ONCE
  *           @arg @ref FL_EPWM_SYNCOUT_CONTINUE
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetSYNCOUTMode(EPWM_Type *EPWMx, uint32_t mode)
{
    MODIFY_REG(EPWMx->TBCR, EPWM_TBCR_OSTSYNCOEN_Msk, mode);
}

/**
  * @brief    获取SYNCOUT模式
  * @rmtoll   TBCR    OSTSYNCOEN    FL_EPWM_GetSYNCOUTMode
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_SYNCOUT_ONCE
  *           @arg @ref FL_EPWM_SYNCOUT_CONTINUE
  */
__STATIC_INLINE uint32_t FL_EPWM_GetSYNCOUTMode(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->TBCR, EPWM_TBCR_OSTSYNCOEN_Msk));
}

/**
  * @brief    使能ARR预装载功能
  * @rmtoll   TBCR    PRDSHEN    FL_EPWM_EnableARRPreload
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnablePRDPreload(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->TBCR, EPWM_TBCR_PRDSHEN_Msk);
}

/**
  * @brief    获取ARR预装载使能状态
  * @rmtoll   TBCR    PRDSHEN    FL_EPWM_IsEnabledARRPreload
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledPRDPreload(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->TBCR, EPWM_TBCR_PRDSHEN_Msk) == EPWM_TBCR_PRDSHEN_Msk);
}

/**
  * @brief    失能ARR预装载功能
  * @rmtoll   TBCR    PRDSHEN    FL_EPWM_DisableARRPreload
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisablePRDPreload(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->TBCR, EPWM_TBCR_PRDSHEN_Msk);
}

/**
  * @brief    使能ARR预装载功能
  * @rmtoll   TBCR    PHSEN    FL_EPWM_EnablePhaseReload
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnablePhaseReload(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->TBCR, EPWM_TBCR_PHSEN_Msk);
}

/**
  * @brief    获取ARR预装载使能状态
  * @rmtoll   TBCR    PHSEN    FL_EPWM_IsEnabledPhaseReload
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledPhaseReload(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->TBCR, EPWM_TBCR_PHSEN_Msk) == EPWM_TBCR_PHSEN_Msk);
}

/**
  * @brief    失能ARR预装载功能
  * @rmtoll   TBCR    PHSEN    FL_EPWM_DisablePhaseReload
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisablePhaseReload(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->TBCR, EPWM_TBCR_PHSEN_Msk);
}

/**
  * @brief    设置定时器模式
  * @rmtoll   TBCR    CNTMODE    FL_EPWM_SetCounterMode
  * @param    EPWMx EPWM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_COUNTER_MODE_UP
  *           @arg @ref FL_EPWM_COUNTER_MODE_DOWN
  *           @arg @ref FL_EPWM_COUNTER_MODE_UP_DOWN
  *           @arg @ref FL_EPWM_COUNTER_MODE_STOP
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetCounterMode(EPWM_Type *EPWMx, uint32_t mode)
{
    MODIFY_REG(EPWMx->TBCR, EPWM_TBCR_CNTMODE_Msk, mode);
}

/**
  * @brief    获取定时器模式
  * @rmtoll   TBCR    CNTMODE    FL_EPWM_GetCounterMode
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_COUNTER_MODE_UP
  *           @arg @ref FL_EPWM_COUNTER_MODE_DOWN
  *           @arg @ref FL_EPWM_COUNTER_MODE_UP_DOWN
  *           @arg @ref FL_EPWM_COUNTER_MODE_STOP
  */
__STATIC_INLINE uint32_t FL_EPWM_GetCounterMode(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->TBCR, EPWM_TBCR_CNTMODE_Msk));
}

/**
  * @brief    计数值达到最大标志
  * @rmtoll   TBSR    CNTMAX    FL_EPWM_IsActiveFlag_CNTMAX
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_CNTMAX(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->TBSR, EPWM_TBSR_CNTMAX_Msk) == (EPWM_TBSR_CNTMAX_Msk));
}

/**
  * @brief    清除计数值达到最大标志
  * @rmtoll   TBSR    CNTMAX    FL_EPWM_ClearFlag_CNTMAX
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_CNTMAX(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->TBSR, EPWM_TBSR_CNTMAX_Msk);
}

/**
  * @brief    获取输入同步标志
  * @rmtoll   TBSR    SYNCIF    FL_EPWM_IsActiveFlag_InputSYNC
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_InputSYNC(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->TBSR, EPWM_TBSR_SYNCIF_Msk) == (EPWM_TBSR_SYNCIF_Msk));
}

/**
  * @brief    清除输入同步标志
  * @rmtoll   TBSR    SYNCIF    FL_EPWM_ClearFlag_InputSYNC
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_InputSYNC(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->TBSR, EPWM_TBSR_SYNCIF_Msk);
}

/**
  * @brief    获取定时器计数方向
  * @rmtoll   TBSR    CNTDIR    FL_EPWM_GetCounterDirection
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_COUNTER_DIR_UP
  *           @arg @ref FL_EPWM_COUNTER_DIR_DOWN
  */
__STATIC_INLINE uint32_t FL_EPWM_GetCounterDirection(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->TBSR, EPWM_TBSR_CNTDIR_Msk));
}

/**
  * @brief    设置SYNCOUT源
  * @rmtoll   SYNC    SWSYNCOEN    FL_EPWM_SetSYNCOUTSource
  * @param    EPWMx EPWM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_SYNCOUT_SRC_SWSYNC
  *           @arg @ref FL_EPWM_SYNCOUT_SRC_CNT_0
  *           @arg @ref FL_EPWM_SYNCOUT_SRC_CNT_PRD
  *           @arg @ref FL_EPWM_SYNCOUT_SRC_CNT_CMPA
  *           @arg @ref FL_EPWM_SYNCOUT_SRC_CNT_CMPB
  *           @arg @ref FL_EPWM_SYNCOUT_SRC_CNT_CMPC
  *           @arg @ref FL_EPWM_SYNCOUT_SRC_CNT_CMPD
  *           @arg @ref FL_EPWM_SYNCOUT_SRC_DCAEVT1
  *           @arg @ref FL_EPWM_SYNCOUT_SRC_DCBEVT1
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetSYNCOUTSource(EPWM_Type *EPWMx, uint32_t source)
{
    MODIFY_REG(EPWMx->SYNC, EPWM_SYNC_SWSYNCOEN_Msk, source);
}

/**
  * @brief    设置SYNCOUT源
  * @rmtoll   SYNC    SWSYNCOEN    FL_EPWM_GetSYNCOUTSource
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_SYNCOUT_SRC_SWSYNC
  *           @arg @ref FL_EPWM_SYNCOUT_SRC_CNT_0
  *           @arg @ref FL_EPWM_SYNCOUT_SRC_CNT_PRD
  *           @arg @ref FL_EPWM_SYNCOUT_SRC_CNT_CMPA
  *           @arg @ref FL_EPWM_SYNCOUT_SRC_CNT_CMPB
  *           @arg @ref FL_EPWM_SYNCOUT_SRC_CNT_CMPC
  *           @arg @ref FL_EPWM_SYNCOUT_SRC_CNT_CMPD
  *           @arg @ref FL_EPWM_SYNCOUT_SRC_DCAEVT1
  *           @arg @ref FL_EPWM_SYNCOUT_SRC_DCBEVT1
  */
__STATIC_INLINE uint32_t FL_EPWM_GetSYNCOUTSource(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->SYNC, EPWM_SYNC_SWSYNCOEN_Msk));
}

/**
  * @brief    设置EPWM同步信号输入
  * @rmtoll   SYNC    SYNCINSEL    FL_EPWM_SetSYNCInputSource
  * @param    EPWMx EPWM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_NONE
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_EPWM0_SYNCOUT
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_EPWM1_SYNCOUT
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_EPWM2_SYNCOUT
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_EPWM3_SYNCOUT
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_ATIM0
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_ATIM1
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_GPTIM0
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_GPTIM1
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_GPTIM2
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetSYNCInputSource(EPWM_Type *EPWMx, uint32_t source)
{
    MODIFY_REG(EPWMx->SYNC, EPWM_SYNC_SYNCINSEL_Msk, source);
}

/**
  * @brief    读取EPWM同步信号输入
  * @rmtoll   SYNC    SYNCINSEL    FL_EPWM_GetSYNCInputSource
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_NONE
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_EPWM0_SYNCOUT
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_EPWM1_SYNCOUT
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_EPWM2_SYNCOUT
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_EPWM3_SYNCOUT
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_ATIM0
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_ATIM1
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_GPTIM0
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_GPTIM1
  *           @arg @ref FL_EPWM_SYNC_IN_SEL_GPTIM2
  */
__STATIC_INLINE uint32_t FL_EPWM_GetSYNCInputSource(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->SYNC, EPWM_SYNC_SYNCINSEL_Msk));
}

/**
  * @brief    使能软件SYNC事件
  * @rmtoll   SWACT    SWSYNC    FL_EPWM_EnableSoftwareSYNC
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableSoftwareSYNC(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->SWACT, EPWM_SWACT_SWSYNC_Msk);
}

/**
  * @brief    设置EPWMA的比较值
  * @rmtoll   CMPA    CMPA    FL_EPWM_WriteCompareA
  * @param    EPWMx EPWM instance
  * @param    compare
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WriteCompareA(EPWM_Type *EPWMx, uint32_t compare)
{
    MODIFY_REG(EPWMx->CMPA, (0xffffU << 0U), (compare << 0U));
}

/**
  * @brief    读取EPWMA的比较值
  * @rmtoll   CMPA    CMPA    FL_EPWM_ReadCompareA
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadCompareA(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->CMPA, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    设置EPWMB的比较值
  * @rmtoll   CMPB    CMPB    FL_EPWM_WriteCompareB
  * @param    EPWMx EPWM instance
  * @param    compare
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WriteCompareB(EPWM_Type *EPWMx, uint32_t compare)
{
    MODIFY_REG(EPWMx->CMPB, (0xffffU << 0U), (compare << 0U));
}

/**
  * @brief    读取EPWMB的比较值
  * @rmtoll   CMPB    CMPB    FL_EPWM_ReadCompareB
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadCompareB(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->CMPB, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    设置EPWMC的比较值
  * @rmtoll   CMPC    CMPC    FL_EPWM_WriteCompareC
  * @param    EPWMx EPWM instance
  * @param    compare
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WriteCompareC(EPWM_Type *EPWMx, uint32_t compare)
{
    MODIFY_REG(EPWMx->CMPC, (0xffffU << 0U), (compare << 0U));
}

/**
  * @brief    读取EPWMC的比较值
  * @rmtoll   CMPC    CMPC    FL_EPWM_ReadCompareC
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadCompareC(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->CMPC, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    设置EPWMD的比较值
  * @rmtoll   CMPD    CMPD    FL_EPWM_WriteCompareD
  * @param    EPWMx EPWM instance
  * @param    compare
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WriteCompareD(EPWM_Type *EPWMx, uint32_t compare)
{
    MODIFY_REG(EPWMx->CMPD, (0xffffU << 0U), (compare << 0U));
}

/**
  * @brief    读取EPWMD的比较值
  * @rmtoll   CMPD    CMPD    FL_EPWM_ReadCompareD
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadCompareD(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->CMPD, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    使能比较通道D的预装载功能
  * @rmtoll   CCR    CMPDSHEN    FL_EPWM_EnableCompareDPreload
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableCompareDPreload(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->CCR, EPWM_CCR_CMPDSHEN_Msk);
}

/**
  * @brief    读取比较通道D的预装载使能状态
  * @rmtoll   CCR    CMPDSHEN    FL_EPWM_IsEnabledCompareDPreload
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledCompareDPreload(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->CCR, EPWM_CCR_CMPDSHEN_Msk) == EPWM_CCR_CMPDSHEN_Msk);
}

/**
  * @brief    失能比较通道D的预装载功能
  * @rmtoll   CCR    CMPDSHEN    FL_EPWM_DisableCompareDPreload
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableCompareDPreload(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->CCR, EPWM_CCR_CMPDSHEN_Msk);
}

/**
  * @brief    使能比较通道C的预装载功能
  * @rmtoll   CCR    CMPCSHEN    FL_EPWM_EnableCompareCPreload
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableCompareCPreload(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->CCR, EPWM_CCR_CMPCSHEN_Msk);
}

/**
  * @brief    读取比较通道C的预装载使能状态
  * @rmtoll   CCR    CMPCSHEN    FL_EPWM_IsEnabledCompareCPreload
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledCompareCPreload(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->CCR, EPWM_CCR_CMPCSHEN_Msk) == EPWM_CCR_CMPCSHEN_Msk);
}

/**
  * @brief    失能比较通道C的预装载功能
  * @rmtoll   CCR    CMPCSHEN    FL_EPWM_DisableCompareCPreload
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableCompareCPreload(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->CCR, EPWM_CCR_CMPCSHEN_Msk);
}

/**
  * @brief    设置比较通道D的预装载触发
  * @rmtoll   CCR    LDCMPD    FL_EPWM_SetCompareDPreloadTrigger
  * @param    EPWMx EPWM instance
  * @param    trigger This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CMPD_LOAD_CNT_0
  *           @arg @ref FL_EPWM_CMPD_LOAD_CNT_PRD
  *           @arg @ref FL_EPWM_CMPD_LOAD_SYNC_RISING
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetCompareDPreloadTrigger(EPWM_Type *EPWMx, uint32_t trigger)
{
    MODIFY_REG(EPWMx->CCR, EPWM_CCR_LDCMPD_Msk, trigger);
}

/**
  * @brief    获取比较通道D的预装载触发源
  * @rmtoll   CCR    LDCMPD    FL_EPWM_GetCompareDPreloadTrigger
  * @param    EPWMx EPWM instance
  * @param    trigger This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CMPD_LOAD_CNT_0
  *           @arg @ref FL_EPWM_CMPD_LOAD_CNT_PRD
  *           @arg @ref FL_EPWM_CMPD_LOAD_SYNC_RISING
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_CMPD_LOAD_CNT_0
  *           @arg @ref FL_EPWM_CMPD_LOAD_CNT_PRD
  *           @arg @ref FL_EPWM_CMPD_LOAD_SYNC_RISING
  */
__STATIC_INLINE uint32_t FL_EPWM_GetCompareDPreloadTrigger(EPWM_Type *EPWMx, uint32_t trigger)
{
    return (uint32_t)(READ_BIT(EPWMx->CCR, EPWM_CCR_LDCMPD_Msk));
}

/**
  * @brief    设置比较通道C的预装载触发
  * @rmtoll   CCR    LDCMPC    FL_EPWM_SetCompareCPreloadTrigger
  * @param    EPWMx EPWM instance
  * @param    trigger This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CMPC_LOAD_CNT_0
  *           @arg @ref FL_EPWM_CMPC_LOAD_CNT_PRD
  *           @arg @ref FL_EPWM_CMPC_LOAD_SYNC_RISING
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetCompareCPreloadTrigger(EPWM_Type *EPWMx, uint32_t trigger)
{
    MODIFY_REG(EPWMx->CCR, EPWM_CCR_LDCMPC_Msk, trigger);
}

