waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epwm.h
/**
  * @brief    获取比较通道C的预装载触发源
  * @rmtoll   CCR    LDCMPC    FL_EPWM_GetCompareCPreloadTrigger
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_CMPC_LOAD_CNT_0
  *           @arg @ref FL_EPWM_CMPC_LOAD_CNT_PRD
  *           @arg @ref FL_EPWM_CMPC_LOAD_SYNC_RISING
  */
__STATIC_INLINE uint32_t FL_EPWM_GetCompareCPreloadTrigger(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->CCR, EPWM_CCR_LDCMPC_Msk));
}

/**
  * @brief    使能比较通道B的预装载功能
  * @rmtoll   CCR    CMPBSHEN    FL_EPWM_EnableCompareBPreload
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableCompareBPreload(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->CCR, EPWM_CCR_CMPBSHEN_Msk);
}

/**
  * @brief    读取比较通道B的预装载使能状态
  * @rmtoll   CCR    CMPBSHEN    FL_EPWM_IsEnabledCompareBPreload
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledCompareBPreload(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->CCR, EPWM_CCR_CMPBSHEN_Msk) == EPWM_CCR_CMPBSHEN_Msk);
}

/**
  * @brief    失能比较通道B的预装载功能
  * @rmtoll   CCR    CMPBSHEN    FL_EPWM_DisableCompareBPreload
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableCompareBPreload(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->CCR, EPWM_CCR_CMPBSHEN_Msk);
}

/**
  * @brief    使能比较通道A的预装载功能
  * @rmtoll   CCR    CMPASHEN    FL_EPWM_EnableCompareAPreload
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableCompareAPreload(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->CCR, EPWM_CCR_CMPASHEN_Msk);
}

/**
  * @brief    读取比较通道A的预装载使能状态
  * @rmtoll   CCR    CMPASHEN    FL_EPWM_IsEnabledCompareAPreload
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledCompareAPreload(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->CCR, EPWM_CCR_CMPASHEN_Msk) == EPWM_CCR_CMPASHEN_Msk);
}

/**
  * @brief    失能比较通道A的预装载功能
  * @rmtoll   CCR    CMPASHEN    FL_EPWM_DisableCompareAPreload
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableCompareAPreload(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->CCR, EPWM_CCR_CMPASHEN_Msk);
}

/**
  * @brief    设置比较通道B的预装载触发
  * @rmtoll   CCR    LDCMPB    FL_EPWM_SetCompareBPreloadTrigger
  * @param    EPWMx EPWM instance
  * @param    trigger This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CMPB_LOAD_CNT_0
  *           @arg @ref FL_EPWM_CMPB_LOAD_CNT_PRD
  *           @arg @ref FL_EPWM_CMPB_LOAD_SYNC_RISING
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetCompareBPreloadTrigger(EPWM_Type *EPWMx, uint32_t trigger)
{
    MODIFY_REG(EPWMx->CCR, EPWM_CCR_LDCMPB_Msk, trigger);
}

/**
  * @brief    获取比较通道B的预装载触发源
  * @rmtoll   CCR    LDCMPB    FL_EPWM_GetCompareBPreloadTrigger
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_CMPB_LOAD_CNT_0
  *           @arg @ref FL_EPWM_CMPB_LOAD_CNT_PRD
  *           @arg @ref FL_EPWM_CMPB_LOAD_SYNC_RISING
  */
__STATIC_INLINE uint32_t FL_EPWM_GetCompareBPreloadTrigger(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->CCR, EPWM_CCR_LDCMPB_Msk));
}

/**
  * @brief    设置比较通道A的预装载触发
  * @rmtoll   CCR    LDCMPA    FL_EPWM_SetCompareAPreloadTrigger
  * @param    EPWMx EPWM instance
  * @param    trigger This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CMPA_LOAD_CNT_0
  *           @arg @ref FL_EPWM_CMPA_LOAD_CNT_PRD
  *           @arg @ref FL_EPWM_CMPA_LOAD_SYNC_RISING
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetCompareAPreloadTrigger(EPWM_Type *EPWMx, uint32_t trigger)
{
    MODIFY_REG(EPWMx->CCR, EPWM_CCR_LDCMPA_Msk, trigger);
}

/**
  * @brief    获取比较通道A的预装载触发源
  * @rmtoll   CCR    LDCMPA    FL_EPWM_GetCompareAPreloadTrigger
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_CMPA_LOAD_CNT_0
  *           @arg @ref FL_EPWM_CMPA_LOAD_CNT_PRD
  *           @arg @ref FL_EPWM_CMPA_LOAD_SYNC_RISING
  */
__STATIC_INLINE uint32_t FL_EPWM_GetCompareAPreloadTrigger(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->CCR, EPWM_CCR_LDCMPA_Msk));
}

/**
  * @brief    使能输出通道的预装载功能
  * @rmtoll   OACR    OACRSHEN    FL_EPWM_OC_EnablePreload
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_OC_EnablePreload(EPWM_Type *EPWMx, uint32_t channel)
{
    if(channel == FL_EPWM_CHANNEL_A)
    {
        SET_BIT(EPWMx->OACR, EPWM_OACR_OACRSHEN_Msk);
    }
    else if(channel == FL_EPWM_CHANNEL_B)
    {
        SET_BIT(EPWMx->OBCR, EPWM_OACR_OACRSHEN_Msk);
    }

}

/**
  * @brief    读取输出的预装载使能状态
  * @rmtoll   OACR    OACRSHEN    FL_EPWM_OC_IsEnabledPreload
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_OC_IsEnabledPreload(EPWM_Type *EPWMx, uint32_t channel)
{
    uint32_t status;
    if(channel == FL_EPWM_CHANNEL_A)
    { status = (uint32_t)(READ_BIT(EPWMx->OACR, EPWM_OACR_OACRSHEN_Msk) == EPWM_OACR_OACRSHEN_Msk); }
    else if(channel == FL_EPWM_CHANNEL_B)
    { status = (uint32_t)(READ_BIT(EPWMx->OBCR, EPWM_OACR_OACRSHEN_Msk) == EPWM_OACR_OACRSHEN_Msk); }
    return status;
}

/**
  * @brief    失能输出的预装载功能
  * @rmtoll   OACR    OACRSHEN    FL_EPWM_OC_DisablePreload
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_OC_DisablePreload(EPWM_Type *EPWMx, uint32_t channel)
{
    if(channel == FL_EPWM_CHANNEL_A)
    { CLEAR_BIT(EPWMx->OACR, EPWM_OACR_OACRSHEN_Msk); }
    if(channel == FL_EPWM_CHANNEL_B)
    { CLEAR_BIT(EPWMx->OBCR, EPWM_OACR_OACRSHEN_Msk); }
}

/**
  * @brief    设置比较通道的预装载触发
  * @rmtoll   OACR    LDOA    FL_EPWM_OC_SetpreloadTrigger
  * @param    EPWMx EPWM instance
  * @param    trigger This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_OC_LOAD_CNT_0
  *           @arg @ref FL_EPWM_OC_LOAD_CNT_PRD
  *           @arg @ref FL_EPWM_OC_LOAD_SYNC_RISING
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_OC_SetpreloadTrigger(EPWM_Type *EPWMx, uint32_t trigger, uint32_t channel)
{
    if(channel == FL_EPWM_CHANNEL_A)
    { MODIFY_REG(EPWMx->OACR, EPWM_OACR_LDOA_Msk, trigger << EPWM_OACR_LDOA_Pos); }
    else if(channel == FL_EPWM_CHANNEL_B)
    { MODIFY_REG(EPWMx->OBCR, EPWM_OACR_LDOA_Msk, trigger << EPWM_OACR_LDOA_Pos); }
}

/**
  * @brief    获取比较通道的预装载触发源
  * @rmtoll   OACR    LDOA    FL_EPWM_OC_GetpreloadTrigger
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_OC_LOAD_CNT_0
  *           @arg @ref FL_EPWM_OC_LOAD_CNT_PRD
  *           @arg @ref FL_EPWM_OC_LOAD_SYNC_RISING
  */
__STATIC_INLINE uint32_t FL_EPWM_OC_GetpreloadTrigger(EPWM_Type *EPWMx, uint32_t channel)
{
    uint32_t trigger;
    if(channel == FL_EPWM_CHANNEL_A)
    { trigger = (uint32_t)(READ_BIT(EPWMx->OACR, EPWM_OACR_LDOA_Msk)); }
    else if(channel == FL_EPWM_CHANNEL_B)
    { trigger = (uint32_t)(READ_BIT(EPWMx->OBCR, EPWM_OACR_LDOA_Msk)); }
    return trigger;
}

/**
  * @brief    设置向下计数时CNT=CMPB时的EPWM输出动作
  * @rmtoll   OACR    CBD    FL_EPWM_SetOCMode_CNTEqualCMPB_DirDown
  * @param    EPWMx EPWM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_OC_MODE_FROZEN
  *           @arg @ref FL_EPWM_OC_MODE_LOW
  *           @arg @ref FL_EPWM_OC_MODE_HIGH
  *           @arg @ref FL_EPWM_OC_MODE_TOGGLE
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetOCMode_CNTEqualCMPB_DirDown(EPWM_Type *EPWMx, uint32_t mode, uint32_t channel)
{
    if(channel == FL_EPWM_CHANNEL_A)
    { MODIFY_REG(EPWMx->OACR, EPWM_OACR_CBD_Msk, mode << EPWM_OACR_CBD_Pos); }
    else if(channel == FL_EPWM_CHANNEL_B)
    { MODIFY_REG(EPWMx->OBCR, EPWM_OACR_CBD_Msk, mode << EPWM_OACR_CBD_Pos); }
}

/**
  * @brief    获取向下计数时CNT=CMPB时的EPWM输出动作
  * @rmtoll   OACR    CBD    FL_EPWM_GetOCMode_CNTEqualsCMPB_DirDown
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_OA_MODE_FROZEN
  *           @arg @ref FL_EPWM_OA_MODE_LOW
  *           @arg @ref FL_EPWM_OA_MODE_HIGH
  *           @arg @ref FL_EPWM_OA_MODE_TOGGLE
  */
__STATIC_INLINE uint32_t FL_EPWM_GetOCMode_CNTEqualCMPB_DirDown(EPWM_Type *EPWMx, uint32_t channel)
{
    uint32_t mode;
    if(channel == FL_EPWM_CHANNEL_A)
    { mode = (uint32_t)(READ_BIT(EPWMx->OACR, EPWM_OACR_CBD_Msk)); }
    else if(channel == FL_EPWM_CHANNEL_B)
    { mode = (uint32_t)(READ_BIT(EPWMx->OBCR, EPWM_OACR_CBD_Msk)); }
    return mode;

