waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epwm.h
}

/**
  * @brief    设置向上计数时CNT=CMPB时的EPWM输出动作
  * @rmtoll   OACR    CBU    FL_EPWM_SetOCMode_CNTEqualsCMPB_DirUp
  * @param    EPWMx EPWM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_OA_MODE_FROZEN
  *           @arg @ref FL_EPWM_OA_MODE_LOW
  *           @arg @ref FL_EPWM_OA_MODE_HIGH
  *           @arg @ref FL_EPWM_OA_MODE_TOGGLE
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetOCMode_CNTEqualCMPB_DirUp(EPWM_Type *EPWMx, uint32_t mode, uint32_t channel)
{
    if(channel == FL_EPWM_CHANNEL_A)
    { MODIFY_REG(EPWMx->OACR, EPWM_OACR_CBU_Msk, mode << EPWM_OACR_CBU_Pos); }
    else if(channel == FL_EPWM_CHANNEL_B)
    { MODIFY_REG(EPWMx->OBCR, EPWM_OACR_CBU_Msk, mode << EPWM_OACR_CBU_Pos); }
}

/**
  * @brief    获取向上计数时CNT=CMPB时的EPWM输出动作
  * @rmtoll   OACR    CBU    FL_EPWM_GetOCMode_CNTEqualsCMPB_DirUp
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_OA_MODE_FROZEN
  *           @arg @ref FL_EPWM_OA_MODE_LOW
  *           @arg @ref FL_EPWM_OA_MODE_HIGH
  *           @arg @ref FL_EPWM_OA_MODE_TOGGLE
  */
__STATIC_INLINE uint32_t FL_EPWM_GetOCMode_CNTEqualCMPB_DirUp(EPWM_Type *EPWMx, uint32_t channel)
{
    uint32_t mode;
    if(channel == FL_EPWM_CHANNEL_A)
    { mode = (uint32_t)(READ_BIT(EPWMx->OACR, EPWM_OACR_CBU_Msk)); }
    else if(channel == FL_EPWM_CHANNEL_B)
    { mode = (uint32_t)(READ_BIT(EPWMx->OBCR, EPWM_OACR_CBU_Msk)); }
    return mode;
}

/**
  * @brief    设置向下计数时CNT=CMPA时的EPWM输出动作
  * @rmtoll   OACR    CAD    FL_EPWM_SetOCMode_CNTEqualsCMPA_DirDown
  * @param    EPWMx EPWM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_OA_MODE_FROZEN
  *           @arg @ref FL_EPWM_OA_MODE_LOW
  *           @arg @ref FL_EPWM_OA_MODE_HIGH
  *           @arg @ref FL_EPWM_OA_MODE_TOGGLE
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetOCMode_CNTEqualCMPA_DirDown(EPWM_Type *EPWMx, uint32_t mode, uint32_t channel)
{
    if(channel == FL_EPWM_CHANNEL_A)
    { MODIFY_REG(EPWMx->OACR, EPWM_OACR_CAD_Msk, mode << EPWM_OACR_CAD_Pos); }
    else if(channel == FL_EPWM_CHANNEL_B)
    { MODIFY_REG(EPWMx->OBCR, EPWM_OACR_CAD_Msk, mode << EPWM_OACR_CAD_Pos); }
}

/**
  * @brief    获取向下计数时CNT=CMPA时的EPWM输出动作
  * @rmtoll   OACR    CAD    FL_EPWM_GetOCMode_CNTEqualsCMPA_DirDown
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_OA_MODE_FROZEN
  *           @arg @ref FL_EPWM_OA_MODE_LOW
  *           @arg @ref FL_EPWM_OA_MODE_HIGH
  *           @arg @ref FL_EPWM_OA_MODE_TOGGLE
  */
__STATIC_INLINE uint32_t FL_EPWM_GetOCMode_CNTEqualCMPA_DirDown(EPWM_Type *EPWMx, uint32_t channel)
{
    uint32_t mode;
    if(channel == FL_EPWM_CHANNEL_A)
    { mode = (uint32_t)(READ_BIT(EPWMx->OACR, EPWM_OACR_CAD_Msk)); }
    else if(channel == FL_EPWM_CHANNEL_B)
    { mode = (uint32_t)(READ_BIT(EPWMx->OBCR, EPWM_OACR_CAD_Msk)); }
    return mode;
}

/**
  * @brief    设置向上计数时CNT=CMPA时的EPWM输出动作
  * @rmtoll   OACR    CAU    FL_EPWM_SetOCMode_CNTEqualsCMPA_DirUp
  * @param    EPWMx EPWM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_OA_MODE_FROZEN
  *           @arg @ref FL_EPWM_OA_MODE_LOW
  *           @arg @ref FL_EPWM_OA_MODE_HIGH
  *           @arg @ref FL_EPWM_OA_MODE_TOGGLE
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetOCMode_CNTEqualCMPA_DirUp(EPWM_Type *EPWMx, uint32_t mode, uint32_t channel)
{
    if(channel == FL_EPWM_CHANNEL_A)
    { MODIFY_REG(EPWMx->OACR, EPWM_OACR_CAU_Msk, mode << EPWM_OACR_CAU_Pos); }
    else if(channel == FL_EPWM_CHANNEL_B)
    { MODIFY_REG(EPWMx->OBCR, EPWM_OACR_CAU_Msk, mode << EPWM_OACR_CAU_Pos); }
}

/**
  * @brief    获取向上计数时CNT=CMPA时的EPWM输出动作
  * @rmtoll   OACR    CAU    FL_EPWM_GetOCMode_CNTEqualsCMPA_DirUp
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_OA_MODE_FROZEN
  *           @arg @ref FL_EPWM_OA_MODE_LOW
  *           @arg @ref FL_EPWM_OA_MODE_HIGH
  *           @arg @ref FL_EPWM_OA_MODE_TOGGLE
  */
__STATIC_INLINE uint32_t FL_EPWM_GetOCMode_CNTEqualCMPA_DirUp(EPWM_Type *EPWMx, uint32_t channel)
{
    uint32_t mode;
    if(channel == FL_EPWM_CHANNEL_A)
    { mode = (uint32_t)(READ_BIT(EPWMx->OACR, EPWM_OACR_CAU_Msk)); }
    else if(channel == FL_EPWM_CHANNEL_B)
    { mode = (uint32_t)(READ_BIT(EPWMx->OBCR, EPWM_OACR_CAU_Msk)); }
    return mode;
}

/**
  * @brief    设置CNT=PRD时的EPWM输出动作
  * @rmtoll   OACR    PRD    FL_EPWM_SetOCMode_CNTEqualsPRD
  * @param    EPWMx EPWM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_OA_MODE_FROZEN
  *           @arg @ref FL_EPWM_OA_MODE_LOW
  *           @arg @ref FL_EPWM_OA_MODE_HIGH
  *           @arg @ref FL_EPWM_OA_MODE_TOGGLE
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetOCMode_CNTEqualPRD(EPWM_Type *EPWMx, uint32_t mode, uint32_t channel)
{
    if(channel == FL_EPWM_CHANNEL_A)
    { MODIFY_REG(EPWMx->OACR, EPWM_OACR_PRD_Msk, mode << EPWM_OACR_PRD_Pos); }
    else if(channel == FL_EPWM_CHANNEL_B)
    { MODIFY_REG(EPWMx->OBCR, EPWM_OACR_PRD_Msk, mode << EPWM_OACR_PRD_Pos); }
}

/**
  * @brief    获取CNT=PRD时的EPWM输出动作
  * @rmtoll   OACR    PRD    FL_EPWM_GetOCMode_CNTEqualsPRD
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_OA_MODE_FROZEN
  *           @arg @ref FL_EPWM_OA_MODE_LOW
  *           @arg @ref FL_EPWM_OA_MODE_HIGH
  *           @arg @ref FL_EPWM_OA_MODE_TOGGLE
  */
__STATIC_INLINE uint32_t FL_EPWM_GetOCMode_CNTEqualPRD(EPWM_Type *EPWMx, uint32_t channel)
{
    uint32_t mode;
    if(channel == FL_EPWM_CHANNEL_A)
    { mode = (uint32_t)(READ_BIT(EPWMx->OACR, EPWM_OACR_PRD_Msk)); }
    else if(channel == FL_EPWM_CHANNEL_B)
    { mode = (uint32_t)(READ_BIT(EPWMx->OBCR, EPWM_OACR_PRD_Msk)); }
    return mode;
}

/**
  * @brief    设置CNT=0时的EPWM输出动作
  * @rmtoll   OACR    ZRO    FL_EPWM_SetOCMode_CNTEqualsZero
  * @param    EPWMx EPWM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_OA_MODE_FROZEN
  *           @arg @ref FL_EPWM_OA_MODE_LOW
  *           @arg @ref FL_EPWM_OA_MODE_HIGH
  *           @arg @ref FL_EPWM_OA_MODE_TOGGLE
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetOCMode_CNTEqualZero(EPWM_Type *EPWMx, uint32_t mode, uint32_t channel)
{
    if(channel == FL_EPWM_CHANNEL_A)
    { MODIFY_REG(EPWMx->OACR, EPWM_OACR_ZRO_Msk, mode << EPWM_OACR_ZRO_Pos); }
    else if(channel == FL_EPWM_CHANNEL_B)
    { MODIFY_REG(EPWMx->OBCR, EPWM_OACR_ZRO_Msk, mode << EPWM_OACR_ZRO_Pos); }
}

/**
  * @brief    获取CNT=0时的EPWM输出动作
  * @rmtoll   OACR    ZRO    FL_EPWM_GetOCMode_CNTEqualsZero
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_OA_MODE_FROZEN
  *           @arg @ref FL_EPWM_OA_MODE_LOW
  *           @arg @ref FL_EPWM_OA_MODE_HIGH
  *           @arg @ref FL_EPWM_OA_MODE_TOGGLE
  */
__STATIC_INLINE uint32_t FL_EPWM_GetOCMode_CNTEqualZero(EPWM_Type *EPWMx, uint32_t channel)
{
    uint32_t mode;
    if(channel == FL_EPWM_CHANNEL_A)
    { mode = (uint32_t)(READ_BIT(EPWMx->OACR, EPWM_OACR_ZRO_Msk)); }
    else if(channel == FL_EPWM_CHANNEL_B)
    { mode = (uint32_t)(READ_BIT(EPWMx->OBCR, EPWM_OACR_ZRO_Msk)); }
    return mode;
}

/**
  * @brief    设置CSF装载模式
  * @rmtoll   SFCR    LDSFR    FL_EPWM_SetContinuousSoftwareForceLoadMode
  * @param    EPWMx EPWM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CSF_LOAD_CNT_0
  *           @arg @ref FL_EPWM_CSF_LOAD_CNT_ARR
  *           @arg @ref FL_EPWM_CSF_LOAD_CNT_0_ARR
  *           @arg @ref FL_EPWM_CSF_LOAD_SOFTWARE
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetContinuousSoftwareForceLoadMode(EPWM_Type *EPWMx, uint32_t mode)
{
    MODIFY_REG(EPWMx->SFCR, EPWM_SFCR_LDSFR_Msk, mode);
}

/**
  * @brief    读取CSF装载模式
  * @rmtoll   SFCR    LDSFR    FL_EPWM_GetContinuousSoftwareForceLoadMode
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_CSF_LOAD_CNT_0
  *           @arg @ref FL_EPWM_CSF_LOAD_CNT_ARR
  *           @arg @ref FL_EPWM_CSF_LOAD_CNT_0_ARR
  *           @arg @ref FL_EPWM_CSF_LOAD_SOFTWARE
  */
__STATIC_INLINE uint32_t FL_EPWM_GetContinuousSoftwareForceLoadMode(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->SFCR, EPWM_SFCR_LDSFR_Msk));
}

/**
  * @brief    设置软件触发EPWM输出动作
  * @rmtoll   SFCR    ACTOTSFA    FL_EPWM_SetOCMode_SoftwareSingleForce
  * @param    EPWMx EPWM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_OA_MODE_FROZEN
  *           @arg @ref FL_EPWM_OA_MODE_LOW
  *           @arg @ref FL_EPWM_OA_MODE_HIGH
  *           @arg @ref FL_EPWM_OA_MODE_TOGGLE
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetOCMode_SoftwareSingleForce(EPWM_Type *EPWMx, uint32_t mode, uint32_t channel)
{
    MODIFY_REG(EPWMx->SFCR, mode, EPWM_SFCR_ACTOTSFA_Msk << channel);
}

/**
  * @brief    获取软件触发EPWM输出动作
  * @rmtoll   SFCR    ACTOTSFA    FL_EPWM_GetOCMode_SoftwareSingleForce
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_OA_MODE_FROZEN
  *           @arg @ref FL_EPWM_OA_MODE_LOW
  *           @arg @ref FL_EPWM_OA_MODE_HIGH
  *           @arg @ref FL_EPWM_OA_MODE_TOGGLE
  */
__STATIC_INLINE uint32_t FL_EPWM_GetOCMode_SoftwareSingleForce(EPWM_Type *EPWMx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(EPWMx->SFCR, EPWM_SFCR_ACTOTSFA_Msk << channel));
}

/**
  * @brief    设置软件触发EPWMB输出
  * @rmtoll   SFR    OTSFB    FL_EPWM_EnableOutputBSoftwareSingleForce
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableOutputBSoftwareSingleForce(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->SFR, EPWM_SFR_OTSFB_Msk);
}

/**
  * @brief    设置软件触发EPWMA输出
  * @rmtoll   SFR    OTSFA    FL_EPWM_EnableOutputASoftwareSingleForce
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableOutputASoftwareSingleForce(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->SFR, EPWM_SFR_OTSFA_Msk);
}

/**
  * @brief    设置软件触发模式
  * @rmtoll   SFR    CSFA    FL_EPWM_SetSoftwareSingleForceMode
  * @param    EPWMx EPWM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CSF_MODE_FROZEN
  *           @arg @ref FL_EPWM_CSF_MODE_CONTINUE_LOW
  *           @arg @ref FL_EPWM_CSF_MODE_CONTINUE_HIGH
  *           @arg @ref FL_EPWM_CSF_MODE_FROZEN
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetSoftwareSingleForceMode(EPWM_Type *EPWMx, uint32_t mode, uint32_t channel)
{
    MODIFY_REG(EPWMx->SFR, mode, EPWM_SFR_CSFA_Msk << channel);
}

/**
  * @brief    获取软件触发模式
  * @rmtoll   SFR    CSFA    FL_EPWM_GetSoftwareSingleForceMode
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_CSF_MODE_FROZEN
  *           @arg @ref FL_EPWM_CSF_MODE_CONTINUE_LOW
  *           @arg @ref FL_EPWM_CSF_MODE_CONTINUE_HIGH
  *           @arg @ref FL_EPWM_CSF_MODE_FROZEN
  */
__STATIC_INLINE uint32_t FL_EPWM_GetSoftwareSingleForceMode(EPWM_Type *EPWMx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(EPWMx->SFR, EPWM_SFR_CSFA_Msk << channel));
}

/**
  * @brief    设置死区下降沿延迟信号输入源
  * @rmtoll   DTCR    FEDSEL    FL_EPWM _SetDeadbandFallingDelaySignalSource
  * @param    EPWMx EPWM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_DEADBAND_FALLING_EPWMB
  *           @arg @ref FL_EPWM_DEADBAND_FALLING_EPWMA
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetDeadbandFallingDelaySignalSource(EPWM_Type *EPWMx, uint32_t source)
{
    MODIFY_REG(EPWMx->DTCR, EPWM_DTCR_FEDSEL_Msk, source);
}

/**
  * @brief    获取死区下降沿延迟信号输入源
  * @rmtoll   DTCR    FEDSEL    FL_EPWM _GetDeadbandFallingDelaySignalSource
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_DEADBAND_FALLING_EPWMB
  *           @arg @ref FL_EPWM_DEADBAND_FALLING_EPWMA
  */
__STATIC_INLINE uint32_t FL_EPWM_GetDeadbandFallingDelaySignalSource(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->DTCR, EPWM_DTCR_FEDSEL_Msk));
}

/**
  * @brief    设置死区上升沿延迟信号输入源
  * @rmtoll   DTCR    REDSEL    FL_EPWM _SetDeadbandRisingDelaySignalSource
  * @param    EPWMx EPWM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_DEADBAND_RISING_EPWMB
  *           @arg @ref FL_EPWM_DEADBAND_RISING_EPWMA
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetDeadbandRisingDelaySignalSource(EPWM_Type *EPWMx, uint32_t source)
{
    MODIFY_REG(EPWMx->DTCR, EPWM_DTCR_REDSEL_Msk, source);
}

/**
  * @brief    获取死区上升沿延迟信号输入源
  * @rmtoll   DTCR    REDSEL    FL_EPWM _GetDeadbandRisingDelaySignalSource
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_DEADBAND_RISING_EPWMB
  *           @arg @ref FL_EPWM_DEADBAND_RISING_EPWMA
  */
__STATIC_INLINE uint32_t FL_EPWM_GetDeadbandRisingDelaySignalSource(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->DTCR, EPWM_DTCR_REDSEL_Msk));
}

/**
  * @brief    设置死区输出极性
  * @rmtoll   DTCR    POLSELA    FL_EPWM _SetDeadbandOutputPolarity
  * @param    EPWMx EPWM instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_DEADBAND_PORLARITY_NORMAL
  *           @arg @ref FL_EPWM_DEADBAND_PORLARITY_REVERSE
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetDeadbandOutputPolarity(EPWM_Type *EPWMx, uint32_t polarity, uint32_t channel)
{
    MODIFY_REG(EPWMx->DTCR, polarity, EPWM_DTCR_POLSELA_Msk << channel);
}

/**
  * @brief    读取死区输出极性
  * @rmtoll   DTCR    POLSELA    FL_EPWM _GetDeadbandOutputPolarity
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_DEADBAND_PORLARITY_NORMAL
  *           @arg @ref FL_EPWM_DEADBAND_PORLARITY_REVERSE
  */
__STATIC_INLINE uint32_t FL_EPWM_GetDeadbandOutputPolarity(EPWM_Type *EPWMx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(EPWMx->DTCR, EPWM_DTCR_POLSELA_Msk << channel));
}

/**
  * @brief    使能死区Bypass
  * @rmtoll   DTCR    BYPASSA    FL_EPWM_EnableDeadbandBypass
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableDeadbandBypass(EPWM_Type *EPWMx, uint32_t channel)
{
    SET_BIT(EPWMx->DTCR, EPWM_DTCR_BYPASSA_Msk << channel);
}

/**
  * @brief    读取死区Bypass使能状态
  * @rmtoll   DTCR    BYPASSA    FL_EPWM_IsEnabledDeadbandBypass
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledDeadbandBypass(EPWM_Type *EPWMx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(EPWMx->DTCR, EPWM_DTCR_BYPASSA_Msk << channel) == EPWM_DTCR_BYPASSA_Msk << channel);
}

/**
  * @brief    失能死区Bypass
  * @rmtoll   DTCR    BYPASSA    FL_EPWM_DisableDeadbandBypass
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableDeadbandBypass(EPWM_Type *EPWMx, uint32_t channel)
{
    CLEAR_BIT(EPWMx->DTCR, EPWM_DTCR_BYPASSA_Msk << channel);
}

/**
  * @brief    设置死区上升沿延迟时间
  * @rmtoll   DTDLY    RED    FL_EPWM_WriteDeadbandRisingDelayTime
  * @param    EPWMx EPWM instance
  * @param    time
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WriteDeadbandRisingDelayTime(EPWM_Type *EPWMx, uint32_t time)
{
    MODIFY_REG(EPWMx->DTDLY, (0x3ffU << 16U), (time << 16U));
}

/**
  * @brief    读取死区上升沿延迟时间
  * @rmtoll   DTDLY    RED    FL_EPWM_ReadDeadbandRisingDelayTime
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadDeadbandRisingDelayTime(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->DTDLY, (0x3ffU << 16U)) >> 16U);
}

/**
  * @brief    设置死区下降沿延迟时间
  * @rmtoll   DTDLY    FED    FL_EPWM_WriteDeadbandFallingDelayTime
  * @param    EPWMx EPWM instance
  * @param    time
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WriteDeadbandFallingDelayTime(EPWM_Type *EPWMx, uint32_t time)
{
    MODIFY_REG(EPWMx->DTDLY, (0x3ffU << 0U), (time << 0U));
}

/**
  * @brief    读取死区下降沿延迟时间
  * @rmtoll   DTDLY    FED    FL_EPWM_ReadDeadbandFallingDelayTime
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadDeadbandFallingDelayTime(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->DTDLY, (0x3ffU << 0U)) >> 0U);
}

/**
  * @brief    设置Chopper载波高电平宽度
  * @rmtoll   CPCR    CHPHW    FL_EPWM_WriteChopperCarrierHighWidth
  * @param    EPWMx EPWM instance
  * @param    width
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WriteChopperCarrierHighWidth(EPWM_Type *EPWMx, uint32_t width)
{
    MODIFY_REG(EPWMx->CPCR, (0x3fU << 16U), (width << 16U));
}

/**
  * @brief    读取Chopper载波高电平宽度
  * @rmtoll   CPCR    CHPHW    FL_EPWM_ReadChopperCarrierHighWidth
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadChopperCarrierHighWidth(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->CPCR, (0x3fU << 16U)) >> 16U);
}

/**
  * @brief    设置Chopper载波低电平宽度
  * @rmtoll   CPCR    CHPLW    FL_EPWM_WriteChopperCarrierLowWidth
  * @param    EPWMx EPWM instance
  * @param    width
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WriteChopperCarrierLowWidth(EPWM_Type *EPWMx, uint32_t width)
{
    MODIFY_REG(EPWMx->CPCR, (0x3fU << 8U), (width << 8U));
}

/**
  * @brief    读取Chopper载波低电平宽度
  * @rmtoll   CPCR    CHPLW    FL_EPWM_ReadChopperCarrierLowWidth
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadChopperCarrierLowWidth(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->CPCR, (0x3fU << 8U)) >> 8U);
}

/**
  * @brief    设置单脉冲宽度
  * @rmtoll   CPCR    OSPW    FL_EPWM_WriteOneShotPulseWidth
  * @param    EPWMx EPWM instance
  * @param    width
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WriteOneShotPulseWidth(EPWM_Type *EPWMx, uint32_t width)
{
    MODIFY_REG(EPWMx->CPCR, (0xfU << 4U), ((width & 0xfU) << 4U));
}

/**
  * @brief    读取单脉冲宽度
  * @rmtoll   CPCR    OSPW    FL_EPWM_ReadOneShotPulseWidth
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadOneShotPulseWidth(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->CPCR, (0xfU << 4U)) >> 4U);
}

/**
  * @brief    使能单脉冲
  * @rmtoll   CPCR    OSPEN    FL_EPWM_EnableOneShotPulse
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableOneShotPulse(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->CPCR, EPWM_CPCR_OSPEN_Msk);
}

/**
  * @brief    读取单脉冲使能状态
  * @rmtoll   CPCR    OSPEN    FL_EPWM_IsEnabledOneShotPulse
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledOneShotPulse(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->CPCR, EPWM_CPCR_OSPEN_Msk) == EPWM_CPCR_OSPEN_Msk);
}

/**
  * @brief    失能单脉冲
  * @rmtoll   CPCR    OSPEN    FL_EPWM_DisableOneShotPulse
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableOneShotPulse(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->CPCR, EPWM_CPCR_OSPEN_Msk);
}

/**
  * @brief    使能Chopper
  * @rmtoll   CPCR    CHPENA    FL_EPWM_EnableChopper
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableChopper(EPWM_Type *EPWMx, uint32_t channel)
{
    SET_BIT(EPWMx->CPCR, EPWM_CPCR_CHPENA_Msk << channel);
}

/**
  * @brief    读取Chopper使能状态
  * @rmtoll   CPCR    CHPENA    FL_EPWM_IsEnabledChopper
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledChopper(EPWM_Type *EPWMx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(EPWMx->CPCR, EPWM_CPCR_CHPENA_Msk << channel) == EPWM_CPCR_CHPENA_Msk << channel);
}

