waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epwm.h
/**
  * @brief    失能Chopper
  * @rmtoll   CPCR    CHPENA    FL_EPWM_DisableChopper
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableChopper(EPWM_Type *EPWMx, uint32_t channel)
{
    CLEAR_BIT(EPWMx->CPCR, EPWM_CPCR_CHPENA_Msk << channel);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCBEVT2_TZEN    FL_EPWM_BK_EnableDigitalCompareOutputBEvent2
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_EnableDigitalCompareOutputBEvent2(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCBEVT2_TZEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCBEVT2_TZEN    FL_EPWM_BK_IsEnabledDigitalCompareOutputBEvent2
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_BK_IsEnabledDigitalCompareOutputBEvent2(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCBEVT2_TZEN_Msk) == EPWM_BKCFR_DCBEVT2_TZEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCBEVT2_TZEN    FL_EPWM_BK_DisableDigitalCompareOutputBEvent2
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_DisableDigitalCompareOutputBEvent2(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCBEVT2_TZEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCBEVT1_TZEN    FL_EPWM_BK_EnableDigitalCompareOutputBEvent1
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_EnableDigitalCompareOutputBEvent1(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCBEVT1_TZEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCBEVT1_TZEN    FL_EPWM_BK_IsEnabledDigitalCompareOutputBEvent1
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_BK_IsEnabledDigitalCompareOutputBEvent1(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCBEVT1_TZEN_Msk) == EPWM_BKCFR_DCBEVT1_TZEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCBEVT1_TZEN    FL_EPWM_BK_DisableDigitalCompareOutputBEvent1
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_DisableDigitalCompareOutputBEvent1(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCBEVT1_TZEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCAEVT2_TZEN    FL_EPWM_BK_EnableDigitalCompareOutputAEvent2
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_EnableDigitalCompareOutputAEvent2(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCAEVT2_TZEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCAEVT2_TZEN    FL_EPWM_BK_IsEnabledDigitalCompareOutputAEvent2
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_BK_IsEnabledDigitalCompareOutputAEvent2(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCAEVT2_TZEN_Msk) == EPWM_BKCFR_DCAEVT2_TZEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCAEVT2_TZEN    FL_EPWM_BK_DisableDigitalCompareOutputAEvent2
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_DisableDigitalCompareOutputAEvent2(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCAEVT2_TZEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCAEVT1_TZEN    FL_EPWM_BK_EnableDigitalCompareOutputAEvent1
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_EnableDigitalCompareOutputAEvent1(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCAEVT1_TZEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCAEVT1_TZEN    FL_EPWM_BK_IsEnabledDigitalCompareOutputAEvent1
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_BK_IsEnabledDigitalCompareOutputAEvent1(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCAEVT1_TZEN_Msk) == EPWM_BKCFR_DCAEVT1_TZEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCAEVT1_TZEN    FL_EPWM_BK_DisableDigitalCompareOutputAEvent1
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_DisableDigitalCompareOutputAEvent1(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCAEVT1_TZEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCBEVT1_OSTEN    FL_EPWM_BK_EnableDigitalCompareOutputBEvent1_OneShot
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_EnableDigitalCompareOutputBEvent1_OneShot(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCBEVT1_OSTEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCBEVT1_OSTEN    FL_EPWM_BK_IsEnabledDigitalCompareOutputBEvent1_OneShot
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_BK_IsEnabledDigitalCompareOutputBEvent1_OneShot(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCBEVT1_OSTEN_Msk) == EPWM_BKCFR_DCBEVT1_OSTEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCBEVT1_OSTEN    FL_EPWM_BK_DisableDigitalCompareOutputBEvent1_OneShot
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_DisableDigitalCompareOutputBEvent1_OneShot(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCBEVT1_OSTEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCAEVT1_OSTEN    FL_EPWM_BK_EnableDigitalCompareOutputAEvent1_OneShot
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_EnableDigitalCompareOutputAEvent1_OneShot(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCAEVT1_OSTEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCAEVT1_OSTEN    FL_EPWM_BK_IsEnabledDigitalCompareOutputAEvent1_OneShot
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_BK_IsEnabledDigitalCompareOutputAEvent1_OneShot(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCAEVT1_OSTEN_Msk) == EPWM_BKCFR_DCAEVT1_OSTEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCAEVT1_OSTEN    FL_EPWM_BK_DisableDigitalCompareOutputAEvent1_OneShot
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_DisableDigitalCompareOutputAEvent1_OneShot(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCAEVT1_OSTEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    OSTEN    FL_EPWM_BK_EnableOneShotMode
  * @param    EPWMx EPWM instance
  * @param    breakchannel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_BKCHANNEL_1
  *           @arg @ref FL_EPWM_BKCHANNEL_2
  *           @arg @ref FL_EPWM_BKCHANNEL_3
  *           @arg @ref FL_EPWM_BKCHANNEL_4
  *           @arg @ref FL_EPWM_BKCHANNEL_5
  *           @arg @ref FL_EPWM_BKCHANNEL_6
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_EnableOneShotMode(EPWM_Type *EPWMx, uint32_t breakchannel)
{
    SET_BIT(EPWMx->BKCFR, EPWM_BKCFR_OSTEN_Msk << breakchannel);
}

/**
  * @brief
  * @rmtoll   BKCFR    OSTEN    FL_EPWM_BK_IsEnabledOneShotMode
  * @param    EPWMx EPWM instance
  * @param    breakchannel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_BKCHANNEL_1
  *           @arg @ref FL_EPWM_BKCHANNEL_2
  *           @arg @ref FL_EPWM_BKCHANNEL_3
  *           @arg @ref FL_EPWM_BKCHANNEL_4
  *           @arg @ref FL_EPWM_BKCHANNEL_5
  *           @arg @ref FL_EPWM_BKCHANNEL_6
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_BK_IsEnabledOneShotMode(EPWM_Type *EPWMx, uint32_t breakchannel)
{
    return (uint32_t)(READ_BIT(EPWMx->BKCFR, EPWM_BKCFR_OSTEN_Msk << breakchannel) == EPWM_BKCFR_OSTEN_Msk << breakchannel);
}

/**
  * @brief
  * @rmtoll   BKCFR    OSTEN    FL_EPWM_BK_DisableOneShotMode
  * @param    EPWMx EPWM instance
  * @param    breakchannel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_BKCHANNEL_1
  *           @arg @ref FL_EPWM_BKCHANNEL_2
  *           @arg @ref FL_EPWM_BKCHANNEL_3
  *           @arg @ref FL_EPWM_BKCHANNEL_4
  *           @arg @ref FL_EPWM_BKCHANNEL_5
  *           @arg @ref FL_EPWM_BKCHANNEL_6
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_DisableOneShotMode(EPWM_Type *EPWMx, uint32_t breakchannel)
{
    CLEAR_BIT(EPWMx->BKCFR, EPWM_BKCFR_OSTEN_Msk << breakchannel);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCBEVT2_CBCEN    FL_EPWM_BK_EnableDigitalCompareOutputBEvent2_CycleByCycle
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_EnableDigitalCompareOutputBEvent2_CycleByCycle(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCBEVT2_CBCEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCBEVT2_CBCEN    FL_EPWM_BK_IsEnabledDigitalCompareOutputBEvent2_CycleByCycle
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_BK_IsEnabledDigitalCompareOutputBEvent2_CycleByCycle(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCBEVT2_CBCEN_Msk) == EPWM_BKCFR_DCBEVT2_CBCEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCBEVT2_CBCEN    FL_EPWM_BK_DisableDigitalCompareOutputBEvent2_CycleByCycle
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_DisableDigitalCompareOutputBEvent2_CycleByCycle(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCBEVT2_CBCEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCAEVT2_CBCEN    FL_EPWM_BK_EnableDigitalCompareOutputAEvent1_CycleByCycle
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_EnableDigitalCompareOutputAEvent1_CycleByCycle(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCAEVT2_CBCEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCAEVT2_CBCEN    FL_EPWM_BK_IsEnabledDigitalCompareOutputAEvent2_CycleByCycle
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_BK_IsEnabledDigitalCompareOutputAEvent2_CycleByCycle(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCAEVT2_CBCEN_Msk) == EPWM_BKCFR_DCAEVT2_CBCEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    DCAEVT2_CBCEN    FL_EPWM_BK_DisableDigitalCompareOutputAEvent2_CycleByCycle
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_DisableDigitalCompareOutputAEvent2_CycleByCycle(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->BKCFR, EPWM_BKCFR_DCAEVT2_CBCEN_Msk);
}

/**
  * @brief
  * @rmtoll   BKCFR    CBCEN    FL_EPWM_BK_EnableCycleByCycleMode
  * @param    EPWMx EPWM instance
  * @param    breakchannel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_EnableCycleByCycleMode(EPWM_Type *EPWMx, uint32_t breakchannel)
{
    SET_BIT(EPWMx->BKCFR, EPWM_BKCFR_CBCEN_Msk << breakchannel);
}

/**
  * @brief
  * @rmtoll   BKCFR    CBCEN    FL_EPWM_BK_IsEnabledCycleByCycleMode
  * @param    EPWMx EPWM instance
  * @param    breakchannel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_BK_IsEnabledCycleByCycleMode(EPWM_Type *EPWMx, uint32_t breakchannel)
{
    return (uint32_t)(READ_BIT(EPWMx->BKCFR, EPWM_BKCFR_CBCEN_Msk << breakchannel) == EPWM_BKCFR_CBCEN_Msk << breakchannel);
}

/**
  * @brief
  * @rmtoll   BKCFR    CBCEN    FL_EPWM_BK_DisableCycleByCycleMode
  * @param    EPWMx EPWM instance
  * @param    breakchannel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_DisableCycleByCycleMode(EPWM_Type *EPWMx, uint32_t breakchannel)
{
    CLEAR_BIT(EPWMx->BKCFR, EPWM_BKCFR_CBCEN_Msk << breakchannel);
}

/**
  * @brief
  * @rmtoll   BKCR    DCBEVT2    FL_EPWM_BK_SetOutputBmode_DCBEVT2
  * @param    EPWMx EPWM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_OUTPUT_HIGH_IMPEDANCE
  *           @arg @ref FL_EPWM_OUTPUT_HIGH
  *           @arg @ref FL_EPWM_OUTPUT_LOW
  *           @arg @ref FL_EPWM_OUTPUT_FROZEN
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_SetOutputBmode_DCBEVT2(EPWM_Type *EPWMx, uint32_t mode)
{
    MODIFY_REG(EPWMx->BKCR, EPWM_BKCR_DCBEVT2_Msk, mode << EPWM_BKCR_DCBEVT2_Pos);
}

/**
  * @brief
  * @rmtoll   BKCR    DCBEVT2    FL_EPWM_BK_GetOutputBmode_DCBEVT2
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_OUTPUT_HIGH_IMPEDANCE
  *           @arg @ref FL_EPWM_OUTPUT_HIGH
  *           @arg @ref FL_EPWM_OUTPUT_LOW
  *           @arg @ref FL_EPWM_OUTPUT_FROZEN
  */
__STATIC_INLINE uint32_t FL_EPWM_BK_GetOutputBmode_DCBEVT2(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKCR, EPWM_BKCR_DCBEVT2_Msk));
}

/**
  * @brief
  * @rmtoll   BKCR    DCBEVT1    FL_EPWM_BK_SetOutputBmode_DCBEVT1
  * @param    EPWMx EPWM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_OUTPUT_HIGH_IMPEDANCE
  *           @arg @ref FL_EPWM_OUTPUT_HIGH
  *           @arg @ref FL_EPWM_OUTPUT_LOW
  *           @arg @ref FL_EPWM_OUTPUT_FROZEN
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_SetOutputBmode_DCBEVT1(EPWM_Type *EPWMx, uint32_t mode)
{
    MODIFY_REG(EPWMx->BKCR, EPWM_BKCR_DCBEVT1_Msk, mode << EPWM_BKCR_DCBEVT1_Pos);
}

/**
  * @brief
  * @rmtoll   BKCR    DCBEVT1    FL_EPWM_BK_GetOutputBmode_DCBEVT1
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_OUTPUT_HIGH_IMPEDANCE
  *           @arg @ref FL_EPWM_OUTPUT_HIGH
  *           @arg @ref FL_EPWM_OUTPUT_LOW
  *           @arg @ref FL_EPWM_OUTPUT_FROZEN
  */
__STATIC_INLINE uint32_t FL_EPWM_BK_GetOutputBmode_DCBEVT1(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKCR, EPWM_BKCR_DCBEVT1_Msk));
}

/**
  * @brief
  * @rmtoll   BKCR    DCAEVT2    FL_EPWM_BK_SetOutputBmode_DCBEVT2
  * @param    EPWMx EPWM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_OUTPUT_HIGH_IMPEDANCE
  *           @arg @ref FL_EPWM_OUTPUT_HIGH
  *           @arg @ref FL_EPWM_OUTPUT_LOW
  *           @arg @ref FL_EPWM_OUTPUT_FROZEN
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_SetOutputBmode_DCAEVT2(EPWM_Type *EPWMx, uint32_t mode)
{
    MODIFY_REG(EPWMx->BKCR, EPWM_BKCR_DCAEVT2_Msk, mode << EPWM_BKCR_DCAEVT2_Pos);
}

/**
  * @brief
  * @rmtoll   BKCR    DCAEVT2    FL_EPWM_BK_GetOutputBmode_DCBEVT2
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_OUTPUT_HIGH_IMPEDANCE
  *           @arg @ref FL_EPWM_OUTPUT_HIGH
  *           @arg @ref FL_EPWM_OUTPUT_LOW
  *           @arg @ref FL_EPWM_OUTPUT_FROZEN
  */
__STATIC_INLINE uint32_t FL_EPWM_BK_GetOutputBmode_DCAEVT2(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKCR, EPWM_BKCR_DCAEVT2_Msk));
}

/**
  * @brief
  * @rmtoll   BKCR    DCAEVT1    FL_EPWM_BK_SetOutputBmode_DCBEVT1
  * @param    EPWMx EPWM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_OUTPUT_HIGH_IMPEDANCE
  *           @arg @ref FL_EPWM_OUTPUT_HIGH
  *           @arg @ref FL_EPWM_OUTPUT_LOW
  *           @arg @ref FL_EPWM_OUTPUT_FROZEN
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_SetOutputBmode_DCAEVT1(EPWM_Type *EPWMx, uint32_t mode)
{
    MODIFY_REG(EPWMx->BKCR, EPWM_BKCR_DCAEVT1_Msk, mode << EPWM_BKCR_DCAEVT1_Pos);
}

/**
  * @brief
  * @rmtoll   BKCR    DCAEVT1    FL_EPWM_BK_GetOutputBmode_DCBEVT1
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_OUTPUT_HIGH_IMPEDANCE
  *           @arg @ref FL_EPWM_OUTPUT_HIGH
  *           @arg @ref FL_EPWM_OUTPUT_LOW
  *           @arg @ref FL_EPWM_OUTPUT_FROZEN
  */
__STATIC_INLINE uint32_t FL_EPWM_BK_GetOutputBmode_DCAEVT1(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKCR, EPWM_BKCR_DCAEVT1_Msk));
}

/**
  * @brief
  * @rmtoll   BKCR    TZA    FL_EPWM_BK_SetOutputBmode_CBCOST
  * @param    EPWMx EPWM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_OUTPUT_HIGH_IMPEDANCE
  *           @arg @ref FL_EPWM_OUTPUT_HIGH
  *           @arg @ref FL_EPWM_OUTPUT_LOW
  *           @arg @ref FL_EPWM_OUTPUT_FROZEN
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_BK_SetOutputBmode_CBCOST(EPWM_Type *EPWMx, uint32_t mode, uint32_t channel)
{
    MODIFY_REG(EPWMx->BKCR, EPWM_BKCR_TZA_Msk << channel, mode << channel);
}

/**
  * @brief
  * @rmtoll   BKCR    TZA    FL_EPWM_BK_GetOutputBmode_CBCOST
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_OUTPUT_HIGH_IMPEDANCE
  *           @arg @ref FL_EPWM_OUTPUT_HIGH
  *           @arg @ref FL_EPWM_OUTPUT_LOW
  *           @arg @ref FL_EPWM_OUTPUT_FROZEN
  */
__STATIC_INLINE uint32_t FL_EPWM_BK_GetOutputBmode_CBCOST(EPWM_Type *EPWMx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(EPWMx->BKCR, EPWM_BKCR_TZA_Msk << channel));
}

/**
  * @brief
  * @rmtoll   BKIER    DCBEVT2IE    FL_EPWM_EnableIT_DCBEVT2
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableIT_DCBEVT2(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKIER, EPWM_BKIER_DCBEVT2IE_Msk);
}

/**
  * @brief
  * @rmtoll   BKIER    DCBEVT2IE    FL_EPWM_IsEnabledIT_DCBEVT2
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledIT_DCBEVT2(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKIER, EPWM_BKIER_DCBEVT2IE_Msk) == EPWM_BKIER_DCBEVT2IE_Msk);
}

/**
  * @brief
  * @rmtoll   BKIER    DCBEVT2IE    FL_EPWM_DisableIT_DCBEVT2
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableIT_DCBEVT2(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->BKIER, EPWM_BKIER_DCBEVT2IE_Msk);
}

/**
  * @brief
  * @rmtoll   BKIER    DCBEVT1IE    FL_EPWM_EnableIT_DCBEVT1
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableIT_DCBEVT1(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKIER, EPWM_BKIER_DCBEVT1IE_Msk);
}

/**
  * @brief
  * @rmtoll   BKIER    DCBEVT1IE    FL_EPWM_IsEnabledIT_DCBEVT1
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledIT_DCBEVT1(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKIER, EPWM_BKIER_DCBEVT1IE_Msk) == EPWM_BKIER_DCBEVT1IE_Msk);
}

/**
  * @brief
  * @rmtoll   BKIER    DCBEVT1IE    FL_EPWM_DisableIT_DCBEVT1
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableIT_DCBEVT1(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->BKIER, EPWM_BKIER_DCBEVT1IE_Msk);
}

/**
  * @brief
  * @rmtoll   BKIER    DCAEVT2IE    FL_EPWM_EnableIT_DCAEVT2
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableIT_DCAEVT2(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKIER, EPWM_BKIER_DCAEVT2IE_Msk);
}

/**
  * @brief
  * @rmtoll   BKIER    DCAEVT2IE    FL_EPWM_IsEnabledIT_DCAEVT2
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledIT_DCAEVT2(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKIER, EPWM_BKIER_DCAEVT2IE_Msk) == EPWM_BKIER_DCAEVT2IE_Msk);
}

/**
  * @brief
  * @rmtoll   BKIER    DCAEVT2IE    FL_EPWM_DisableIT_DCAEVT2
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableIT_DCAEVT2(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->BKIER, EPWM_BKIER_DCAEVT2IE_Msk);
}

/**
  * @brief
  * @rmtoll   BKIER    DCAEVT1IE    FL_EPWM_EnableIT_DCAEVT1
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableIT_DCAEVT1(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKIER, EPWM_BKIER_DCAEVT1IE_Msk);
}

/**
  * @brief
  * @rmtoll   BKIER    DCAEVT1IE    FL_EPWM_IsEnabledIT_DCAEVT1
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledIT_DCAEVT1(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKIER, EPWM_BKIER_DCAEVT1IE_Msk) == EPWM_BKIER_DCAEVT1IE_Msk);
}

/**
  * @brief
  * @rmtoll   BKIER    DCAEVT1IE    FL_EPWM_DisableIT_DCAEVT1
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableIT_DCAEVT1(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->BKIER, EPWM_BKIER_DCAEVT1IE_Msk);
}

/**
  * @brief
  * @rmtoll   BKIER    OSTIE    FL_EPWM_EnableIT_OneShot
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableIT_OneShot(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKIER, EPWM_BKIER_OSTIE_Msk);
}

/**
  * @brief
  * @rmtoll   BKIER    OSTIE    FL_EPWM_IsEnabledIT_OneShot
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledIT_OneShot(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKIER, EPWM_BKIER_OSTIE_Msk) == EPWM_BKIER_OSTIE_Msk);
}

/**
  * @brief
  * @rmtoll   BKIER    OSTIE    FL_EPWM_DisableIT_OneShot
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableIT_OneShot(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->BKIER, EPWM_BKIER_OSTIE_Msk);
}

/**
  * @brief
  * @rmtoll   BKIER    CBCIE    FL_EPWM_EnableIT_CycleByCycle
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableIT_CycleByCycle(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKIER, EPWM_BKIER_CBCIE_Msk);
}

/**
  * @brief
  * @rmtoll   BKIER    CBCIE    FL_EPWM_IsEnabledIT_CycleByCycle
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledIT_CycleByCycle(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKIER, EPWM_BKIER_CBCIE_Msk) == EPWM_BKIER_CBCIE_Msk);
}

/**
  * @brief
  * @rmtoll   BKIER    CBCIE    FL_EPWM_DisableIT_CycleByCycle
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableIT_CycleByCycle(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->BKIER, EPWM_BKIER_CBCIE_Msk);
}

/**
  * @brief
  * @rmtoll   BKISR    OST_DCBEVT1    FL_EPWM_IsActiveFlag_BreakLockByDCBEVT1
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_BreakLockByDCBEVT1(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_OST_DCBEVT1_Msk) == (EPWM_BKISR_OST_DCBEVT1_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    OST_DCAEVT1    FL_EPWM_IsActiveFlag_BreakLockByDCAEVT1
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_BreakLockByDCAEVT1(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_OST_DCAEVT1_Msk) == (EPWM_BKISR_OST_DCAEVT1_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    OST6    FL_EPWM_IsActiveFlag_BreakLockByOST6
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_BreakLockByOST6(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_OST6_Msk) == (EPWM_BKISR_OST6_Msk));
}

