waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epwm.h
/**
  * @brief
  * @rmtoll   BKISR    OST5    FL_EPWM_IsActiveFlag_BreakLockByOST5
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_BreakLockByOST5(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_OST5_Msk) == (EPWM_BKISR_OST5_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    OST4    FL_EPWM_IsActiveFlag_BreakLockByOST4
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_BreakLockByOST4(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_OST4_Msk) == (EPWM_BKISR_OST4_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    OST3    FL_EPWM_IsActiveFlag_BreakLockByOST3
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_BreakLockByOST3(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_OST3_Msk) == (EPWM_BKISR_OST3_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    OST2    FL_EPWM_IsActiveFlag_BreakLockByOST2
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_BreakLockByOST2(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_OST2_Msk) == (EPWM_BKISR_OST2_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    OST1    FL_EPWM_IsActiveFlag_BreakLockByOST1
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_BreakLockByOST1(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_OST1_Msk) == (EPWM_BKISR_OST1_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    CBC_DCBEVT2    FL_EPWM_IsActiveFlag_BreakLockByDCBEVT2
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_BreakLockByDCBEVT2(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_CBC_DCBEVT2_Msk) == (EPWM_BKISR_CBC_DCBEVT2_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    CBC_DCAEVT2    FL_EPWM_IsActiveFlag_BreakLockByDCAEVT2
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_BreakLockByDCAEVT2(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_CBC_DCAEVT2_Msk) == (EPWM_BKISR_CBC_DCAEVT2_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    CBC6    FL_EPWM_IsActiveFlag_BreakLockByCBC6
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_BreakLockByCBC6(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_CBC6_Msk) == (EPWM_BKISR_CBC6_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    CBC5    FL_EPWM_IsActiveFlag_BreakLockByCBC5
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_BreakLockByCBC5(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_CBC5_Msk) == (EPWM_BKISR_CBC5_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    CBC4    FL_EPWM_IsActiveFlag_BreakLockByCBC4
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_BreakLockByCBC4(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_CBC4_Msk) == (EPWM_BKISR_CBC4_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    CBC3    FL_EPWM_IsActiveFlag_BreakLockByCBC3
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_BreakLockByCBC3(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_CBC3_Msk) == (EPWM_BKISR_CBC3_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    CBC2    FL_EPWM_IsActiveFlag_BreakLockByCBC2
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_BreakLockByCBC2(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_CBC2_Msk) == (EPWM_BKISR_CBC2_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    CBC1    FL_EPWM_IsActiveFlag_BreakLockByCBC1
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_BreakLockByCBC1(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_CBC1_Msk) == (EPWM_BKISR_CBC1_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    DCBEVT2IF    FL_EPWM_IsActiveFlag_DCBEVT2
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_DCBEVT2(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_DCBEVT2IF_Msk) == (EPWM_BKISR_DCBEVT2IF_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    DCBEVT2IF    FL_EPWM_ClearFlag_DCBEVT2
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_DCBEVT2(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->BKISR, EPWM_BKISR_DCBEVT2IF_Msk);
}

/**
  * @brief
  * @rmtoll   BKISR    DCBEVT1IF    FL_EPWM_IsActiveFlag_DCBEVT1
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_DCBEVT1(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_DCBEVT1IF_Msk) == (EPWM_BKISR_DCBEVT1IF_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    DCBEVT1IF    FL_EPWM_ClearFlag_DCBEVT1
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_DCBEVT1(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->BKISR, EPWM_BKISR_DCBEVT1IF_Msk);
}

/**
  * @brief
  * @rmtoll   BKISR    DCAEVT2IF    FL_EPWM_IsActiveFlag_DCAEVT2
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_DCAEVT2(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_DCAEVT2IF_Msk) == (EPWM_BKISR_DCAEVT2IF_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    DCAEVT2IF    FL_EPWM_ClearFlag_DCAEVT2
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_DCAEVT2(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->BKISR, EPWM_BKISR_DCAEVT2IF_Msk);
}

/**
  * @brief
  * @rmtoll   BKISR    DCAEVT1IF    FL_EPWM_IsActiveFlag_DCAEVT1
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_DCAEVT1(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_DCAEVT1IF_Msk) == (EPWM_BKISR_DCAEVT1IF_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    DCAEVT1IF    FL_EPWM_ClearFlag_DCAEVT1
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_DCAEVT1(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->BKISR, EPWM_BKISR_DCAEVT1IF_Msk);
}

/**
  * @brief
  * @rmtoll   BKISR    OSTIF    FL_EPWM_IsActiveFlag_OneShot
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_OneShot(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_OSTIF_Msk) == (EPWM_BKISR_OSTIF_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    OSTIF    FL_EPWM_ClearFlag_OneShot
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_OneShot(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->BKISR, EPWM_BKISR_OSTIF_Msk);
}

/**
  * @brief
  * @rmtoll   BKISR    CBCIF    FL_EPWM_IsActiveFlag_CycleByCycle
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_CycleByCycle(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->BKISR, EPWM_BKISR_CBCIF_Msk) == (EPWM_BKISR_CBCIF_Msk));
}

/**
  * @brief
  * @rmtoll   BKISR    CBCIF    FL_EPWM_ClearFlag_OneShot
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_CycleByCycle(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->BKISR, EPWM_BKISR_CBCIF_Msk);
}

/**
  * @brief
  * @rmtoll   BKCLR    DCBEVT2C    FL_EPWM_ClearFlag_BreakLockByDCBEVT2
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_BreakLockByDCBEVT2(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->BKCLR, EPWM_BKCLR_DCBEVT2C_Msk);
}

/**
  * @brief
  * @rmtoll   BKCLR    DCBEVT1C    FL_EPWM_ClearFlag_BreakLockByDCBEVT1
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_BreakLockByDCBEVT1(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->BKCLR, EPWM_BKCLR_DCBEVT1C_Msk);
}

/**
  * @brief
  * @rmtoll   BKCLR    DCAEVT2C    FL_EPWM_ClearFlag_BreakLockByDCAEVT2
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_BreakLockByDCAEVT2(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->BKCLR, EPWM_BKCLR_DCAEVT2C_Msk);
}

/**
  * @brief
  * @rmtoll   BKCLR    DCAEVT1C    FL_EPWM_ClearFlag_BreakLockByDCAEVT1
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_BreakLockByDCAEVT1(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->BKCLR, EPWM_BKCLR_DCAEVT1C_Msk);
}

/**
  * @brief
  * @rmtoll   BKCLR    OSTC    FL_EPWM_ClearFlag_BreakLockByOneShot
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_BreakLockByOneShot(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->BKCLR, EPWM_BKCLR_OSTC_Msk);
}

/**
  * @brief
  * @rmtoll   BKCLR    CBCC    FL_EPWM_ClearFlag_BreakLockByCycleByCycle
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_BreakLockByCycleByCycle(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->BKCLR, EPWM_BKCLR_CBCC_Msk);
}

/**
  * @brief
  * @rmtoll   BKSFR    DCBEVT2SF    FL_EPWM_GenerateDCBEVT2BreakEvent
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_GenerateDCBEVT2BreakEvent(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKSFR, EPWM_BKSFR_DCBEVT2SF_Msk);
}

/**
  * @brief
  * @rmtoll   BKSFR    DCBEVT1SF    FL_EPWM_GenerateDCBEVT1BreakEvent
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_GenerateDCBEVT1BreakEvent(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKSFR, EPWM_BKSFR_DCBEVT1SF_Msk);
}

/**
  * @brief
  * @rmtoll   BKSFR    DCAEVT2SF    FL_EPWM_GenerateDCAEVT2BreakEvent
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_GenerateDCAEVT2BreakEvent(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKSFR, EPWM_BKSFR_DCAEVT2SF_Msk);
}

/**
  * @brief
  * @rmtoll   BKSFR    DCAEVT1SF    FL_EPWM_GenerateDCAEVT1BreakEvent
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_GenerateDCAEVT1BreakEvent(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKSFR, EPWM_BKSFR_DCAEVT1SF_Msk);
}

/**
  * @brief
  * @rmtoll   BKSFR    OSTSF    FL_EPWM_GenerateOneShotBreakEvent
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_GenerateOneShotBreakEvent(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKSFR, EPWM_BKSFR_OSTSF_Msk);
}

/**
  * @brief
  * @rmtoll   BKSFR    CBCSF    FL_EPWM_GenerateCycleByCycleBreakEvent
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_GenerateCycleByCycleBreakEvent(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->BKSFR, EPWM_BKSFR_CBCSF_Msk);
}

/**
  * @brief
  * @rmtoll   DCINSR    DCBEVT1CFG    FL_EPWM_SetBreakEventActive
  * @param    EPWMx EPWM instance
  * @param    config This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DISABLE
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCH_LOW
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCH_HIGH
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCL_LOW
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCL_HIGH
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCH_LOWANDDCL_HIGH
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCH_HIGHANDDCL_LOW
  * @param    event This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_DC_EVENT_1
  *           @arg @ref FL_EPWM_DC_EVENT_2
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetDCBBreakEvent(EPWM_Type *EPWMx, uint32_t config, uint32_t event)
{
    MODIFY_REG(EPWMx->DCINSR, EPWM_DCINSR_DCAEVT1CFG_Msk << event, (config << EPWM_DCINSR_DCBEVT1CFG_Pos) << event);
}

/**
  * @brief
  * @rmtoll   DCINSR    DCBEVT1CFG    FL_EPWM_GetBreakEventActive
  * @param    EPWMx EPWM instance
  * @param    config This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DISABLE
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCH_LOW
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCH_HIGH
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCL_LOW
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCL_HIGH
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCH_LOWANDDCL_HIGH
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCH_HIGHANDDCL_LOW
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_DC_EVENT_1
  *           @arg @ref FL_EPWM_DC_EVENT_2

  */
__STATIC_INLINE uint32_t FL_EPWM_GetDCBBreakEvent(EPWM_Type *EPWMx, uint32_t event)
{
    return (uint32_t)(READ_BIT(EPWMx->DCINSR, EPWM_DCINSR_DCAEVT1CFG_Msk << event));
}

/**
  * @brief
  * @rmtoll   DCINSR    DCAEVT1CFG    FL_EPWM_SetBreakEventActive
  * @param    EPWMx EPWM instance
  * @param    config This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DISABLE
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCH_LOW
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCH_HIGH
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCL_LOW
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCL_HIGH
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCH_LOWANDDCL_HIGH
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCH_HIGHANDDCL_LOW
  * @param    event This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_DC_EVENT_1
  *           @arg @ref FL_EPWM_DC_EVENT_2
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetDCABreakEvent(EPWM_Type *EPWMx, uint32_t config, uint32_t event)
{
    MODIFY_REG(EPWMx->DCINSR, EPWM_DCINSR_DCAEVT1CFG_Msk << event, config << EPWM_DCINSR_DCAEVT1CFG_Pos << event);
}

/**
  * @brief
  * @rmtoll   DCINSR    DCAEVT1CFG    FL_EPWM_GetBreakEventActive
  * @param    EPWMx EPWM instance
  * @param    config This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DISABLE
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCH_LOW
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCH_HIGH
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCL_LOW
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCL_HIGH
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCH_LOWANDDCL_HIGH
  *           @arg @ref FL_EPWM_DIGITAL_COMPARE_DCH_HIGHANDDCL_LOW
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_DC_EVENT_1
  *           @arg @ref FL_EPWM_DC_EVENT_2
  */
__STATIC_INLINE uint32_t FL_EPWM_GetDCABreakEvent(EPWM_Type *EPWMx, uint32_t event)
{
    return (uint32_t)(READ_BIT(EPWMx->DCINSR, EPWM_DCINSR_DCAEVT1CFG_Msk));
}

/**
  * @brief
  * @rmtoll   DCINSR    DCALSEL    FL_EPWM_SetDCLInputSource
  * @param    EPWMx EPWM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK1
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK2
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK3
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP1OUT
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP2OUT
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP3OUT

  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetDCALInputSource(EPWM_Type *EPWMx, uint32_t source)
{
    MODIFY_REG(EPWMx->DCINSR, EPWM_DCINSR_DCALSEL_Msk, source << EPWM_DCINSR_DCALSEL_Pos);
}

/**
  * @brief
  * @rmtoll   DCINSR    DCALSEL    FL_EPWM_GetDCLInputSource
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK1
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK2
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK3
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP1OUT
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP2OUT
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP3OUT
  */
__STATIC_INLINE uint32_t FL_EPWM_GetDCALInputSource(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->DCINSR, EPWM_DCINSR_DCALSEL_Msk));
}

/**
  * @brief
  * @rmtoll   DCINSR    DCAHSEL    FL_EPWM_SetDCHInputSource
  * @param    EPWMx EPWM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK1
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK2
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK3
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP1OUT
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP2OUT
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP3OUT
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetDCAHInputSource(EPWM_Type *EPWMx, uint32_t source)
{
    MODIFY_REG(EPWMx->DCINSR, EPWM_DCINSR_DCAHSEL_Msk, source << EPWM_DCINSR_DCAHSEL_Pos);
}

/**
  * @brief
  * @rmtoll   DCINSR    DCAHSEL    FL_EPWM_GetDCHInputSource
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK1
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK2
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK3
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP1OUT
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP2OUT
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP3OUT
  */
__STATIC_INLINE uint32_t FL_EPWM_GetDCAHInputSource(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->DCINSR, EPWM_DCINSR_DCAHSEL_Msk));
}

/**
  * @brief
  * @rmtoll   DCINSR    DCALSEL    FL_EPWM_SetDCLInputSource
  * @param    EPWMx EPWM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK1
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK2
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK3
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP1OUT
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP2OUT
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP3OUT

  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetDCBLInputSource(EPWM_Type *EPWMx, uint32_t source)
{
    MODIFY_REG(EPWMx->DCINSR, EPWM_DCINSR_DCBLSEL_Msk, source << EPWM_DCINSR_DCBLSEL_Pos);
}

/**
  * @brief
  * @rmtoll   DCINSR    DCALSEL    FL_EPWM_GetDCLInputSource
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK1
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK2
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK3
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP1OUT
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP2OUT
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP3OUT
  */
__STATIC_INLINE uint32_t FL_EPWM_GetDCBLInputSource(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->DCINSR, EPWM_DCINSR_DCBLSEL_Msk));
}

/**
  * @brief
  * @rmtoll   DCINSR    DCAHSEL    FL_EPWM_SetDCHInputSource
  * @param    EPWMx EPWM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK1
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK2
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK3
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP1OUT
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP2OUT
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP3OUT
  * @param    channel This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetDCBHInputSource(EPWM_Type *EPWMx, uint32_t source)
{
    MODIFY_REG(EPWMx->DCINSR, EPWM_DCINSR_DCBHSEL_Msk, source << EPWM_DCINSR_DCBHSEL_Pos);
}

/**
  * @brief
  * @rmtoll   DCINSR    DCAHSEL    FL_EPWM_GetDCHInputSource
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK1
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK2
  *           @arg @ref FL_EPWM_INPUT_SOURCE_BK3
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP1OUT
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP2OUT
  *           @arg @ref FL_EPWM_INPUT_SOURCE_COMP3OUT
  */
__STATIC_INLINE uint32_t FL_EPWM_GetDCBHInputSource(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->DCINSR, EPWM_DCINSR_DCBHSEL_Msk));
}

/**
  * @brief
  * @rmtoll   DCCR    DCAEVT2FRCS    FL_EPWM_SetDCEVT2SoftwareSource
  * @param    EPWMx EPWM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_DCEVT2_SOFTWARE_SOUECE_SYNC
  *           @arg @ref FL_EPWM_DCEVT2_SOFTWARE_SOUECE_ASYNC
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetDCEVT2ForceSource(EPWM_Type *EPWMx, uint32_t source, uint32_t channel)
{
    MODIFY_REG(EPWMx->DCCR, EPWM_DCCR_DCAEVT2FRCS_Msk << (channel * 16), source << (channel * 16));
}

/**
  * @brief
  * @rmtoll   DCCR    DCAEVT2FRCS    FL_EPWM_GetDCEVT2SoftwareSource
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_DCEVT2_SOFTWARE_SOUECE_SYNC
  *           @arg @ref FL_EPWM_DCEVT2_SOFTWARE_SOUECE_ASYNC
  */
__STATIC_INLINE uint32_t FL_EPWM_GetDCEVT2ForceSource(EPWM_Type *EPWMx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(EPWMx->DCCR, EPWM_DCCR_DCAEVT2FRCS_Msk << (channel * 16)));
}

/**
  * @brief
  * @rmtoll   DCCR    DCAEVT2SRC    FL_EPWM_SetDCEVT2Source
  * @param    EPWMx EPWM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_DCEVT2_SOUECE_DEEVT2
  *           @arg @ref FL_EPWM_DCEVT2_SOUECE_DCEVTFLT
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetDCEVT2Source(EPWM_Type *EPWMx, uint32_t source, uint32_t channel)
{
    MODIFY_REG(EPWMx->DCCR, EPWM_DCCR_DCAEVT2SRC_Msk << (channel * 16), source << (channel * 16));
}

/**
  * @brief
  * @rmtoll   DCCR    DCAEVT2SRC    FL_EPWM_GetDCEVT2Source
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_DCEVT2_SOUECE_DEEVT2
  *           @arg @ref FL_EPWM_DCEVT2_SOUECE_DCEVTFLT
  */
__STATIC_INLINE uint32_t FL_EPWM_GetDCEVT2Source(EPWM_Type *EPWMx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(EPWMx->DCCR, EPWM_DCCR_DCAEVT2SRC_Msk << (channel * 16)));
}

