waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epwm.h
/**
  * @brief
  * @rmtoll   DCCR    DCAEVT1SYNC    FL_EPWM_EnableDCEVT1SYNCSignalOutput
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableDCEVT1SYNCSignalOutput(EPWM_Type *EPWMx, uint32_t channel)
{
    SET_BIT(EPWMx->DCCR, EPWM_DCCR_DCAEVT1SYNC_Msk << (channel * 16));
}

/**
  * @brief
  * @rmtoll   DCCR    DCAEVT1SYNC    FL_EPWM_IsEnabledDCEVT1SYNCSignalOutput
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledDCEVT1SYNCSignalOutput(EPWM_Type *EPWMx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(EPWMx->DCCR, EPWM_DCCR_DCAEVT1SYNC_Msk << (channel * 16)) == EPWM_DCCR_DCAEVT1SYNC_Msk << (channel * 16));
}

/**
  * @brief
  * @rmtoll   DCCR    DCAEVT1SYNC    FL_EPWM_DisableDCEVT1SYNCSignalOutput
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableDCEVT1SYNCSignalOutput(EPWM_Type *EPWMx, uint32_t channel)
{
    CLEAR_BIT(EPWMx->DCCR, EPWM_DCCR_DCAEVT1SYNC_Msk << (channel * 16));
}

/**
  * @brief
  * @rmtoll   DCCR    DCAEVT1SOC    FL_EPWM_EnableDCEVT1SOCSignalOutput
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableDCEVT1SOCSignalOutput(EPWM_Type *EPWMx, uint32_t channel)
{
    SET_BIT(EPWMx->DCCR, EPWM_DCCR_DCAEVT1SOC_Msk << (channel * 16));
}

/**
  * @brief
  * @rmtoll   DCCR    DCAEVT1SOC    FL_EPWM_IsEnabledDCEVT1SOCSignalOutput
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledDCEVT1SOCSignalOutput(EPWM_Type *EPWMx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(EPWMx->DCCR, EPWM_DCCR_DCAEVT1SOC_Msk << (channel * 16)) == EPWM_DCCR_DCAEVT1SOC_Msk << (channel * 16));
}

/**
  * @brief
  * @rmtoll   DCCR    DCAEVT1SOC    FL_EPWM_DisableDCEVT1SOCSignalOutput
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableDCEVT1SOCSignalOutput(EPWM_Type *EPWMx, uint32_t channel)
{
    CLEAR_BIT(EPWMx->DCCR, EPWM_DCCR_DCAEVT1SOC_Msk << (channel * 16));
}

/**
  * @brief
  * @rmtoll   DCCR    DCAEVT1FRCS    FL_EPWM_SetDCEVT1SoftwareSource
  * @param    EPWMx EPWM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_DCEVT1_SOFTWARE_SOUECE_SYNC
  *           @arg @ref FL_EPWM_DCEVT1_SOFTWARE_SOUECE_ASYNC
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetDCEVT1ForceSource(EPWM_Type *EPWMx, uint32_t source, uint32_t channel)
{
    MODIFY_REG(EPWMx->DCCR, EPWM_DCCR_DCAEVT1FRCS_Msk << (channel * 16), source << (channel * 16));
}

/**
  * @brief
  * @rmtoll   DCCR    DCAEVT1FRCS    FL_EPWM_GetDCEVT1SoftwareSource
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_DCEVT1_SOFTWARE_SOUECE_SYNC
  *           @arg @ref FL_EPWM_DCEVT1_SOFTWARE_SOUECE_ASYNC
  */
__STATIC_INLINE uint32_t FL_EPWM_GetDCEVT1ForceSource(EPWM_Type *EPWMx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(EPWMx->DCCR, EPWM_DCCR_DCAEVT1FRCS_Msk << (channel * 16)));
}

/**
  * @brief
  * @rmtoll   DCCR    DCAEVT1SRC    FL_EPWM_SetDCEVT1Source
  * @param    EPWMx EPWM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_DCEVT1_SOUECE_DEEVT1
  *           @arg @ref FL_EPWM_DCEVT1_SOUECE_DCEVTFLT
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetDCEVT1Source(EPWM_Type *EPWMx, uint32_t source, uint32_t channel)
{
    MODIFY_REG(EPWMx->DCCR, EPWM_DCCR_DCAEVT1SRC_Msk << (channel * 16), source << (channel * 16));
}

/**
  * @brief
  * @rmtoll   DCCR    DCAEVT1SRC    FL_EPWM_GetDCEVT1Source
  * @param    EPWMx EPWM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_CHANNEL_A
  *           @arg @ref FL_EPWM_CHANNEL_B
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_DCEVT1_SOUECE_DEEVT1
  *           @arg @ref FL_EPWM_DCEVT1_SOUECE_DCEVTFLT
  */
__STATIC_INLINE uint32_t FL_EPWM_GetDCEVT1Source(EPWM_Type *EPWMx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(EPWMx->DCCR, EPWM_DCCR_DCAEVT1SRC_Msk << (channel * 16)));
}

/**
  * @brief
  * @rmtoll   DCFCR    ALIGN    FL_EPWM_SetWindowAlignmentMode
  * @param    EPWMx EPWM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_ALIGNMENT_MODE_CNT_0
  *           @arg @ref FL_EPWM_ALIGNMENT_MODE_CNT_PRD
  *           @arg @ref FL_EPWM_ALIGNMENT_MODE_CNT_0ANDCNT_PRD
  *           @arg @ref FL_EPWM_ALIGNMENT_MODE_CNT_0ANDCNT_PRD
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetWindowAlignmentMode(EPWM_Type *EPWMx, uint32_t mode)
{
    MODIFY_REG(EPWMx->DCFCR, EPWM_DCFCR_ALIGN_Msk, mode);
}

/**
  * @brief
  * @rmtoll   DCFCR    ALIGN    FL_EPWM_GetWindowAlignmentMode
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_ALIGNMENT_MODE_CNT_0
  *           @arg @ref FL_EPWM_ALIGNMENT_MODE_CNT_PRD
  *           @arg @ref FL_EPWM_ALIGNMENT_MODE_CNT_0ANDCNT_PRD
  *           @arg @ref FL_EPWM_ALIGNMENT_MODE_CNT_0ANDCNT_PRD
  */
__STATIC_INLINE uint32_t FL_EPWM_GetWindowAlignmentMode(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->DCFCR, EPWM_DCFCR_ALIGN_Msk));
}

/**
  * @brief
  * @rmtoll   DCFCR    BLKINV    FL_EPWM_EnableShieldWindowInvert
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableShieldWindowInvert(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->DCFCR, EPWM_DCFCR_BLKINV_Msk);
}

/**
  * @brief
  * @rmtoll   DCFCR    BLKINV    FL_EPWM_IsEnabledShieldWindowInvert
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledShieldWindowInvert(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->DCFCR, EPWM_DCFCR_BLKINV_Msk) == EPWM_DCFCR_BLKINV_Msk);
}

/**
  * @brief
  * @rmtoll   DCFCR    BLKINV    FL_EPWM_DisableShieldWindowInvert
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableShieldWindowInvert(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->DCFCR, EPWM_DCFCR_BLKINV_Msk);
}

/**
  * @brief
  * @rmtoll   DCFCR    BLKE    FL_EPWM_EnableShieldWindow
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableShieldWindow(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->DCFCR, EPWM_DCFCR_BLKE_Msk);
}

/**
  * @brief
  * @rmtoll   DCFCR    BLKE    FL_EPWM_IsEnabledShieldWindow
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledShieldWindow(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->DCFCR, EPWM_DCFCR_BLKE_Msk) == EPWM_DCFCR_BLKE_Msk);
}

/**
  * @brief
  * @rmtoll   DCFCR    BLKE    FL_EPWM_DisableShieldWindow
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableShieldWindow(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->DCFCR, EPWM_DCFCR_BLKE_Msk);
}

/**
  * @brief
  * @rmtoll   DCFCR    ALIGN    FL_EPWM_SetFilterModuleInputSource
  * @param    EPWMx EPWM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_FILTER_INPUT_SOURCE_DCAEVT1
  *           @arg @ref FL_EPWM_FILTER_INPUT_SOURCE_DCAEVT2
  *           @arg @ref FL_EPWM_FILTER_INPUT_SOURCE_DCBEVT1
  *           @arg @ref FL_EPWM_FILTER_INPUT_SOURCE_DCBEVT2
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetFilterModuleInputSource(EPWM_Type *EPWMx, uint32_t source)
{
    MODIFY_REG(EPWMx->DCFCR, EPWM_DCFCR_SRCSEL_Msk, source);
}

/**
  * @brief
  * @rmtoll   DCFCR    ALIGN    FL_EPWM_GetFilterModuleInputSource
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_FILTER_INPUT_SOURCE_DCAEVT1
  *           @arg @ref FL_EPWM_FILTER_INPUT_SOURCE_DCAEVT2
  *           @arg @ref FL_EPWM_FILTER_INPUT_SOURCE_DCBEVT1
  *           @arg @ref FL_EPWM_FILTER_INPUT_SOURCE_DCBEVT2
  */
__STATIC_INLINE uint32_t FL_EPWM_GetFilterModuleInputSource(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->DCFCR, EPWM_DCFCR_SRCSEL_Msk));
}

/**
  * @brief
  * @rmtoll   DCFWR    WINDOW    FL_EPWM_WriteShieldWindowWidth
  * @param    EPWMx EPWM instance
  * @param    width
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WriteShieldWindowWidth(EPWM_Type *EPWMx, uint32_t width)
{
    MODIFY_REG(EPWMx->DCFWR, (0xffU << 16U), (width << 16U));
}

/**
  * @brief
  * @rmtoll   DCFWR    WINDOW    FL_EPWM_ReadShieldWindowWidth
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadShieldWindowWidth(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->DCFWR, (0xffU << 16U)) >> 16U);
}

/**
  * @brief
  * @rmtoll   DCFWR    WINOFFSET    FL_EPWM_WriteShieldWindowOffsetWidth
  * @param    EPWMx EPWM instance
  * @param    width
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WriteShieldWindowOffsetWidth(EPWM_Type *EPWMx, uint32_t width)
{
    MODIFY_REG(EPWMx->DCFWR, (0xffffU << 0U), (width << 0U));
}

/**
  * @brief
  * @rmtoll   DCFWR    WINOFFSET    FL_EPWM_ReadShieldWindowOffsetWidth
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadShieldWindowOffsetWidth(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->DCFWR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief
  * @rmtoll   DCFDR    WINDOW_CNT    FL_EPWM_ReadShieldWindowCounter
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadShieldWindowCounter(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->DCFDR, (0xffU << 16U)) >> 16U);
}

/**
  * @brief
  * @rmtoll   DCFDR    WINOFFSET_CNT    FL_EPWM_ReadShieldWindowOffsetCounter
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadShieldWindowOffsetCounter(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->DCFDR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief
  * @rmtoll   EIER    PCNTSEL    FL_EPWM_SetPulseCountInterruptSignalSource
  * @param    EPWMx EPWM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_0
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_PRD
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_0ORCNT_PRD
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_CMPA_UP
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_CMPA_DOWN
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_CMPB_UP
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_CMPB_DOWN
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_CMPC_UP
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_CMPC_DOWN
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_CMPD_UP
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_CMPD_DOWN
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetPulseCountInterruptSignalSource(EPWM_Type *EPWMx, uint32_t source)
{
    MODIFY_REG(EPWMx->EIER, EPWM_EIER_PCNTSEL_Msk, source);
}

/**
  * @brief
  * @rmtoll   EIER    PCNTSEL    FL_EPWM_GetPulseCountInterruptSignalSource
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_0
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_PRD
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_0ORCNT_PRD
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_CMPA_UP
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_CMPA_DOWN
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_CMPB_UP
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_CMPB_DOWN
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_CMPC_UP
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_CMPC_DOWN
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_CMPD_UP
  *           @arg @ref FL_EPWM_COUNT_IE_SOURCE_CNT_CMPD_DOWN
  */
__STATIC_INLINE uint32_t FL_EPWM_GetPulseCountInterruptSignalSource(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EIER, EPWM_EIER_PCNTSEL_Msk));
}

/**
  * @brief
  * @rmtoll   EIER    SOCBSEL    FL_EPWM_SetADCSOCBSignalSource
  * @param    EPWMx EPWM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_DCBEVT1_SOC
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_0
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_PRD
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_0ORCNT_PRD
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPA_UP
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPA_DOWN
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPB_UP
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPB_DOWN
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPC_UP
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPC_DOWN
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPD_UP
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPD_DOWN
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetADCSOCBSignalSource(EPWM_Type *EPWMx, uint32_t source)
{
    MODIFY_REG(EPWMx->EIER, EPWM_EIER_SOCBSEL_Msk, source);
}

/**
  * @brief
  * @rmtoll   EIER    SOCBSEL    FL_EPWM_GetADCSOCBSignalSource
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_DCBEVT1_SOC
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_0
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_PRD
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_0ORCNT_PRD
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPA_UP
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPA_DOWN
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPB_UP
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPB_DOWN
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPC_UP
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPC_DOWN
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPD_UP
  *           @arg @ref FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPD_DOWN
  */
__STATIC_INLINE uint32_t FL_EPWM_GetADCSOCBSignalSource(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EIER, EPWM_EIER_SOCBSEL_Msk));
}

/**
  * @brief
  * @rmtoll   EIER    SOCASEL    FL_EPWM_SetADCSOCASignalSource
  * @param    EPWMx EPWM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_DCBEVT1_SOC
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_0
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_PRD
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_0ORCNT_PRD
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPA_UP
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPA_DOWN
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPB_UP
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPB_DOWN
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPC_UP
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPC_DOWN
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPD_UP
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPD_DOWN
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetADCSOCASignalSource(EPWM_Type *EPWMx, uint32_t source)
{
    MODIFY_REG(EPWMx->EIER, EPWM_EIER_SOCASEL_Msk, source);
}

/**
  * @brief
  * @rmtoll   EIER    SOCASEL    FL_EPWM_GetADCSOCASignalSource
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_DCBEVT1_SOC
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_0
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_PRD
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_0ORCNT_PRD
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPA_UP
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPA_DOWN
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPB_UP
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPB_DOWN
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPC_UP
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPC_DOWN
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPD_UP
  *           @arg @ref FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPD_DOWN
  */
__STATIC_INLINE uint32_t FL_EPWM_GetADCSOCASignalSource(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EIER, EPWM_EIER_SOCASEL_Msk));
}

/**
  * @brief
  * @rmtoll   EIER    SOCBEN    FL_EPWM_EnableADCSOCBEvent
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableADCSOCBEvent(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->EIER, EPWM_EIER_SOCBEN_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    SOCBEN    FL_EPWM_IsEnabledADCSOCBEvent
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledADCSOCBEvent(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EIER, EPWM_EIER_SOCBEN_Msk) == EPWM_EIER_SOCBEN_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    SOCBEN    FL_EPWM_DisableADCSOCBEvent
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableADCSOCBEvent(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->EIER, EPWM_EIER_SOCBEN_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    SOCAEN    FL_EPWM_EnableADCSOCAEvent
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableADCSOCAEvent(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->EIER, EPWM_EIER_SOCAEN_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    SOCAEN    FL_EPWM_IsEnabledADCSOCAEvent
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledADCSOCAEvent(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EIER, EPWM_EIER_SOCAEN_Msk) == EPWM_EIER_SOCAEN_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    SOCAEN    FL_EPWM_DisableADCSOCAEvent
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableADCSOCAEvent(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->EIER, EPWM_EIER_SOCAEN_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    PCNTIE    FL_EPWM_EnableIT_PulseCountEvent
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableIT_PulseCountEvent(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->EIER, EPWM_EIER_PCNTIE_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    PCNTIE    FL_EPWM_IsEnabledIT_PulseCountEvent
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledIT_PulseCountEvent(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EIER, EPWM_EIER_PCNTIE_Msk) == EPWM_EIER_PCNTIE_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    PCNTIE    FL_EPWM_DisableIT_PulseCountEvent
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableIT_PulseCountEvent(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->EIER, EPWM_EIER_PCNTIE_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    SOCBIE    FL_EPWM_EnableIT_ADCSOCB
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableIT_ADCSOCB(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->EIER, EPWM_EIER_SOCBIE_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    SOCBIE    FL_EPWM_IsEnabledIT_ADCSOCB
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledIT_ADCSOCB(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EIER, EPWM_EIER_SOCBIE_Msk) == EPWM_EIER_SOCBIE_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    SOCBIE    FL_EPWM_DisableIT_ADCSOCB
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableIT_ADCSOCB(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->EIER, EPWM_EIER_SOCBIE_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    SOCAIE    FL_EPWM_EnableIT_ADCSOCA
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableIT_ADCSOCA(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->EIER, EPWM_EIER_SOCAIE_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    SOCAIE    FL_EPWM_IsEnabledIT_ADCSOCA
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledIT_ADCSOCA(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EIER, EPWM_EIER_SOCAIE_Msk) == EPWM_EIER_SOCAIE_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    SOCAIE    FL_EPWM_DisableIT_ADCSOCA
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableIT_ADCSOCA(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->EIER, EPWM_EIER_SOCAIE_Msk);
}
/**
  * @brief
  * @rmtoll   EIER    CAUIE    FL_EPWM_EnableIT_CompareEvent
  * @param    EPWMx EPWM instance
  * @param    dir This parameter can be one of the following values:
  * @param    event This parameter can be one of the following values:
              FL_EPWM_COUNT_MODE_UP_CNT_CMPA
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPA
              FL_EPWM_COUNT_MODE_UP_CNT_CMPB
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPB
              FL_EPWM_COUNT_MODE_UP_CNT_CMPC
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPC
              FL_EPWM_COUNT_MODE_UP_CNT_CMPD
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPD
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableIT_CompareEvent(EPWM_Type *EPWMx, uint32_t event)
{
    SET_BIT(EPWMx->EIER, EPWM_EIER_CAUIE_Msk << event);
}

/**
  * @brief
  * @rmtoll   EIER    CAUIE    FL_EPWM_IsEnabledIT_CompareEvent
  * @param    EPWMx EPWM instance
  * @param    dir This parameter can be one of the following values:
  * @param    event This parameter can be one of the following values:
              FL_EPWM_COUNT_MODE_UP_CNT_CMPA
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPA
              FL_EPWM_COUNT_MODE_UP_CNT_CMPB
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPB
              FL_EPWM_COUNT_MODE_UP_CNT_CMPC
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPC
              FL_EPWM_COUNT_MODE_UP_CNT_CMPD
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPD
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledIT_CompareEvent(EPWM_Type *EPWMx, uint32_t event)
{
    return (uint32_t)(READ_BIT(EPWMx->EIER, EPWM_EIER_CAUIE_Msk << event) == EPWM_EIER_CAUIE_Msk << event);
}

