waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epwm.h
/**
  * @brief
  * @rmtoll   EIER    CAUIE    FL_EPWM_DisableIT_CompareEvent
  * @param    EPWMx EPWM instance
  * @param    dir This parameter can be one of the following values:
  * @param    event This parameter can be one of the following values:
              FL_EPWM_COUNT_MODE_UP_CNT_CMPA
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPA
              FL_EPWM_COUNT_MODE_UP_CNT_CMPB
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPB
              FL_EPWM_COUNT_MODE_UP_CNT_CMPC
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPC
              FL_EPWM_COUNT_MODE_UP_CNT_CMPD
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPD
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableIT_CompareEvent(EPWM_Type *EPWMx,  uint32_t event)
{
    CLEAR_BIT(EPWMx->EIER, EPWM_EIER_CAUIE_Msk << event);
}

/**
  * @brief
  * @rmtoll   EIER    CPIE    FL_EPWM_EnableIT_CNTEqualPRD
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableIT_CNTEqualPRD(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->EIER, EPWM_EIER_CPIE_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    CPIE    FL_EPWM_IsEnabledIT_CNTEqualPRD
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledIT_CNTEqualPRD(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EIER, EPWM_EIER_CPIE_Msk) == EPWM_EIER_CPIE_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    CPIE    FL_EPWM_DisableIT_CNTEqualPRD
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableIT_CNTEqualPRD(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->EIER, EPWM_EIER_CPIE_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    CZIE    FL_EPWM_EnableIT_CNTEqualZero
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableIT_CNTEqualZero(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->EIER, EPWM_EIER_CZIE_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    CZIE    FL_EPWM_IsEnabledIT_CNTEqualZero
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledIT_CNTEqualZero(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EIER, EPWM_EIER_CZIE_Msk) == EPWM_EIER_CZIE_Msk);
}

/**
  * @brief
  * @rmtoll   EIER    CZIE    FL_EPWM_DisableIT_CNTEqualZero
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableIT_CNTEqualZero(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->EIER, EPWM_EIER_CZIE_Msk);
}

/**
  * @brief
  * @rmtoll   EISR    PCNTIF    FL_EPWM_IsActiveFlag_PulseCountEvent
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_PulseCountEvent(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EISR, EPWM_EISR_PCNTIF_Msk) == (EPWM_EISR_PCNTIF_Msk));
}

/**
  * @brief
  * @rmtoll   EISR    PCNTIF    FL_EPWM_ClearFlag_PulseCountEvent
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_PulseCountEvent(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->EISR, EPWM_EISR_PCNTIF_Msk);
}

/**
  * @brief
  * @rmtoll   EISR    SOCBIF    FL_EPWM_IsActiveFlag_ADCSOCB
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_ADCSOCB(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EISR, EPWM_EISR_SOCBIF_Msk) == (EPWM_EISR_SOCBIF_Msk));
}

/**
  * @brief
  * @rmtoll   EISR    SOCBIF    FL_EPWM_ClearFlag_ADCSOCB
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_ADCSOCB(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->EISR, EPWM_EISR_SOCBIF_Msk);
}

/**
  * @brief
  * @rmtoll   EISR    SOCAIF    FL_EPWM_IsActiveFlag_ADCSOCA
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_ADCSOCA(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EISR, EPWM_EISR_SOCAIF_Msk) == (EPWM_EISR_SOCAIF_Msk));
}

/**
  * @brief
  * @rmtoll   EISR    SOCAIF    FL_EPWM_ClearFlag_ADCSOCA
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_ADCSOCA(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->EISR, EPWM_EISR_SOCAIF_Msk);
}

/**
  * @brief
  * @rmtoll   EISR    CAUIF    FL_EPWM_IsActiveFlag_CompareEvent
  * @param    EPWMx EPWM instance
  * @param    dir This parameter can be one of the following values:
  * @param    event This parameter can be one of the following values:
              FL_EPWM_COUNT_MODE_UP_CNT_CMPA
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPA
              FL_EPWM_COUNT_MODE_UP_CNT_CMPB
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPB
              FL_EPWM_COUNT_MODE_UP_CNT_CMPC
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPC
              FL_EPWM_COUNT_MODE_UP_CNT_CMPD
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPD
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_CompareEvent(EPWM_Type *EPWMx, uint32_t event)
{
    return (uint32_t)(READ_BIT(EPWMx->EISR, EPWM_EISR_CAUIF_Msk << event) == (EPWM_EISR_CAUIF_Msk << event));
}

/**
  * @brief
  * @rmtoll   EISR    CAUIF    FL_EPWM_ClearFlag_CompareEvent
  * @param    EPWMx EPWM instance
  * @param    dir This parameter can be one of the following values:
  * @param    event This parameter can be one of the following values:
              FL_EPWM_COUNT_MODE_UP_CNT_CMPA
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPA
              FL_EPWM_COUNT_MODE_UP_CNT_CMPB
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPB
              FL_EPWM_COUNT_MODE_UP_CNT_CMPC
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPC
              FL_EPWM_COUNT_MODE_UP_CNT_CMPD
              FL_EPWM_COUNT_MODE_DOWN_CNT_CMPD
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_CompareEvent(EPWM_Type *EPWMx, uint32_t event)
{
    WRITE_REG(EPWMx->EISR, EPWM_EISR_CAUIF_Msk << event);
}

/**
  * @brief
  * @rmtoll   EISR    CPIF    FL_EPWM_IsActiveFlag_CNTEqualPRD
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_CNTEqualPRD(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EISR, EPWM_EISR_CPIF_Msk) == (EPWM_EISR_CPIF_Msk));
}

/**
  * @brief
  * @rmtoll   EISR    CPIF    FL_EPWM_ClearFlag_CNTEqualPRD
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_CNTEqualPRD(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->EISR, EPWM_EISR_CPIF_Msk);
}

/**
  * @brief
  * @rmtoll   EISR    CZIF    FL_EPWM_IsActiveFlag_CNTEqualZero
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_CNTEqualZero(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EISR, EPWM_EISR_CZIF_Msk) == (EPWM_EISR_CZIF_Msk));
}

/**
  * @brief
  * @rmtoll   EISR    CZIF    FL_EPWM_ClearFlag_CNTEqualZero
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_ClearFlag_CNTEqualZero(EPWM_Type *EPWMx)
{
    WRITE_REG(EPWMx->EISR, EPWM_EISR_CZIF_Msk);
}

/**
  * @brief
  * @rmtoll   EPSR    PCINTCNT    FL_EPWM_GetSelectPulseEventCounter
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_PULSE_EVENT_N0
  *           @arg @ref FL_EPWM_PULSE_EVENT_N1
  *           @arg @ref FL_EPWM_PULSE_EVENT_N2
  *           @arg @ref FL_EPWM_PULSE_EVENT_N3
  *           @arg @ref FL_EPWM_PULSE_EVENT_N4
  *           @arg @ref FL_EPWM_PULSE_EVENT_N5
  *           @arg @ref FL_EPWM_PULSE_EVENT_N6
  *           @arg @ref FL_EPWM_PULSE_EVENT_N7
  *           @arg @ref FL_EPWM_PULSE_EVENT_N8
  *           @arg @ref FL_EPWM_PULSE_EVENT_N9
  *           @arg @ref FL_EPWM_PULSE_EVENT_N10
  *           @arg @ref FL_EPWM_PULSE_EVENT_N11
  *           @arg @ref FL_EPWM_PULSE_EVENT_N12
  *           @arg @ref FL_EPWM_PULSE_EVENT_N13
  *           @arg @ref FL_EPWM_PULSE_EVENT_N14
  *           @arg @ref FL_EPWM_PULSE_EVENT_N15
  */
__STATIC_INLINE uint32_t FL_EPWM_GetSelectPulseEventCounter(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EPSR, EPWM_EPSR_PCINTCNT_Msk));
}

/**
  * @brief
  * @rmtoll   EPSR    PCINTPRD    FL_EPWM_SetPulseCountInterruptTriggerCondition
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_PULSE_EVENT_N0
  *           @arg @ref FL_EPWM_PULSE_EVENT_N1
  *           @arg @ref FL_EPWM_PULSE_EVENT_N2
  *           @arg @ref FL_EPWM_PULSE_EVENT_N3
  *           @arg @ref FL_EPWM_PULSE_EVENT_N4
  *           @arg @ref FL_EPWM_PULSE_EVENT_N5
  *           @arg @ref FL_EPWM_PULSE_EVENT_N6
  *           @arg @ref FL_EPWM_PULSE_EVENT_N7
  *           @arg @ref FL_EPWM_PULSE_EVENT_N8
  *           @arg @ref FL_EPWM_PULSE_EVENT_N9
  *           @arg @ref FL_EPWM_PULSE_EVENT_N10
  *           @arg @ref FL_EPWM_PULSE_EVENT_N11
  *           @arg @ref FL_EPWM_PULSE_EVENT_N12
  *           @arg @ref FL_EPWM_PULSE_EVENT_N13
  *           @arg @ref FL_EPWM_PULSE_EVENT_N14
  *           @arg @ref FL_EPWM_PULSE_EVENT_N15
  */
__STATIC_INLINE void FL_EPWM_SetPulseCountInterruptTriggerCondition(EPWM_Type *EPWMx, uint32_t count)
{
    MODIFY_REG(EPWMx->EPSR, EPWM_EPSR_PCINTPRD_Msk, count);
}

/**
  * @brief
  * @rmtoll   EPSR    PCINTPRD    FL_EPWM_GetPulseCountInterruptTriggerCondition
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_PULSE_EVENT_N0
  *           @arg @ref FL_EPWM_PULSE_EVENT_N1
  *           @arg @ref FL_EPWM_PULSE_EVENT_N2
  *           @arg @ref FL_EPWM_PULSE_EVENT_N3
  *           @arg @ref FL_EPWM_PULSE_EVENT_N4
  *           @arg @ref FL_EPWM_PULSE_EVENT_N5
  *           @arg @ref FL_EPWM_PULSE_EVENT_N6
  *           @arg @ref FL_EPWM_PULSE_EVENT_N7
  *           @arg @ref FL_EPWM_PULSE_EVENT_N8
  *           @arg @ref FL_EPWM_PULSE_EVENT_N9
  *           @arg @ref FL_EPWM_PULSE_EVENT_N10
  *           @arg @ref FL_EPWM_PULSE_EVENT_N11
  *           @arg @ref FL_EPWM_PULSE_EVENT_N12
  *           @arg @ref FL_EPWM_PULSE_EVENT_N13
  *           @arg @ref FL_EPWM_PULSE_EVENT_N14
  *           @arg @ref FL_EPWM_PULSE_EVENT_N15
  */
__STATIC_INLINE uint32_t FL_EPWM_GetPulseCountInterruptTriggerCondition(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EPSR, EPWM_EPSR_PCINTPRD_Msk));
}

/**
  * @brief
  * @rmtoll   EPSR    SOCBCNT    FL_EPWM_GetSOCBEventCounter
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_SOCB_EVENT_N0
  *           @arg @ref FL_EPWM_SOCB_EVENT_N1
  *           @arg @ref FL_EPWM_SOCB_EVENT_N2
  *           @arg @ref FL_EPWM_SOCB_EVENT_N3
  *           @arg @ref FL_EPWM_SOCB_EVENT_N4
  *           @arg @ref FL_EPWM_SOCB_EVENT_N5
  *           @arg @ref FL_EPWM_SOCB_EVENT_N6
  *           @arg @ref FL_EPWM_SOCB_EVENT_N7
  *           @arg @ref FL_EPWM_SOCB_EVENT_N8
  *           @arg @ref FL_EPWM_SOCB_EVENT_N9
  *           @arg @ref FL_EPWM_SOCB_EVENT_N10
  *           @arg @ref FL_EPWM_SOCB_EVENT_N11
  *           @arg @ref FL_EPWM_SOCB_EVENT_N12
  *           @arg @ref FL_EPWM_SOCB_EVENT_N13
  *           @arg @ref FL_EPWM_SOCB_EVENT_N14
  *           @arg @ref FL_EPWM_SOCB_EVENT_N15
  */
__STATIC_INLINE uint32_t FL_EPWM_GetSOCBEventCounter(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EPSR, EPWM_EPSR_SOCBCNT_Msk));
}

/**
  * @brief
  * @rmtoll   EPSR    SOCBPRD    FL_EPWM_SetSOCBOutputCondition
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_SOCB_EVENT_N0
  *           @arg @ref FL_EPWM_SOCB_EVENT_N1
  *           @arg @ref FL_EPWM_SOCB_EVENT_N2
  *           @arg @ref FL_EPWM_SOCB_EVENT_N3
  *           @arg @ref FL_EPWM_SOCB_EVENT_N4
  *           @arg @ref FL_EPWM_SOCB_EVENT_N5
  *           @arg @ref FL_EPWM_SOCB_EVENT_N6
  *           @arg @ref FL_EPWM_SOCB_EVENT_N7
  *           @arg @ref FL_EPWM_SOCB_EVENT_N8
  *           @arg @ref FL_EPWM_SOCB_EVENT_N9
  *           @arg @ref FL_EPWM_SOCB_EVENT_N10
  *           @arg @ref FL_EPWM_SOCB_EVENT_N11
  *           @arg @ref FL_EPWM_SOCB_EVENT_N12
  *           @arg @ref FL_EPWM_SOCB_EVENT_N13
  *           @arg @ref FL_EPWM_SOCB_EVENT_N14
  *           @arg @ref FL_EPWM_SOCB_EVENT_N15
  */
__STATIC_INLINE void FL_EPWM_SetSOCBOutputCondition(EPWM_Type *EPWMx, uint32_t count)
{
    MODIFY_REG(EPWMx->EPSR, EPWM_EPSR_SOCBPRD_Msk, count);
}

/**
  * @brief
  * @rmtoll   EPSR    SOCBPRD    FL_EPWM_GetSOCBOutputCondition
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_SOCB_EVENT_N0
  *           @arg @ref FL_EPWM_SOCB_EVENT_N1
  *           @arg @ref FL_EPWM_SOCB_EVENT_N2
  *           @arg @ref FL_EPWM_SOCB_EVENT_N3
  *           @arg @ref FL_EPWM_SOCB_EVENT_N4
  *           @arg @ref FL_EPWM_SOCB_EVENT_N5
  *           @arg @ref FL_EPWM_SOCB_EVENT_N6
  *           @arg @ref FL_EPWM_SOCB_EVENT_N7
  *           @arg @ref FL_EPWM_SOCB_EVENT_N8
  *           @arg @ref FL_EPWM_SOCB_EVENT_N9
  *           @arg @ref FL_EPWM_SOCB_EVENT_N10
  *           @arg @ref FL_EPWM_SOCB_EVENT_N11
  *           @arg @ref FL_EPWM_SOCB_EVENT_N12
  *           @arg @ref FL_EPWM_SOCB_EVENT_N13
  *           @arg @ref FL_EPWM_SOCB_EVENT_N14
  *           @arg @ref FL_EPWM_SOCB_EVENT_N15
  */
__STATIC_INLINE uint32_t FL_EPWM_GetSOCBOutputCondition(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EPSR, EPWM_EPSR_SOCBPRD_Msk));
}

/**
  * @brief
  * @rmtoll   EPSR    SOCACNT    FL_EPWM_GetSOCAEventCounter
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_SOCA_EVENT_N0
  *           @arg @ref FL_EPWM_SOCA_EVENT_N1
  *           @arg @ref FL_EPWM_SOCA_EVENT_N2
  *           @arg @ref FL_EPWM_SOCA_EVENT_N3
  *           @arg @ref FL_EPWM_SOCA_EVENT_N4
  *           @arg @ref FL_EPWM_SOCA_EVENT_N5
  *           @arg @ref FL_EPWM_SOCA_EVENT_N6
  *           @arg @ref FL_EPWM_SOCA_EVENT_N7
  *           @arg @ref FL_EPWM_SOCA_EVENT_N8
  *           @arg @ref FL_EPWM_SOCA_EVENT_N9
  *           @arg @ref FL_EPWM_SOCA_EVENT_N10
  *           @arg @ref FL_EPWM_SOCA_EVENT_N11
  *           @arg @ref FL_EPWM_SOCA_EVENT_N12
  *           @arg @ref FL_EPWM_SOCA_EVENT_N13
  *           @arg @ref FL_EPWM_SOCA_EVENT_N14
  *           @arg @ref FL_EPWM_SOCA_EVENT_N15
  */
__STATIC_INLINE uint32_t FL_EPWM_GetSOCAEventCounter(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EPSR, EPWM_EPSR_SOCACNT_Msk));
}

/**
  * @brief
  * @rmtoll   EPSR    SOCACNT    FL_EPWM_SetSOCAOutputCondition
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_SOCA_EVENT_N0
  *           @arg @ref FL_EPWM_SOCA_EVENT_N1
  *           @arg @ref FL_EPWM_SOCA_EVENT_N2
  *           @arg @ref FL_EPWM_SOCA_EVENT_N3
  *           @arg @ref FL_EPWM_SOCA_EVENT_N4
  *           @arg @ref FL_EPWM_SOCA_EVENT_N5
  *           @arg @ref FL_EPWM_SOCA_EVENT_N6
  *           @arg @ref FL_EPWM_SOCA_EVENT_N7
  *           @arg @ref FL_EPWM_SOCA_EVENT_N8
  *           @arg @ref FL_EPWM_SOCA_EVENT_N9
  *           @arg @ref FL_EPWM_SOCA_EVENT_N10
  *           @arg @ref FL_EPWM_SOCA_EVENT_N11
  *           @arg @ref FL_EPWM_SOCA_EVENT_N12
  *           @arg @ref FL_EPWM_SOCA_EVENT_N13
  *           @arg @ref FL_EPWM_SOCA_EVENT_N14
  *           @arg @ref FL_EPWM_SOCA_EVENT_N15
  */
__STATIC_INLINE void FL_EPWM_SetSOCAOutputCondition(EPWM_Type *EPWMx, uint32_t count)
{
    MODIFY_REG(EPWMx->EPSR, EPWM_EPSR_SOCAPRD_Msk, count);
}

/**
  * @brief
  * @rmtoll   EPSR    SOCACNT    FL_EPWM_GetSOCAOutputCondition
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_SOCA_EVENT_N0
  *           @arg @ref FL_EPWM_SOCA_EVENT_N1
  *           @arg @ref FL_EPWM_SOCA_EVENT_N2
  *           @arg @ref FL_EPWM_SOCA_EVENT_N3
  *           @arg @ref FL_EPWM_SOCA_EVENT_N4
  *           @arg @ref FL_EPWM_SOCA_EVENT_N5
  *           @arg @ref FL_EPWM_SOCA_EVENT_N6
  *           @arg @ref FL_EPWM_SOCA_EVENT_N7
  *           @arg @ref FL_EPWM_SOCA_EVENT_N8
  *           @arg @ref FL_EPWM_SOCA_EVENT_N9
  *           @arg @ref FL_EPWM_SOCA_EVENT_N10
  *           @arg @ref FL_EPWM_SOCA_EVENT_N11
  *           @arg @ref FL_EPWM_SOCA_EVENT_N12
  *           @arg @ref FL_EPWM_SOCA_EVENT_N13
  *           @arg @ref FL_EPWM_SOCA_EVENT_N14
  *           @arg @ref FL_EPWM_SOCA_EVENT_N15
  */
__STATIC_INLINE uint32_t FL_EPWM_GetSOCAOutputCondition(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->EPSR, EPWM_EPSR_SOCAPRD_Msk));
}

/**
  * @brief
  * @rmtoll   SWTR    SOCB    FL_EPWM_GenerateSOCBEvent
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_GenerateSOCBEvent(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->SWTR, EPWM_SWTR_SOCB_Msk);
}

/**
  * @brief
  * @rmtoll   SWTR    SOCA    FL_EPWM_GenerateSOCAEvent
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_GenerateSOCAEvent(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->SWTR, EPWM_SWTR_SOCA_Msk);
}

/**
  * @brief
  * @rmtoll   HRCR    HRLDPRD    FL_EPWM_EnableHPWMCompareRegisterLoad_CNTEqualPRD
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableHPWMCompareRegisterLoad_CNTEqualPRD(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->HRCR, EPWM_HRCR_HRLDPRD_Msk);
}

/**
  * @brief
  * @rmtoll   HRCR    HRLDPRD    FL_EPWM_IsEnabledHPWMCompareRegisterLoad_CNTEqualPRD
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledHPWMCompareRegisterLoad_CNTEqualPRD(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->HRCR, EPWM_HRCR_HRLDPRD_Msk) == EPWM_HRCR_HRLDPRD_Msk);
}

/**
  * @brief
  * @rmtoll   HRCR    HRLDPRD    FL_EPWM_DisableHPWMCompareRegisterLoad_CNTEqualPRD
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableHPWMCompareRegisterLoad_CNTEqualPRD(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->HRCR, EPWM_HRCR_HRLDPRD_Msk);
}

/**
  * @brief
  * @rmtoll   HRCR    HRLDZRO    FL_EPWM_EnableHPWMCompareRegisterLoad_CNTEqualZero
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableHPWMCompareRegisterLoad_CNTEqualZero(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->HRCR, EPWM_HRCR_HRLDZRO_Msk);
}

/**
  * @brief
  * @rmtoll   HRCR    HRLDZRO    FL_EPWM_IsEnabledHPWMCompareRegisterLoad_CNTEqualZero
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledHPWMCompareRegisterLoad_CNTEqualZero(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->HRCR, EPWM_HRCR_HRLDZRO_Msk) == EPWM_HRCR_HRLDZRO_Msk);
}

/**
  * @brief
  * @rmtoll   HRCR    HRLDZRO    FL_EPWM_DisableHPWMCompareRegisterLoad_CNTEqualZero
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableHPWMCompareRegisterLoad_CNTEqualZero(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->HRCR, EPWM_HRCR_HRLDZRO_Msk);
}

/**
  * @brief
  * @rmtoll   HRCR    HRSHEN    FL_EPWM_EnableHPWMPreload
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableHPWMPreload(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->HRCR, EPWM_HRCR_HRSHEN_Msk);
}

/**
  * @brief
  * @rmtoll   HRCR    HRSHEN    FL_EPWM_IsEnabledHPWMPreload
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledHPWMPreload(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->HRCR, EPWM_HRCR_HRSHEN_Msk) == EPWM_HRCR_HRSHEN_Msk);
}

/**
  * @brief
  * @rmtoll   HRCR    HRSHEN    FL_EPWM_DisableHPWMPreload
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableHPWMPreload(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->HRCR, EPWM_HRCR_HRSHEN_Msk);
}

/**
  * @brief
  * @rmtoll   HRCR    HRPWMEN    FL_EPWM_EnableHPWMMode
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnableHPWMMode(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->HRCR, EPWM_HRCR_HRPWMEN_Msk);
}

/**
  * @brief
  * @rmtoll   HRCR    HRPWMEN    FL_EPWM_IsEnabledHPWMMode
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledHPWMMode(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->HRCR, EPWM_HRCR_HRPWMEN_Msk) == EPWM_HRCR_HRPWMEN_Msk);
}

/**
  * @brief
  * @rmtoll   HRCR    HRPWMEN    FL_EPWM_DisableHPWMMode
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisableHPWMMode(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->HRCR, EPWM_HRCR_HRPWMEN_Msk);
}

/**
  * @brief
  * @rmtoll   HRPRD    HRPRD    FL_EPWM_WriteHPWMPeriod
  * @param    EPWMx EPWM instance
  * @param    period
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WriteHPWMPeriod(EPWM_Type *EPWMx, uint32_t period)
{
    MODIFY_REG(EPWMx->HRPRD, (0x1fU << 0U), (period << 0U));
}

/**
  * @brief
  * @rmtoll   HRPRD    HRPRD    FL_EPWM_ReadHPWMPeriod
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadHPWMPeriod(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->HRPRD, (0x1fU << 0U)) >> 0U);
}

/**
  * @brief
  * @rmtoll   HRCMPA    HRCMPA    FL_EPWM_WriteHPWMCompareCHA
  * @param    EPWMx EPWM instance
  * @param    compareValue
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WriteHPWMCompareCHA(EPWM_Type *EPWMx, uint32_t compareValue)
{
    MODIFY_REG(EPWMx->HRCMPA, (0x1fU << 0U), (compareValue << 0U));
}

/**
  * @brief
  * @rmtoll   HRCMPA    HRCMPA    FL_EPWM_ReadHPWMCompareCHA
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadHPWMCompareCHA(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->HRCMPA, (0x1fU << 0U)) >> 0U);
}

/**
  * @brief
  * @rmtoll   HRCMPB    HRCMPB    FL_EPWM_WriteHPWMCompareCHB
  * @param    EPWMx EPWM instance
  * @param    compareValue
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WriteHPWMCompareCHB(EPWM_Type *EPWMx, uint32_t compareValue)
{
    MODIFY_REG(EPWMx->HRCMPB, (0x1fU << 0U), (compareValue << 0U));
}

/**
  * @brief
  * @rmtoll   HRCMPB    HRCMPB    FL_EPWM_ReadHPWMCompareCHB
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadHPWMCompareCHB(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->HRCMPB, (0x1fU << 0U)) >> 0U);
}

/**
  * @brief
  * @rmtoll   HRACR    LOCK    FL_EPWM_IsActiveFlag_LOCK
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsActiveFlag_LOCK(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->HRACR, EPWM_HRACR_LOCK_Msk) == (EPWM_HRACR_LOCK_Msk));
}

/**
  * @brief
  * @rmtoll   HRACR    PWRESHAPER_EN    FL_EPWM_EnablePulseReshaper
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_EnablePulseReshaper(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->HRACR, EPWM_HRACR_PWRESHAPER_EN_Msk);
}

/**
  * @brief
  * @rmtoll   HRACR    PWRESHAPER_EN    FL_EPWM_IsEnabledPulseReshaper
  * @param    EPWMx EPWM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabledPulseReshaper(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->HRACR, EPWM_HRACR_PWRESHAPER_EN_Msk) == EPWM_HRACR_PWRESHAPER_EN_Msk);
}

/**
  * @brief
  * @rmtoll   HRACR    PWRESHAPER_EN    FL_EPWM_DisablePulseReshaper
  * @param    EPWMx EPWM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_DisablePulseReshaper(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->HRACR, EPWM_HRACR_PWRESHAPER_EN_Msk);
}

