waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epwm.h
/**
  * @brief
  * @rmtoll   HRACR    ITRIM    FL_EPWM_WriteCurrentTrim
  * @param    EPWMx EPWM instance
  * @param    trimValue
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WriteCurrentTrim(EPWM_Type *EPWMx, uint32_t trimValue)
{
    MODIFY_REG(EPWMx->HRACR, (0x7U << 4U), (trimValue << 4U));
}

/**
  * @brief
  * @rmtoll   HRACR    ITRIM    FL_EPWM_ReadCurrentTrim
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadCurrentTrim(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->HRACR, (0x7U << 4U)) >> 4U);
}

/**
  * @brief
  * @rmtoll   HRACR    RTRIM    FL_EPWM_WriteResistorTrim
  * @param    EPWMx EPWM instance
  * @param    trimValue
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_WriteResistorTrim(EPWM_Type *EPWMx, uint32_t trimValue)
{
    MODIFY_REG(EPWMx->HRACR, (0xfU << 0U), (trimValue << 0U));
}

/**
  * @brief
  * @rmtoll   HRACR    RTRIM    FL_EPWM_ReadResistorTrim
  * @param    EPWMx EPWM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPWM_ReadResistorTrim(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->HRACR, (0xfU << 0U)) >> 0U);
}

/**
  * @brief
  * @rmtoll   LINK    LINK    FL_EPWM_SetLinkMode
  * @param    EPWMx EPWM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPWM_LINK_NONE
  *           @arg @ref FL_EPWM_LINK_EPWM1
  *           @arg @ref FL_EPWM_LINK_EPWM2
  *           @arg @ref FL_EPWM_LINK_EPWM3
  *           @arg @ref FL_EPWM_LINK_EPWM4
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_SetLinkMode(EPWM_Type *EPWMx, uint32_t mode)
{
    MODIFY_REG(EPWMx->LINK, EPWM_LINK_LINK_Msk, mode);
}

/**
  * @brief
  * @rmtoll   LINK    LINK    FL_EPWM_GetLinkMode
  * @param    EPWMx EPWM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPWM_LINK_NONE
  *           @arg @ref FL_EPWM_LINK_EPWM0
  *           @arg @ref FL_EPWM_LINK_EPWM1
  *           @arg @ref FL_EPWM_LINK_EPWM2
  *           @arg @ref FL_EPWM_LINK_EPWM3
  */
__STATIC_INLINE uint32_t FL_EPWM_GetLinkMode(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->LINK, EPWM_LINK_LINK_Msk));
}
/**
  * @brief    计数器使能
  * @rmtoll   CR    START    FL_EPWM_Enable
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPWM_Enable(EPWM_Type *EPWMx)
{
    SET_BIT(EPWMx->CR, EPWM_CR_CEN_Msk);
}

/**
  * @brief    读取计数器使能状态
  * @rmtoll   CR    START    FL_EPWM_IsEnabled
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPWM_IsEnabled(EPWM_Type *EPWMx)
{
    return (uint32_t)(READ_BIT(EPWMx->CR, EPWM_CR_CEN_Msk) == EPWM_CR_CEN_Msk);
}

/**
  * @brief    计数器关闭
  * @rmtoll   CR    START    FL_EPWM_Disable
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_EOWM_Disable(EPWM_Type *EPWMx)
{
    CLEAR_BIT(EPWMx->CR, EPWM_CR_CEN_Msk);
}
/**
  * @}
  */

/** @defgroup EPWM_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
//#warning "PLEASE ANNOUCE THE INIT AND DEINIT FUNCTIONS HERE!!!"

/**
  * @}
  */
FL_ErrorStatus FL_EPWM_Init(EPWM_Type *TIMx, FL_EPWM_InitTypeDef *TIM_InitStruct);
FL_ErrorStatus FL_EPWM_OC_Init(EPWM_Type *TIMx, uint32_t channel, FL_EPWM_OC_InitTypeDef *TIM_InitStruct);
FL_ErrorStatus FL_EPWM_CMP_Init(EPWM_Type *TIMx, uint32_t channel, FL_EPWM_CMP_InitTypeDef *TIM_InitStruct);
FL_ErrorStatus FL_EPWM_DT_Init(EPWM_Type *TIMx, uint32_t channel, FL_EPWM_DT_InitTypeDef *TIM_InitStruct);
FL_ErrorStatus FL_EPWM_CHP_Init(EPWM_Type *TIMx, uint32_t channel, FL_EPWM_CHP_InitTypeDef *TIM_InitStruct);
FL_ErrorStatus FL_EPWM_DCEvent_Init(EPWM_Type *TIMx, uint32_t event, FL_EPWM_DCEvent_InitTypeDef *TIM_InitStruct);
FL_ErrorStatus FL_EPWM_SOC_Init(EPWM_Type *TIMx, FL_EPWM_SOC_InitTypeDef *TIM_InitStruct);
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FK5XX_FL_EPWM_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-05-11*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
